{"pageProps":{"course":{"name":"Chinese Native 3","department":"Foreign Language","description":"The purpose of this class is to enhance the students in listening, reading, writing, speaking and to prepare students to attend AP Chinese class in the next school year. The course advances to demand more extensive reading and conversations on contemporary China and the US and World event, reading writing of longer text, and reading of short passages. Students will be introduced to read and appreciate Chinese poems, modern poetry and ancient poetry. The course is proficiency-based, implying that all activities within the course are aimed at placing the learner in the context of the native-speaking environment from the very beginning. Learners are provided opportunities to participate in interpersonal, interpretive, and presentational communication; using the language to investigate cultural practices and products and reflect on the perspectives that underlie them; acquire knowledge and new perspectives from authentic target language sources; learn about the nature of language and culture and how each manifests itself in human communication; and take language beyond the classroom in real-world interactions. In addition, this course aims to promote 21st century skills by providing the students with opportunities to think critically through constant analysis, comparison, and evaluation of content, culture, and language. The students will have opportunities to work cooperatively with their classmates. Also, the course integrates many learning technology tools that will help to promote the students' technology literacy.","AtoG":"E-Language other than English","length":"Yearlong","prerequisites":[],"classes":[{"name":"Chinese Native 3","block":"1","semester":"Fall2014","teacher":{"name":"Jing Liang"}},{"name":"Chinese Native 3","block":"1","semester":"Spring2015","teacher":{"name":"Jing Liang"}},{"name":"Chinese Native 3","block":"6","semester":"Fall2015","teacher":{"name":"Jing Liang"}},{"name":"Chinese Native 3","block":"2","semester":"Fall2016","teacher":{"name":"Jing Liang"}},{"name":"Chinese Native 3","block":"5","semester":"Fall2019","teacher":{"name":"Ning Zhang"}},{"name":"Chinese Native 3","block":"5","semester":"Fall2020","teacher":{"name":"Ning Zhang"}},{"name":"Chinese Native 3","block":"5","semester":"Spring2021","teacher":{"name":"Ning Zhang"}}]}},"__N_SSG":true}