{"pageProps":{"teacher":{"name":"Jenna Welch","departments":["Physical Education"],"semesters":["Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"PE 1","block":"3","semester":"Fall2019"},{"name":"PE 1","block":"6","semester":"Fall2019"},{"name":"PE 1","block":"7","semester":"Fall2019"},{"name":"PE 1","block":"8","semester":"Fall2019"},{"name":"Yoga","block":"2","semester":"Fall2019"},{"name":"Yoga","block":"2","semester":"Spring2020"},{"name":"PE 1","block":"3","semester":"Spring2020"},{"name":"PE 1","block":"6","semester":"Spring2020"},{"name":"PE 1","block":"7","semester":"Spring2020"},{"name":"PE 1","block":"8","semester":"Spring2020"},{"name":"Yoga 1","block":"2","semester":"Fall2020"},{"name":"Yoga 1","block":"2","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-06T19:30:37.539Z","text":"She's super strict and assigns a TON of worksheets. She also only calls out the girls for dress code violations, which is SUPER annoying. Shes an easy A tho, but its just too much work for a PE class.","rating":2,"version":0},{"timestamp":"2020-05-06T17:17:35.164Z","text":"Ms.Welch is a pretty decent teacher. She cares a lot about her physical activities and her book work. One complaint is that my friend was injured and unable to do stuff but Ms.Welch seemed like she didn’t believe her. She assigns weekly worksheets ( a pain in the ass )and after a unit a quiz. I mean if you just participate you’ll do fine but there are better teachers out there lol\n","rating":3,"version":0},{"timestamp":"2020-05-06T09:39:30.674Z","text":"she's a really amazing teacher. i had her during her first year at lowell. she was a little strict at first, but she was still really nice. she is a little more biased towards girls, but it's understandable because the boys are always fooling around in her class. she teaches her students really well. you'll really like her class if you change your mindset because she makes sure everyone is respectful of one another, and you'll feel comfortable in her class. overall a really good teacher and person, and she will definitely help you stay fit.","rating":5,"version":0},{"timestamp":"2020-05-05T17:15:16.049Z","text":"she grades assessment strictly. in tennis, if you don't end your swing at your shoulder she will deduct points. she also deduct points if you don't run the whole 4 laps. many worksheet work. she doesn't care if you don't feel well.","rating":3,"version":0},{"timestamp":"2020-05-03T00:07:12.128Z","text":"she assigns worksheets a lot. they are pretty easy but time-consuming. she cares a lot about your form and posture during exercises. there's literally no excuses to get out of an exercise unless you're wearing a cast or something...she won't really care if you don't feel good. as a person, though, she's actually really nice and sweet. take her if you want to work/learn a lot of pe","rating":3,"version":0},{"timestamp":"2020-05-02T20:45:06.016Z","text":"wouldn’t recommend. shes no fun and is way to strict. only pe teacher who assigns worksheets and such a waste of time. isn’t very sympathetic and good luck if youre feeling sick because she doesn’t care","rating":1,"version":0},{"timestamp":"2020-05-02T15:04:07.410Z","text":"She’s strict and treats PE like a very serious class, and is not kind to those who are feeling sick. She’s not one who jokes around and isn’t a fun teacher, but okay for the most part.","rating":2,"version":0},{"timestamp":"2020-05-02T00:28:18.144Z","text":"She is a really nice person, and her class can be fun. While she may grade you on worksheets more than the actual physical activity that you do, you may be a little more motivated to actually do physical work after you take her class. She focuses on improving your form during exercises or yoga sessions, and she dedicates lessons to learning about anatomy. She also makes you keep an organized binder. ","rating":3,"version":0},{"timestamp":"2019-12-13T03:33:57.178Z","text":"honestly, pretty DECENT teacher, having her isn’t too bad but holy hell, she treats PE kinda like an actual class which is not the greatest... since you have to actually do worksheets and etc. but she’s pretty nice :) She likes to do procedures and is very strict on ur performance/form/posture while you’re doing exercises but besides that, the PE exercises itself isn’t even graded on what u got. Oh yeah, don’t forget you need to memorize basic anatomy and types of exercises.  ","rating":3,"version":0}],"rating":2.7777777777777777}},"__N_SSG":true}