{"pageProps":{"teacher":{"name":"Adam Michels","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"American Democracy","block":"2","semester":"Fall2014"},{"name":"American Democracy","block":"4","semester":"Fall2014"},{"name":"AP Psychology","block":"6","semester":"Fall2014"},{"name":"AP Psychology","block":"8","semester":"Fall2014"},{"name":"American Democracy","block":"2","semester":"Spring2015"},{"name":"American Democracy","block":"4","semester":"Spring2015"},{"name":"AP Psychology","block":"6","semester":"Spring2015"},{"name":"AP Psychology","block":"8","semester":"Spring2015"},{"name":"Community Based Work","block":"2","semester":"Spring2015"},{"name":"Career Preparation","block":"8","semester":"Spring2015"},{"name":"Career Work Experience","block":"4","semester":"Spring2015"},{"name":"Career Work Experience","block":"7","semester":"Spring2015"},{"name":"Life Skills","block":"3","semester":"Spring2015"},{"name":"American Democracy","block":"6","semester":"Fall2015"},{"name":"AP Psychology","block":"2","semester":"Fall2015"},{"name":"AP Psychology","block":"4","semester":"Fall2015"},{"name":"AP Psychology","block":"8","semester":"Fall2015"},{"name":"American Democracy","block":"6","semester":"Spring2016"},{"name":"AP Psychology","block":"2","semester":"Spring2016"},{"name":"AP Psychology","block":"4","semester":"Spring2016"},{"name":"AP Psychology","block":"8","semester":"Spring2016"},{"name":"Life Skills","block":"2","semester":"Spring2016"},{"name":"Career Prep","block":"3","semester":"Spring2016"},{"name":"Community Based Work","block":"4","semester":"Spring2016"},{"name":"Community Based Work","block":"8","semester":"Spring2016"},{"name":"American Democracy","block":"2","semester":"Fall2016"},{"name":"American Democracy","block":"4","semester":"Fall2016"},{"name":"AP Psychology","block":"6","semester":"Fall2016"},{"name":"AP Psychology","block":"8","semester":"Fall2016"},{"name":"Life Skills","block":"2","semester":"Fall2016"},{"name":"Career Prep","block":"3","semester":"Fall2016"},{"name":"Community Based Work","block":"8","semester":"Fall2016"},{"name":"Career Work Experience","block":"4","semester":"Fall2016"},{"name":"American Democracy","block":"2","semester":"Spring2017"},{"name":"American Democracy","block":"4","semester":"Spring2017"},{"name":"AP Psychology","block":"6","semester":"Spring2017"},{"name":"AP Psychology","block":"8","semester":"Spring2017"},{"name":"American Democracy","block":"6","semester":"Fall2017"},{"name":"American Democracy","block":"8","semester":"Fall2017"},{"name":"AP Psychology","block":"2","semester":"Fall2017"},{"name":"AP Psychology","block":"4","semester":"Fall2017"},{"name":"American Democracy","block":"6","semester":"Spring2018"},{"name":"American Democracy","block":"8","semester":"Spring2018"},{"name":"AP Psychology","block":"2","semester":"Spring2018"},{"name":"AP Psychology","block":"4","semester":"Spring2018"},{"name":"American Democracy","block":"6","semester":"Fall2018"},{"name":"American Democracy","block":"8","semester":"Fall2018"},{"name":"AP Psychology","block":"2","semester":"Fall2018"},{"name":"AP Psychology","block":"4","semester":"Fall2018"},{"name":"American Democracy","block":"6","semester":"Spring2019"},{"name":"American Democracy","block":"8","semester":"Spring2019"},{"name":"AP Psychology","block":"2","semester":"Spring2019"},{"name":"AP Psychology","block":"4","semester":"Spring2019"},{"name":"American Democracy","block":"6","semester":"Fall2019"},{"name":"AP Psychology","block":"2","semester":"Fall2019"},{"name":"AP Psychology","block":"4","semester":"Fall2019"},{"name":"AP Psychology","block":"8","semester":"Fall2019"},{"name":"AP Psychology","block":"2","semester":"Spring2020"},{"name":"AP Psychology","block":"4","semester":"Spring2020"},{"name":"American Democracy","block":"6","semester":"Spring2020"},{"name":"AP Psychology","block":"8","semester":"Spring2020"},{"name":"American Democracy","block":"2","semester":"Fall2020"},{"name":"American Democracy","block":"5","semester":"Fall2020"},{"name":"American Democracy","block":"8","semester":"Fall2020"},{"name":"AP Psychology","block":"6","semester":"Fall2020"},{"name":"American Democracy","block":"2","semester":"Spring2021"},{"name":"American Democracy","block":"5","semester":"Spring2021"},{"name":"American Democracy","block":"8","semester":"Spring2021"},{"name":"AP Psychology","block":"6","semester":"Spring2021"}],"reviews":[{"timestamp":"2019-12-11T04:10:38.482Z","text":"I freaking love Mr. Michels!! I had him for AP Psych and he’s honestly my favorite teacher at Lowell. His slides usually have a lot of clips from The Office or Seinfeld which are used as examples for many psych terms. He also doesn’t assign a lot of the busy work projects that the rest of the psych teachers give (yay less homework). In terms of grading he does 88%+ is an A but will also round you if you go and talk to him (I got rounded from 87.3 the first semester). He also treats the class like it’s a college one. When I had him, students would be sleeping or on their phones during the lectures and he never said anything. Even though I didn’t feel ready for the AP Exam in May, I ended up getting a 5. **Beware he will likely stalk your FaceBook and put some of your photos on his slides!!** :)","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Michels has designed his own unique American Democracy course, and it is excellent. He does not rely on a textbook. He keeps the class interesting by presenting moral dilemmas, current events, and humorous video clips. You will not have to do homework, but the tests are challenging, and you will learn about politics, philosophy, and the problems facing the U.S.Submitted by a student","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tests are kind of killer if you don't study, but he's such a sweet teacher! His lectures involve a lot of reading from text outside of the textbook but you can always tie it in to what you're reading in the textbook. A's are achievable, just don't screw up on tests.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes way better than my previous teacher so i guess i cant complain. not hte most exciting person though..","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BLAHHHH. B-O-R-I-N-G","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"most awesome apush teacher ever! he doesn't care if you aren't really paying attention, and even if you don't pay attention the topic sort of seeps into your brain so you know it for tests. if you get below a B on a test you can do extra credit to bring it up. he is also totally hillarious with his random, stupid jokes. i totally looove him. his class can be pretty fun. also, if you read the book and take a few notes in class the tests are a total snap. he also puts sample ap questions on tests.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Economics. He's fun, laid back, and tells lame jokes which are funny. He has an obsession with tapioca, but overall, pretty chilled class. We did a Urban Plan project, very intresting and informative. I liked his class, and his multiple choice tests are okay. not that hard a grader. Reccomended!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He does lecture in AP, but that is helpful, and he jokes around. He also has great video clips and some good simulations. Very sharp and humorous, and not an unreasonable amount of homework.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"everyone says he good but i definitly wasnt prepared for the ap exam. dont take him if you really want a 5 or really want to learn.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a great teacher. He knows his material and he is funny and fair. He will go out of his way to give you an opportunity to raise a low test score. Negative comments are just an attempt to stop his classes from filling up.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not a good teacher; I regret taking him. His only redeeming quality is his ability to give out concise lectures. He's a liar though. When he says he's lenient, he's really not. For example, he says would give generous curves to his tests but he only boasts it up 2-3 pts (and that's if the class can argue effectively). If you get a C on his tests, it's pretty normal.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He knows the material well, and he has a dry sense of humor when he delivers it. He gives us funny ways to remember obscure facts. There is work, but he is flexible and reasonable. He's an excellent choice for AP or econ.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"sooo nice. for econ you have to do the wkbk, he actually checks, and it actually makes a difference. it's not hard if you actually do the work. you don't really have to go to class everyday to get what's going on. and you can do whatever during class.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good guy, but not very exciting. never learn anything because class is so boring","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take him for regular econ. We read Fast Food Nation and saw Supersize Me. He's so funny and sarcastic sometimes. I didn't learn as much as I expected about economics (big concepts are clear, but don't have that many small details), but I compared notes with friends in other regular econ classes and it didn't seem that different. Maybe I should have taken AP Econ for details. [thinks] Naw... it's not as fun, I hear.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"eh... i didnt really learn all that much","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Okay for APUSH. All he does is lecture in class, but he does point out most of the significant events in U.S. History. You really do have to self-study for the AP exam, but his class alone will probably get you a 3 and above.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. michels is definitely an easy A teacher. his test are easy if you study and also the curve is about 10 percent if you do the outlines. he does prepare you well for the ap test and at the same time his class is entertain or as entertain as a history class can be.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for Econ. It's a senior class and he grades in such a way that it's very, very hard to not pass. He usually makes sense, though sometimes he says things and you're thinking, \"Wait, what?\" Just be sure to ask him to clarify and you should be okay.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Sadly, the old \"optional outlines\" are no more... but I love the class! You get videos and fun presentations! Tests are kinda bad if you don't study, cuz some of the problems are from AP exams. Great class nontheless!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Michels last year for APUSH and it was awesome (except for the unlucky fact that the two times I actually did outlines, he didn't collect the chapter I did. xP). I miss his lame jokes. LOL. Almost every time he showed a video I fell asleep...","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"chill class, good teacher.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Michels is easily my favorite teacher at Lowell. I've ad him for both APUSH and now Psych, and hes been fantastic in both. He's extremely reasonable and cool and swaggalicous. He understands what, how long, and the roper methods to teach his various subject matters. His passion for teaching is only rivaled by his brilliant humor and compassion for his students(or that might just be me hahaha).","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hes better teaching US history than econ. Tries to be entertaining, very lax. If you're taking econ, take him,boring but doesnt cuts care about. Has dorky jokes,see vids but,eaz B","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Michels has is one of coolest teachers at Lowell. I loooooove him. He's a really nice guy and his tests aren't too hard. Outlines are optional. He curves his tests and if you do the outlines you get an extra 5%. He grades the FRQs and DBQs fairly. He also has cool and interesting moves clips so you don't get too bored after his lectures and he tells random jokes, which can be amusing. I felt very well prepared for the AP test. I'm going to miss his class soooooo much!!!!!!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pretty cool teacher. Tests aren't too bad and in between lectures, he shows us a clip relating to the topic. Not as boring as some of my history classes have been and I do reccomend him. Certainly not the most entertaining, but not many teachers can be if they are teaching history.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very nice guy, but i didnt learn as much as i hoped. my grade suffered because of it. stupid AP test","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Barely any homework. Just read the book and the tests will be easy. His class is never boring for some reason - probably because he shows video clips, and always makes a funny, sarcastic joke.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"michels is SOOO funny. totally cool teacher. lets u eat, sleep, be late, and cut. very knowledgeable in ECON. loved his class. he hardly ever ever gives homework like once a week. his tests are really straightfoward no tricks and you dont really have to study he tells you whats going to be on the test. take him hes the easiest and best social studiest teacher. you WILL learn and its so easy to get an A. practically everyone got an A.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for AP U.S. History when we had them optional outlines. Good times being lazy. He's an awkward dude, but likeable nonetheless. Laid-back, but y'all must keep up with the material. Tests are average.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"too perfect for words. *dies* he is very wonderful !!!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hes a great reg teacher!! n he is suPER NICE!! =D","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i should have taken someone else for apush. i don't like him since he gives out random test questions that are irrelvant.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Actually the best teacher at Lowell and the most chill person you will ever meet. Someone in my class was 20 mins late every day and he just made a joke out of it. People would cheat on his tests and he would say something like \"oh come on you're totally cheating man, stop it\" or \"hey! put the book away.\" An 88.6 in his class is an A. He let someone make a phone call during one of his tests. He lets you sleep in class if you want and you can use your phone. I got a 5 on the AP Psych test too.Submitted by a student","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"GREAT","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"As an AP Psychology teacher, he's a really good teacher. His tests are really easy and the only homework he assigns are textbook notes. If you read fast, you can finish tests in around 15-20 minutes. He grades really leniently for FRQs. It's hard to not get an A. He also doesn't really teach from a textbook. Instead he incorporates fun clips and educational videos into his lectures to spice the information up. He's super nice and approachable, and I definitely recommend him.Submitted by a student","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He isn't much of a teacher, but I like his class very much. It's entertaining and always fun to be in. But his tests can be a little difficult. You do have to study for the tests, and if you don't .. well, your grades are mostly based on tests. But if you do the outlines it's not hard to get a B in the class.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"lol he's hella funny. A easy too","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool teacher, optional outlines for extra credit but i suggest doing them so you do well on the test. generally easy. you get to watch a lot of video clips in his class that is a nice break from constant lecturing. the frq and dpq are graded fairly and not too hard. the multiple choice test have a cuvre, about 3-5 percent in generally and about 5 percent more if you do the outline, that is amost a 10 percent curve, a whole grade practically","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really nice. His quirkiness is very endearing, and he makes the class enjoyable with his teasing humor. His lectures sometimes verge on boring, but then, I feel that way about a lot of history teachers. As everyone has said, an A is achievable.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best APUSH teacher ever. Laid back, funny, tests are easy if you read CourseNotes and the book. He really points things out that you could see on the AP test. Pay attention to his vids/clippings, very important. Really fun projects. Best part: schedules lectures so class is done on time for AP's. :)","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his lectures weren't that boring. but your whole grade (almost) is based on tests, which are somtimes hard. for apush at least","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Legit teacher. Easy class.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Kind of dorky but he teaches well.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really, really, boring. like mr.reynolds boring.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Michels is a great teacher! I have him for AP Psychology. Its mainly lecturing but he includes interesting videos and clips that will not bore you! He's very funny too, but his tests are difficult if you study last minute. get your outlines done, don't procrastinate. :)","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Well I just got my AP score, and I got a 5! Im sure it wasn't because of my teacher first semester, so it had to be Mr. Michels! He's the nicest guy ever and is somewhat lenient. His lectures are very helpful but not too exciting. His tests are rather hard and you cant use the excuse \"you never taught us that\" because he says its only fair to do that because the AP has questions that youll never see.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hm.. its like impossible to get an A. tests are very challenging","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lazy teacher. If you want a good score on the AP test take Shure, Wold or Bellville.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Extremely funny and knowledgeable. He has the perfect clip for every concept in AP Psych., and he keeps up the the most current research in the field. The notes are graded a bit strictly, but it helps you learn the material. One of the best classes at Lowell.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. michels is extremely funny in this really dry and sometimes mean way. it's really odd because he seems like a total homebody, but man he has a wicked sense of humor!! oh and he seems like a perfect husband and dad. haha. back to my point, he is a very good teacher.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for AP Psych this year and it honestly has been the best class I've taken at Lowell. Its the only class I've actually looked forward to going to. The subject itself is interesting and incredibly easy, but Mr. Michels makes it so funny and enjoyable. Funny lectures, barely any work. Hes almost a friend. Going to miss this class so much, take him!!!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his class is filled with anecdotes and videos. optional outlines are definitely a plus for the stressed out junior. tests are pretty easy. you will remember things for the AP test, so no worries. i got a 5 (:","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For econ he's easy, but for US...uhh not really. He does have boring lectures but they are good ones. U can get an A but u have to teach urself the material...","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a really great apush teacher. i did really well on the ap test, with a lot less work than my friends in the other classes. you barely have to try to get a B and a 3 or 4.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great APUSH teacher!!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I'm still p/o'd that Michels's classes filled up so quickly this semester. A lot of people ended up regretting taking him. He isn't the type of teacher that gives a lot of homework/reinforcement. It's up to you to study for the tests and do the outlines for an extra 5% boost on your test grade. I really liked his class because it was so laid back, and he always made humorous remarks.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Sarcastic. Really nice. I fall asleep in his class all the time though, but he doesn't care. Just read the book and do the outlines, even if they're optional.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Have him for psych. He teaches using his powerpoints and a bunch of videos. Interesting videos but I don't pay attention during class, just study textbook notes (his only hw) and you'll do fine on the tests. The class is just fun, esp if you have friends in the class. I felt like I did good on the ap test but i was self-motivated to study. 100% would take againSubmitted by a student","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is great teacher and very funny, in a subtle way. Some of the movies he shows are bit somniferous, but I like how he uses different medias.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very funny. Smart. Well-prepared and fair.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. adams is an awesome social science teacher. knows his stuff. really great econ teacher. gives a lot of a's some b's hardly any c's or lower. not much hw at all for you slackers. tests are simple and straightfoward. doesnt try to throw trick questions at u. also very funny. can do pretty much anything in his class: eat, sleep, or not show up at all. awesome dude.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nothing special about him. not good. not bad.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's okay, his lecture may get a bit boring at times, but from time to time he would try to crack up some jokes. He's very understanding and his tests are alright as long as you study for them!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i loved his APUSH class! I slept and ignored the daily history videos he showed, his boring lectures, and just about the countless group presentations on trivial topics. Then i got my score and boy...not too pretty. Easy A","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"American Democracy is a breeze if you take notes and participate in projects. The lack of homework and reading is a plus. He is pretty funny but can be extremely biased/opinionated.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he does teach what you need to know, but is SO boring that it's impossible to stay awake","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I thought Mr. Michels prepared us really well for the AP test. His lectures aren't very exciting, but they are rather helpful. His tests are actually really challenging and very detailed, so you have to read the book. The homework is optional and extra credit, but many decide to do it since otherwise tests are worth 100% of the grade (and their average is usually a C). Such a nice guy!! Very patient and understanding!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he does teach what we need to know, but he is SO boring... his lectures really dont stick. the good thing is, he's a nice guy","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really nice person that makes apush fun,err,less boring.worried that i won't' do too well on the ap exam tho.i have an a,but have never done an outline...but take him!he fills up FAST in arena. i was 5th pick= LAST SPOT wth?","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for Econ. Very cool guy. Nice and understanding about senior year. He isn't the greatest teacher, but got the job done and tried. He isn't ridiculous or anything, and his class isn't boring. I would take him again for sure.","rating":4.1,"version":1}],"rating":4.112676056338027}},"__N_SSG":true}