{"pageProps":{"teacher":{"name":"Alena Killpack","departments":["Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Biology","block":"2","semester":"Fall2014"},{"name":"Biology","block":"4","semester":"Fall2014"},{"name":"Biology","block":"5","semester":"Fall2014"},{"name":"Biology","block":"7","semester":"Fall2014"},{"name":"Biology","block":"8","semester":"Fall2014"},{"name":"Biology","block":"8","semester":"Spring2015"},{"name":"AP Biology","block":"3","semester":"Spring2015"},{"name":"AP Biology","block":"4","semester":"Spring2015"},{"name":"AP Biology","block":"7","semester":"Spring2015"},{"name":"AP Biology","block":"2","semester":"Fall2015"},{"name":"AP Biology","block":"4","semester":"Fall2015"},{"name":"AP Biology","block":"6","semester":"Fall2015"},{"name":"AP Biology","block":"8","semester":"Fall2015"},{"name":"AP Biology","block":"2","semester":"Spring2016"},{"name":"AP Biology","block":"4","semester":"Spring2016"},{"name":"AP Biology","block":"6","semester":"Spring2016"},{"name":"AP Biology","block":"8","semester":"Spring2016"},{"name":"AP Biology","block":"3","semester":"Fall2016"},{"name":"AP Biology","block":"4","semester":"Fall2016"},{"name":"AP Biology","block":"7","semester":"Fall2016"},{"name":"AP Biology","block":"8","semester":"Fall2016"},{"name":"AP Biology","block":"3","semester":"Spring2017"},{"name":"AP Biology","block":"4","semester":"Spring2017"},{"name":"AP Biology","block":"7","semester":"Spring2017"},{"name":"AP Biology","block":"8","semester":"Spring2017"},{"name":"AP Biology","block":"3","semester":"Fall2017"},{"name":"AP Biology","block":"6","semester":"Fall2017"},{"name":"AP Biology","block":"7","semester":"Fall2017"},{"name":"Science Research","block":"10","semester":"Fall2017"},{"name":"AP Biology","block":"3","semester":"Spring2018"},{"name":"AP Biology","block":"6","semester":"Spring2018"},{"name":"AP Biology","block":"7","semester":"Spring2018"},{"name":"Science Lab","block":"10","semester":"Spring2018"},{"name":"AP Biology","block":"3","semester":"Fall2018"},{"name":"AP Biology","block":"6","semester":"Fall2018"},{"name":"AP Biology","block":"7","semester":"Fall2018"},{"name":"Science Research","block":"10","semester":"Fall2018"},{"name":"AP Biology","block":"3","semester":"Spring2019"},{"name":"AP Biology","block":"6","semester":"Spring2019"},{"name":"AP Biology","block":"7","semester":"Spring2019"},{"name":"Science Research","block":"10","semester":"Spring2019"},{"name":"AP Biology","block":"3","semester":"Fall2019"},{"name":"AP Biology","block":"4","semester":"Fall2019"},{"name":"AP Biology","block":"8","semester":"Fall2019"},{"name":"Science Research","block":"10","semester":"Fall2019"},{"name":"AP Biology","block":"3","semester":"Spring2020"},{"name":"AP Biology","block":"4","semester":"Spring2020"},{"name":"AP Biology","block":"8","semester":"Spring2020"},{"name":"AP Biology","block":"3","semester":"Fall2020"},{"name":"AP Biology","block":"5","semester":"Fall2020"},{"name":"AP Biology","block":"7","semester":"Fall2020"},{"name":"AP Biology","block":"3","semester":"Spring2021"},{"name":"AP Biology","block":"5","semester":"Spring2021"},{"name":"AP Biology","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-03T00:48:50.038Z","text":"Ms. Killpack is a very nice teacher that is accommodating to students. I have her for AP Bio. Her class and Ms. Christensen's class are basically in the same material. Her tests are not overly hard, there's tests on Mondays that consist of around 12-14 MCQ and 1 FRQ. She will curve tests, and her class is not at all as long as you keep up with the material consistently. Part of the grade is participation, which is done every 2 weeks. You only have to participate twice, by either asking questions, passing out graded papers, or being the person tracking the participation. Very little homework. She gives out study guides for the test, but the study guides are fully optional and will not make your grade go down if you don't. She is not a harsh grader,and I really recommend her as a teacher.","rating":5,"version":0},{"timestamp":"2019-11-14T04:16:31.853Z","text":"Have her for AP bio. The class is easier than others, but at the expense of learning more. Half the time she lectures and half the time we do labs. The labs themselves are pretty fun, but I don't learn much from them. We have notebook checks every once in a while, which boost your grade (easy as long as you dont procrastinate on the labs like I do). She gives everyone study guides to fill out, which really help with understanding the chapter. We don't have Unit tests, just regular chapter tests every other Monday. The FRQs are a bit easier than other classes, but you may need to self study to get a better understanding. She's VERY nice, probably one of the nicest teachers I have. She also gives extra credit if you go to LSRP every Tuesday and Thursday. Overall you don't learn as much as others I think but I recommend her if you want an easier and funner class.","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very easy. I had a 99% in her class. She is open to help students and really nice and chill. U wont regret taking her!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP Bio, my hardest and favorite class sophomore year. You have to be interested in bio to fully understand her class, especially when there's powerpoint lectures for the entire class. If you are, she makes learning so enjoyable and is really relatable, she won't nag you if you don't apply yourself but if you ask for clarification she will make it her duty to help you understand. Monday quizzes are stressful but there's many opportunities to bring your grade up, amazing teacher AND friendSubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"In my experience, Ms. Killpack is one of the best and nicest teachers in Lowell. Even though taking AP Biology by itself is challenging with all the memorization and terms, she makes the class fun with her labs and jeopardy questions. Even though her study guides are a lot of work (sometimes up to 6 hrs), they do make you more accustomed to the material if you decide to do them (since they are optional). You won't regret taking her as a teacher!Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MS. KILLPACK I had her for AP Bio. She is super passionate about biology and tries her hardest to help people learn. Memorizing the huge load of vocab in the course is a challenge but killpack makes it fun. The only homework is a study guide (directly from the book) every 1-2 weeks, which is OPTIONAL (extra cred) and then quizzes on most mondays. in class she does a powerpoint reviewing homework and then some labs and stuff. HIGHLY RECOMMENDSubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Yes! Take her no matter what!Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good luck! Lecture based and HARSH Lab grader! Worth 25% of your grade and boy is it confusing!!! Biology is easy though so yep!Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Killpack is one of the best teachers at Lowell. She's great at teaching (mainly she lectures), labs are interesting, tests are not too difficult (if you put in the effort to study), and she's always willing to provide additional help. You will definitely be prepared for the AP Exam, and most likely do well in her class, and the BEST part is you won't feel stressed!!Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her classes are usually very hands-on, with lots of labs and computer projects. She's extremely nice and will walk around during class and answer questions. She also offers advice for students when they have to decide what classes to take for the next semester. Not much homework, unless you have unfinished classwork. She's definitely one of my favorite teachers.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is amazing! Do a ton of fun labs in class and occasionally take notes. HW is just the questions at the end of each section in the text book. Be sure to take good comp. book notes because the final was open note. her tests are really hard but they don't weigh down your grade that much. notebook checks, hw, labs, make up most of grade. you can fail a test and still have an a in the class. she is super nice and approachable if you are confused with anything. would recommend her to everyone!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's a really great teacher. Most of the homework she gives you is out of the book too.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a pretty good teacher and is very clear. Don't worry about asking her for help because she will clear things up for you. Her tests are easy and most of the homework is out of the text.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is the best! I love her! she is so reachable unless ur one of the \"bad\" kids..(no bad kids in lowell) anyways she is an easy teacher and she explains it really well so we can actually understand... MUST TAKE!!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Nicest teacher ever I love her so much. She assigns very little hw but you still learn a lot. She is super helpful.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for biology and even though it was my worst subject, I thought that the class was fun and she was very nice. She's very willing to help, and I got an A for semester grade. I would've gotten a B if she didn't curve the final. I know that she only teaches AP bio now, but I would still recommend her. Def easy B if you do all the homework and labs.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I loved coming to her class, I found that if I applied my self in class & in labs I did well on her tests. I also found her to be an extremely good teacher helping me actually understand Bio.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"There are a lot of chances to boost your grade. She's too nice. Even for AP. You can't be this nice.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mrs.Killpack is one of my favorite teachers. The class is easy but I learn a lot about Biology. She lets you know what is expected of you for the tests and if you study you do good. We get to do a lot of class activities and labs.","rating":4.6,"version":1}],"rating":4.589473684210525}},"__N_SSG":true}