{"pageProps":{"teacher":{"name":"Alex Cheng","departments":["Math"],"semesters":["Fall2018","Spring2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Algebra 1","block":"1","semester":"Fall2018"},{"name":"Algebra 1","block":"5","semester":"Fall2018"},{"name":"Algebra 1","block":"7","semester":"Fall2018"},{"name":"Algebra 2","block":"2","semester":"Fall2018"},{"name":"Algebra 2","block":"4","semester":"Fall2018"},{"name":"Algebra 1","block":"1","semester":"Spring2019"},{"name":"Algebra 1","block":"5","semester":"Spring2019"},{"name":"Algebra 1","block":"7","semester":"Spring2019"},{"name":"Algebra 2","block":"2","semester":"Spring2019"},{"name":"Algebra 2","block":"4","semester":"Spring2019"},{"name":"Algebra 2","block":"1","semester":"Spring2020"},{"name":"Algebra 1","block":"3","semester":"Spring2020"},{"name":"Geometry","block":"4","semester":"Spring2020"},{"name":"Geometry","block":"6","semester":"Spring2020"},{"name":"Geometry","block":"7","semester":"Spring2020"},{"name":"Algebra 2","block":"1","semester":"Fall2020"},{"name":"Pre-Calculus","block":"5","semester":"Fall2020"},{"name":"Algebra 2","block":"1","semester":"Spring2021"},{"name":"Pre-Calculus","block":"5","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-08T19:51:59.282Z","text":"Mr.Cheng is really nice and is willing to help you when you need it. You should always take notes in his class any study them before tests. His class is not very engaging and we basically do practice problems and problems in the textbook  everyday. He isn’t the best at explaining and it can be difficult to understand unless you already know about the subject.","rating":3,"version":0},{"timestamp":"2020-05-06T17:31:18.004Z","text":"It is critically important that you take notes in this class but he makes note-taking very easy. I enjoy this class a lot, mostly because Mr. Cheng is the nicest guy and pretty much just wants everyone to have a good time and feel supported. He has a shy, nice, dorky energy that makes the class super fun. In the beginning, I struggled in his class a little bit because Mr. Cheng is a fan of his 'spicy' problems. 'Spicy' problems are problems that you will only be able to solve if you are that one kid who is smart enough to teach the class. He is fair about grading things like that though and has lightened up on the spicy problems. There really isn't an excuse to have less than a B in this class (putting aside extenuating circumstances). He provides all the possible practice and resources needed to succeed and makes himself available for students to ask any one-on-one questions at any time.","rating":4,"version":0},{"timestamp":"2020-05-05T01:55:58.841Z","text":"Super nice and down to Earth. He always prepares you well for the finals and never gives too much homework.","rating":5,"version":0},{"timestamp":"2020-05-02T20:47:18.269Z","text":"Mr. Cheng is really chill and nice. If math is a pretty easy subject for you- I would definitely recommend him. But if you struggle with math a little- probably go with another teacher. Hes not very engaging during class and just assumed everyone is understanding what he is saying. I had to work really hard at home to try and understand the material. Tests are HARD- way more advanced then classwork. ","rating":2,"version":0},{"timestamp":"2020-05-02T11:39:36.285Z","text":"I LOVED HIS CLASS :') tests are harder than the hw, but you should be able to get an A if you study and do the hw. his class is chill, and he's also really nice (befriend him!) and always willing to help. he'll do his best to re-explain any topics that are confusing to you, if you're just willing to reach out and ask. :)","rating":5,"version":0},{"timestamp":"2020-05-02T05:01:31.161Z","text":"cheng is an amazing teacher. i had him for algebra 1 and he's really interactive with students. funny and teaches well, had \"spicy\" tests but weren't that bad if you did and understood all the homework. patient and goes through work if u ask.","rating":5,"version":0},{"timestamp":"2020-05-01T23:22:38.815Z","text":"literally the best teacher ever, he is willing to help everyone, and is really nice if you befriend him.\n","rating":5,"version":0},{"timestamp":"2020-03-28T02:27:24.640Z","text":"teaches well as long as you pay attention, his tests and a bit harder than homework, so you need to self-study. he's a really nice person though, and his classes are really fun and interesting compared to other teachers. he always finds a way to make his students laugh. ","rating":4,"version":0},{"timestamp":"2020-03-28T02:25:45.431Z","text":"I love u mr cheng u a real one                    ","rating":5,"version":0}],"rating":4.222222222222222}},"__N_SSG":true}