{"pageProps":{"teacher":{"name":"Alice Kwong-Ballard","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Psychology","block":"1","semester":"Fall2014"},{"name":"AP Psychology","block":"3","semester":"Fall2014"},{"name":"AP Psychology","block":"5","semester":"Fall2014"},{"name":"AP Psychology","block":"1","semester":"Spring2015"},{"name":"AP Psychology","block":"3","semester":"Spring2015"},{"name":"AP Psychology","block":"5","semester":"Spring2015"},{"name":"AP Psychology","block":"2","semester":"Fall2015"},{"name":"AP Psychology","block":"4","semester":"Fall2015"},{"name":"AP Psychology","block":"6","semester":"Fall2015"},{"name":"AP Psychology","block":"2","semester":"Spring2016"},{"name":"AP Psychology","block":"4","semester":"Spring2016"},{"name":"AP Psychology","block":"6","semester":"Spring2016"},{"name":"AP Psychology","block":"2","semester":"Fall2016"},{"name":"AP Psychology","block":"3","semester":"Fall2016"},{"name":"AP Psychology","block":"6","semester":"Fall2016"},{"name":"AP Psychology","block":"2","semester":"Spring2017"},{"name":"AP Psychology","block":"3","semester":"Spring2017"},{"name":"AP Psychology","block":"6","semester":"Spring2017"},{"name":"AP Psychology","block":"2","semester":"Fall2017"},{"name":"AP Psychology","block":"4","semester":"Fall2017"},{"name":"AP Psychology","block":"6","semester":"Fall2017"},{"name":"AP Psychology","block":"2","semester":"Spring2018"},{"name":"AP Psychology","block":"4","semester":"Spring2018"},{"name":"AP Psychology","block":"6","semester":"Spring2018"},{"name":"AP Psychology","block":"2","semester":"Fall2018"},{"name":"AP Psychology","block":"4","semester":"Fall2018"},{"name":"AP Psychology","block":"6","semester":"Fall2018"},{"name":"AP Psychology","block":"2","semester":"Spring2019"},{"name":"AP Psychology","block":"4","semester":"Spring2019"},{"name":"AP Psychology","block":"6","semester":"Spring2019"},{"name":"AP Psychology","block":"2","semester":"Fall2019"},{"name":"AP Psychology","block":"4","semester":"Fall2019"},{"name":"AP Psychology","block":"6","semester":"Fall2019"},{"name":"AP Psychology","block":"2","semester":"Spring2020"},{"name":"AP Psychology","block":"4","semester":"Spring2020"},{"name":"AP Psychology","block":"6","semester":"Spring2020"},{"name":"AP Psychology","block":"2","semester":"Fall2020"},{"name":"AP Psychology","block":"5","semester":"Fall2020"},{"name":"AP Psychology","block":"6","semester":"Fall2020"},{"name":"AP Psychology","block":"2","semester":"Spring2021"},{"name":"AP Psychology","block":"5","semester":"Spring2021"},{"name":"AP Psychology","block":"6","semester":"Spring2021"}],"reviews":[{"timestamp":"2019-12-17T08:19:25.770Z","text":"Pros:\n- Informative lectures\n- Prepares you for AP exam\n\nCons:\n- Harsh as fuck with FRQ grading... if you don't use a word or sentence structure how she likes it, automatic 0 even if the answer itself is correct\n- Picky with binders. Ugly notes? -2. Didn't use the right color for shading this part of the diagram? -1.\n- No sympathy or leniency","rating":2,"version":0},{"timestamp":"2019-11-14T03:47:22.816Z","text":"Despite what other people say, I think the class isn't as hard as what they make it to be. As long as you pay attention to what she says in the lectures, the tests won't be too bad. They're pretty straight forward, and tells you exactly how to format the FRQs to make them easier. She usually curves the test by the second highest score, but it sometimes goes lower than that. The way you need to takes notes is a little strict, like every lecture you need to write a summary a certain way. But she's really passionate and energetic, and makes class really interesting! She uses some stories for her life as examples for some things which makes it pretty funny too. Probably my favorite class this year.","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Kwong knows her stuff and explains things well but she lectures all day every day (can get very boring), never any videos or fun activities like other psych classes. She is terrible at answering questions, she doesn't seem to like it when we try to clarify things, and can sometimes be quite rude when students she doesn't like ask questions. Also maybe this is just me but her voice is extremely high pitched and irritating and she squeals a lot.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AMAZING TEACHER. SHE'S SUPER NICE. Easy A/B. You'll learn a lot. One of the best choices.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't understand why so many people are complaining! She is one of the best teachers at Lowell. She's super nice, funny, and she makes the concepts easy to understand. Sure her class involves a little work, but it's not impossible if you're going to put in effort. She cares about her students and enjoys teaching. Just because she's a little harder than other teachers doesn't make her a bad one. Just ask her for help if you are having trouble. She will prepare you for the ap test (and life)","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mrs. kwong is an awesome teacher and person. she is dedicated, and is one of those teachers that encourage you to ask her for help if you need it. she cares!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her class is really fun. The projects are cool too.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cool teacher.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP Psychology test is coming up and I'm not even prepared. Note: Take anyone besides her. otherwise drop. She takes the fun out of this class and no one knows anything.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Kwong is super cool! She doesn't give too much homework, but lectures a lot. Her lectures are fun and interesting tho. Make sure you study for tests!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"lots of work and takes out the fun in psych. bad at teaching as she is terrible at explaining concepts. when she tells us to ask her questions we get more confused.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not easy, but really interesting and fun.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's pretty good for psych. Just don't save your outline til the last day... you'll have way too much to do. And if you know the study guide well, you're pretty much set. She sometimes brings in her outside info too (like names), so you should pay attention and take a lot of notes.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Kwong is really nice and I've learned so much about Psych and it's only been 2 months. Sometimes her class can get a little tedious with the lectures, but they do help you understand the material better. Tests aren't too bad and pretty much NO homework except for outlines every 2 weeks.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Kwong is soooo nice! I think all those bad reviews are out dated bc she's seriously amazing and super enthusiastic so it's hard to not be into her lectures. She's also really helpful and offers help outside of class and if you meet with her she makes sure you know the material. When I got her class I was expecting the worst but she's great!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't know what everyone else is talking about, this was a nice class. The grading was extremely nice, the lecturing is interesting, and the AP test was cake.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms kwong is amazing. theres a decent amount of work in the class, but you learn A LOT. and if she sees improvement in your grade, she'll give you the highest grade. (i had B,B+, A and she gave me an A). take good notes and study them b/c they will come in handy","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"DA BEST! kept me interested, is funny, and course is straightfoward","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Kwong is the best!!! and shes soo funny too!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Ms. Kwong for AP Psych. She really seems to know what she's talking about and she teaches/lectures in such a way as to make the class interesting. I didn't like outlining, but at least it boosts your grade!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She bases her FRQ questions on actual FRQ questions that have previously been administered in past AP exams. Her outlines are a pain to do, but are well worth the trouble. Her lectures are very informative and entertaining. Consider them a supplement to the book. Her tests are moderate to hard. You really have to study though. Other than that, she will thoroughly prepare you for the AP exam in the spring.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is my favorite social science teacher! you never feel sleepy in her class.. she's just so energetic!!! really good teacher!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MS. KWONG!!!! she got me interested in psychology. she's soooo funny and sooo cute and class is (almost) never boring!!! she's SUCH a great teacher...in fact my favorite teacher ever! she can be a little hard, but as long as you whole-heartedly do your work and listen in class, you should do fine! a GREAT person to talk to. she's like a friend and super down to earth! take her if you can!!!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SHES SUPPPPPPPPPPERRRRR NICE AND FUNNY!!! SHE HELPS YOU AND PREPARES YOU FOR THE TESTS, SHE CAN HELP U ONE ON ONE IF NEEDED, JUST PAY ATTENTION ND TAKE GOOD NOTES. EXTRA CREDIT IN THE FORM OF GROUPS","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she writes the actual AP exams so she knows what shes talking about. her lectures are at times hard to bare but everything she tells you is on the test. i wouldnt recommend to take her","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She WILL prepare you for the AP test but this is one of those classes where you stay up really late studying for. You will be outlining 40pg+ chapters every other week. There will be times when there are more than 1 chapter. She is impatient and likes to pick on people.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is an awesome, charismatic teacher and she promises she doesn't drink coffee. She is pretty hard but if you pay attention in class and engage yourself in the lecture, you will do well. I think she is one of the best teachers and person I have met at Lowell.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"everyday its so boring in her class and she goes way too fast on lectures. psych is not fun with her and she gives us hard tests.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mrs. Kwong is a great teacher. She knows and LOVES what she's talking about, so students are easily more engaged with the subjects she teaches (i.e. Psychology). Honestly, if you study hard, read the chapters, and know how to apply, you're down for an A.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i LOVEEEE mrs kwong! she's the best psych teacher ever, take her over shimmon! =P she's just as good. funny, energetic and really knows what's going on in your life because she eavesdrops =P great stories","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I am only able to succeed in the class due to my own independent study and guessing abilities. Ms. Kwong fails to provide clarity and organization in her lectures and does not prepare us for FRQs. In addition, she is incredibly passive-aggressive, demonstrates a lack of empathy for students, and attempts to hide behind a fake \"nice\" personality. There is a reason she is the last psych teacher left over in arena. I would like to congratulate her on the incredible feat of making psych boring.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had her last semester and she gives a lot of homework and essays. here tests are also really hard. i got B, B, A and still somehow got a A semester. near the end of the semester she tells us, \"wow u guys did lots of work.\" WOW SHE JUST NOTICE! her class is hard but u learn and its fun","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you think AP Psych is the \"hardest AP\", then you need to wake up and step up your game. Lowell has a many AP's that are harder. Honestly, her tests aren't that bad. She explains concepts really well, and in a fun and entertaining way that's EASY to remember.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her energy is contagious! Her lectures are interesting and informative.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"like the rest of the social studies department she is a great teacher. very funny and informative lectures. the multiple choices are ok on the average but the frq is hard.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best teachers at Lowell. She's experienced and knows how to prepare you well for the AP exam. She's very fun, energetic, and lectures are always interesting.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ignorant and unreasonable. She arrived 10 minutes late to my class's final and comes up with an unfair and not to mention elaborate way of grading the test. Overall a terrible teacher, boring lectures","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Kwong!- I'd take her class anytime. She makes history much more interesting and fun, yet it's easy to get a good grade, if you give the effort.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i loved her! her class can be tough, but i learned so much in her class, and had fun doing it. she is one of kindest teachers at lowell, plus, you GOT to love those cowboy boots!!!!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I'm sick and tired of the amount of cheating that goes on in two of her later classes. It's not fair that her first class has to study so hard, while her other two classes cheat. No one is prepared for the AP exam. I hate her; i should have dropped psych when I had the chance. Take anyone over her b","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i think she is the best teachr around. i actully learn somthing in her class and she let ppl eat in class n never yell at ne one","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i LOVE this woman's class !! =)","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Kwong is an excellent teacher and students should definitely take her AP Psych. Her lectures are paced and perfectly doable as long as you take the class seriously and not space out. Though, that doesn't mean that class is boring or dull. Her activities and personal stories will keep you interested. If you ever need help and if you can get to her out of class she's definitely able to help you academically. Don't be scared of taking her, in fact she one of the nicest and most caring teachers!Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"YAAY! Super fun class... you have to manage your time well, but she's really cool and energetic and it makes it almost interesting... =]","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"take anyone over her. you're better of reading the book than coming to class and suffering through her boring dreadful lectures. Refused to help me and gave up on some people in the morning class.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. kwong is great. She teachers extraordinarily well and her tests are pretty simple and on the easy side. Her class has probably been my most favorite. Not only do you learn, the class is always interesting and never boring.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she used to be the sociology teacher so if you want to \"read\" the motives/norms of society, take her... tch..if you can. her stories are always SOOOO entertaining; really works with students at the level of students","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Kwong is fun and energetic. Definitely a great midday boost when all your other teachers are boring and monotonous. Outlines and other work definitely helps you remember everything come May, so don't complain. She also tells great stories and is great to just talk to. Definitely take her class.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a great teacher. Her lessons are interesting and her tests are ok. Her teaching method is good.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MS KWONG! she is so funny and such an entertaining teacher to learn from. She has sooo many stories to tell! If you want a psych teacher that will let you ask questions, shes the one. THe other teachers have a very strict outline on what they need to finish and Kwong is always behind because she loves telling stories, but she always catches up anyway! Yes, she makes you do outlines, but if you spread it out throughout the week, itll be fine. [and skip sections that dont need any summaries","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I freakin love her. Her tests aren't easy but r clear, and outlining isn't a problem as long as you don't procrastinate. Her class is hilarious n really helpful preparing me for the exam. When i took the multiple choice part, I actually laughed. The APExam was easy sh!t thanks to all her prep!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy enough to get an A if you try. Never boring and you learn a lot.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very cool teacher, her lectures are pretty interesting and tests aren't too bad. Sometimes she doesn't get what people are asking though and she answers a whole different question but if you need clarification, you can always go to the book. Overall shes a good teacher to take =)","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AMAZING. You learn SO MUCH in her class. She covers the material REALLY well and really prepares you for the AP. Yes, you have to do outlines, but they help. Binder checks are an easy ten points. REALLY FUN CLASS. Take her!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think that she is wonderfull! she is so helpful and encouraging! definetly a teacher worth haveing!!!!!!! I LOVE MS.KWONG!!! &#9829;","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hella awesome! My fave teacher&class by far. She's really helpful/funny and makes things interesting and relatable. Sometimes she'll use her daughters or old bf's as examples of concepts. Doesn't assign unnecessary hw, and ppl complaining about the outlines shouldnt b/c they actually help. She's fun","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Glad to see her still teaching here! She was the one who piqued my interest in Sociology, one of the majors I ultimately took in college. Ask her about Charles Manson being set on fire!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great AP Psych teacher","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Five thumbs up for Ms. Kwong and her Five gum b/c u get a Five on ur AP Exam.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is the best teacher i've had at lowell so far, and i'm a junior. Her classes are so interactive and fun, though sometimes lectures can be a bore... but those days are rare. usually my mods 1/2 classes in previous years are tedious and sleep-inducing, but with 1/2 class with Kwong i'm always awake and ready to learn!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Way cool. Had her for Modern World and 1st sem. AP Psych. Always energetic. fun. Be sure to look over your notes from class before tests. DO TAKE HER.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE Ms. Kwong. She really know her stuff and is really passionate about teaching. Tests are not as hard as people claim and are curved very generously. The AP test was a piece of cake. Pay attention, take notes and you will have one hell of a year!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"miss kwong rocks. shes fairly hard, but if you pay attention, youll get atleast a B. her good attitude is contagious","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mrs kwong is awesome!! shes smart and energetic. you learn a lot without realizing it. tests are fairly hard, but no tricks. her energy is contagious","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Kwong is definitely not an easy A, trust me. However, she is an amazing teacher because she will certainly prepare you for the AP test in May. Though she's amazing, she does contain some flaws that I wish she could work on to make life easier for her subsequent students -- slowing down on her lectures, and teaching her students how to write FRQs better. Other than that, Ms. Kwong is awesome. I would definitely recommend her, if you want to challenge yourself.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Kwong is very knowledgeable and SUPER helpful if you go to her after school study sessions (WHICH I HIGHLY RECOMMEND). She is a great teacher and knows her stuff; she'll prepare you for the AP exam. Notes required before the test, but no homework!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shows clear favoritism and only bothers to learn your name if you are a favorite Enters in grades incorrectly purposely because she doesn’t like certain students. It’s been 3 weeks, and she’s clearly stated she doesn’t like me and has entered my grades in wrong so that I now have a 89.7 don’t take her. You learn all from the book. The only thing she does is write definitions on her PowerPoints and make stupid analogies.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"oFF tHe hizzo fo shizzo teacher!!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She sounds like she doesn't know what she's talking about. maybe she does, but she's terrible at explaining concepts. people who are confused ask her questions every day, and every day she confuses them more.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's on the AP review board, so that means she helps create that AP Psychology test. But does it mean that her students do well? NO. she gives us an abundant amount of irrelevant work and there are kids in the class who are really struggling with this subject. no wonder she has the lowest AP averag","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MRS KWONG! shes really intersting, but not easy. a very fun class(for MW)","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. kwong's great. people have been giving the impression that her binder checks are evil, but that's ridiculous. the binders are just your outline, your class notes, and a practice test for each chapter. in fact, they HELP your grade a lot. all together each binder check is 30 pts and a test's 100.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a pretty good teacher and its obvious she knows her stuff. Lectures are really fast and I still don't know how to write the FRQs even though the school year is almost over. She forgets to tell her classes sometimes, like if there's a test coming up, so check up with people in other classes. Just try your best, do the extra credit, pay attention in class, and try not to skip her class. If you follow up with the textbook and reread your notes, you should be good.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THANKS FOR THE 5 MS KWONG. I LOVE YOU! Ms Kwong's class was VERY interesting. I love Psychology. If you don't get an A in that class, there is something wrong with you. Just do the homework and use the study guide for tests.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she has mandatory outlines where she nit-picks for certain points, but it only motivates you more to focus on the main points. but overall, her class is very fun and she's just full of laughter and joy. her stories were definitely made my day on certain occasions. and she's always ready to offer you help. her tests can be a little hard at times, but it's based on older exams, so it really preps you. she also uses the AP times, so you'll have excellent time management when it comes test time.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's the best PSYC & Modern World teacher ever.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love ms. kwong, she is the coolest and best teacher i ever had. her lectures are very funny and entertaining but at the same time very informative. well i did not like to do her outlines, but they really helped. she prepares you extremely well for the ap test. i wish that i can take her again for another subject.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love love love ms. kwong so much! i agree that at times the outlines get tedious and just a hassle but i learned so much from her lectures. i often went to her office to ask for further clarification and she was more than willing to elaborate. sometimes i even went in just to chat with her. she is","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love mrs kwong. her class is rarely boring. lectures very interesting and funny. little homework and tests straightforward, but make sure you study","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"come on you guys, dont be so hard on ms kwong. test may be difficult but at least she tries to teach. its everyones responsibility to pay attention so if you dont get the concepts it's your fault not hers. and shes willing to help you one on one if you need it in her office. psych is the toughest ap","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's ok. I had her this semester and she's a nice person, but she cant really teach and she always changes the amount of points or when something is due and stuff like that. dont take her","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't know what all the other comments are saying. Ms. Kwong is a terrific teacher and has funny examples and personality. I did not experience experience any cheating firsthand. Maybe there was. but even so, is that really the fault of the teacher? I'm not really sure why she has such bad rep in","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very upbeat and energetic and helpful","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"by far the hardest ap psych teacher, but without question the best. she makes you do outlines and projects, but they definitely help you learn. she tells hilarious stories and is always kind, friendly, and there to help. i got a 5 on the AP test thanks to her. i didnt even really study much beforehand because i felt pretty prepared. definitely a must-take teacher.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP psych was so boring! i don't get why everyone likes her so much-she's nice, but not very interesting.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"not easy...but interesting. always in a good mood...which could be very contageous","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Kwong is a wonderful teacher. She is very informative and always willing to help. Almost all of her test questions are textbook-based, except some of the FRQ questions.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"kwong may know the material, but i still wound up getting a 3. some of my friends got a 2.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She assigns more homework than other AP Psychology classes, and she can be very meticulous. I enjoyed her classes because she told funny anecdotes. There's a lot of outlining, but most people wait until the day before binders are due to do them anyway. She is very helpful, since she's been teaching psychology for a while.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Kwong is a good Pysch teacher, but honestly I don't think she lives up to all the hype. Her lectures aren't boring, but they're not out-of-this-world either. They are extremely informative, but I guess I expected more. Take good notes - she's picky and WILL take off points. She also makes you take notes using a specific format. Be sure to follow her essay format, b/c she won't hesitate to give you a 0. She likes to use big words in her lectures. xP You'll score high on the AP test with Kwong!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms kwong is absolutely amazing. i had her for modern world and now for psych. shes very energetic and fun. lectures are rarely boring, and are usually very enjoyable, despite the many notes you have to take. the outlines are a pain, but they help you learn. becareful when doing the FRQs though, shes grades them pretty hard. I LOVE YOU MS KWONG","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really over rated. maybe its just me, but here lectures dont do jack. hardest psych teacher here, grades frqs real hard. u probably have to read the book like 4 times to do well on her test.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes cool. but not as easy as people think... gotta study study study for the tests and then u can get an A. shes REALLY interesting and energetic","rating":4.2,"version":1}],"rating":4.17419354838709}},"__N_SSG":true}