{"pageProps":{"teacher":{"name":"Andrea Struve","departments":["Social Science"],"semesters":["Spring2016"],"classes":[{"name":"Economics","block":"4","semester":"Spring2016"},{"name":"Economics","block":"5","semester":"Spring2016"},{"name":"Economics","block":"7","semester":"Spring2016"},{"name":"United States History","block":"2","semester":"Spring2016"},{"name":"United States History","block":"8","semester":"Spring2016"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had last pick and Ms.Struve was my only option for economics. (I even tried to transfer out from fear of getting a poor educational experience) However, her class was way better than expected. The reviews here don't do her justice. As long as you take notes in her class (I barely used the textbook, only studied off from my notes) and study off of them, you''ll get an easy A. She is also open to any help with college inquiry. Take care to remember lists from her notes and examples.Submitted by a student","rating":3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She can't teach and wastes our time in class for activities that don't help. She really doesn't know her material well.Submitted by a student","rating":3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have her for USH in the afternoon and shes a great teacher. Her lectures are really informational and she is willing to help her students afterschool. There is homework, but if you do the homework and if you pay attention during class, you'll be set.Submitted by a student","rating":3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a new teacher who struggles to teach the material she tests on in class. Her tests are extremely difficult and students have not been doing well on them, but she doesn't see any of it as her fault. In-class activities are usually a waste of time and do not help with anything on the test itself. She has also been moving quite fast, which is bad because she hasn't gone too in-depth on different events but asks students very specific questions on the exam.Submitted by a student","rating":3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Struve might be the worst teacher I've ever had. She treats her students with all the respect of a chew toy. She has the class chant in unison, \"Good morning Ms. Struve\" every morning despite the fact that her class consistently ruins my day. Her class is composed of the kind of projects you would do in elementary school, except not nearly as fun. You're graded heavily on your enthusiasm and presentation skills, despite it being an economics class. Ms. Struve makes me hate learning.Submitted by a student","rating":3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Struve is a nice teacher however she can't really teach. Her lectures are hands down boring. You can never be active in her class and that's one of the reasons why students don't participate. Then she calls on people and embarasses others. We are not learning. Everyone who aces the tests has already taken ap world and know the work. But all of her students fail the tests. And she expects everyone to remember everything she says. We're not robots, we cannot remember everythingSubmitted by a student","rating":3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Struve is pretty adorable. It's her first year teaching, so she is testing her methods. She really tries to make the class fun, with activities and projects, etc. Her tests are a little hard, because she doesn't realize what the reasonable amount of time back a student should be tested on. She has unit tests that test on everything you've learned about in that month, which is a lot, but the notes and her review days are really helpful.Submitted by a student","rating":3,"version":1}],"rating":3}},"__N_SSG":true}