{"pageProps":{"teacher":{"name":"Anne Freeland","departments":["English"],"semesters":["Fall2014","Spring2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020"],"classes":[{"name":"English 2","block":"3","semester":"Fall2014"},{"name":"English 2","block":"7","semester":"Fall2014"},{"name":"English 2","block":"6","semester":"Fall2014"},{"name":"English 2","block":"8","semester":"Fall2014"},{"name":"The Novel","block":"4","semester":"Fall2014"},{"name":"English 2","block":"2","semester":"Spring2015"},{"name":"English 2","block":"4","semester":"Spring2015"},{"name":"English 2","block":"8","semester":"Spring2015"},{"name":"The Novel","block":"5","semester":"Spring2015"},{"name":"The Novel","block":"7","semester":"Spring2015"},{"name":"English 2","block":"5","semester":"Spring2016"},{"name":"English 2","block":"4","semester":"Spring2016"},{"name":"English 2","block":"6","semester":"Spring2016"},{"name":"English 2","block":"8","semester":"Spring2016"},{"name":"The Novel","block":"2","semester":"Spring2016"},{"name":"The Novel","block":"8","semester":"Fall2016"},{"name":"AP English Language and Composition","block":"4","semester":"Fall2016"},{"name":"AP English Language and Composition","block":"6","semester":"Fall2016"},{"name":"Study Skills","block":"2","semester":"Fall2016"},{"name":"English 2","block":"8","semester":"Spring2017"},{"name":"AP English Language and Composition","block":"4","semester":"Spring2017"},{"name":"AP English Language and Composition","block":"6","semester":"Spring2017"},{"name":"Study Skills","block":"2","semester":"Spring2017"},{"name":"AP English Literature and Composition","block":"2","semester":"Fall2017"},{"name":"AP English Literature and Composition","block":"6","semester":"Fall2017"},{"name":"English 2","block":"5","semester":"Fall2017"},{"name":"Study Skills","block":"3","semester":"Fall2017"},{"name":"AP English Literature and Composition","block":"2","semester":"Spring2018"},{"name":"AP English Literature and Composition","block":"6","semester":"Spring2018"},{"name":"English 2","block":"5","semester":"Spring2018"},{"name":"English 1","block":"5","semester":"Fall2018"},{"name":"English 1","block":"7","semester":"Fall2018"},{"name":"English 2","block":"2","semester":"Fall2018"},{"name":"English 2","block":"8","semester":"Fall2018"},{"name":"English 1","block":"5","semester":"Spring2019"},{"name":"English 1","block":"7","semester":"Spring2019"},{"name":"English 2","block":"2","semester":"Spring2019"},{"name":"English 2","block":"8","semester":"Spring2019"},{"name":"Study Skills","block":"3","semester":"Spring2019"},{"name":"English 2","block":"2","semester":"Fall2019"},{"name":"English 2","block":"8","semester":"Fall2019"},{"name":"English 2","block":"3","semester":"Fall2019"},{"name":"English 2","block":"4","semester":"Fall2019"},{"name":"English 2","block":"7","semester":"Fall2019"},{"name":"English 2","block":"2","semester":"Spring2020"},{"name":"English 2","block":"4","semester":"Spring2020"},{"name":"English 2","block":"5","semester":"Spring2020"},{"name":"English 2","block":"7","semester":"Spring2020"},{"name":"English 2","block":"8","semester":"Spring2020"}],"reviews":[{"timestamp":"2020-05-06T17:21:20.934Z","text":"It's not eye-opening or awe-inspiring but it is enjoyable. Ms. Freeland has a perpetually exhausted demeanor that I relate to. 80% of this class is reading as a group and then voluntary discussion. She does the occasional reading quiz but those are fairly easy. She will have one essay and one in-class essay. You will get a good enough grade on the essay as long as you follow her directions about structure, I wouldn't get my hopes up about an A though. I enjoyed the class because of the in-class discussions. There will be days when everyone just vibes and talks about the book with no real direction to the conversation. Those days are great. The one reason some people might be hesitant to take this class is that you will have to perform at least two skits in a semester, she is very fond of them. As long as you are doing the reading and the work in class you will be fine and probably end the class with an A or a high B.","rating":4,"version":0},{"timestamp":"2020-05-06T07:08:05.121Z","text":"her class with friends can be fun. it is also easy to make friends in her class since theres a bunch of group discussions. make sure you read her reading assignments for homework, you won't know when there will be a pop quiz, and those really hurt your grade if you get one or more questions wrong. she is a harsh essay grader but overall a very nice person if you ask her for help. I'd say her class is an easy B and a hard A if you get full points for most of her quizzes. ","rating":4,"version":0},{"timestamp":"2020-05-06T06:21:29.823Z","text":"Get some friends in the same class and you'll have a good time. Can be strict sometimes, but generally pretty chill. She oftentimes arrives late. Sparknotes doesn't cover a lot of what is on her reading pop quizzes and they can tank your grade quickly (I had a C for a while because I got one incorrect answer). HARSH on essay grading and you only have one or two a semester.","rating":2,"version":0},{"timestamp":"2020-05-03T00:01:34.436Z","text":"She's definitely difficult if you're not good at writing essays. She misses class often for whatever reason, but sometimes forgets to give instructions on what she's looking for in writing. Homework is very easy and is basically completion, but if you already do all of the homework it won't help your grade, take her only if your good at essays.","rating":3,"version":0},{"timestamp":"2020-05-02T01:02:40.571Z","text":"Ms Freeland can be very lazy at times. She often comes to class late, talking to other english teachers and she doesn't put in essay grades until a month and a half later after you turned it in to her. Her class is mostly group discussions and class discussions. The homework is really easy and straightforward (Just read these pages and answer these questions). However, she grades hard on the essays. As long as you're good at writing essays, you'll do fine in her class.","rating":3,"version":0},{"timestamp":"2020-05-02T00:31:51.403Z","text":"This class is usually very chill. Ms. Freeland gives minimal homework, and usually her assignments are reading and answering questions about the writing that you just read. Her tests and essays can make or break your grade, so make sure that you pay attention to the stories that she gives you in class. Her finals are fun and she manages to keep you just alert enough so that you do not completely fall asleep in class. Take this class if you are good at remembering characters and details.","rating":3,"version":0},{"timestamp":"2020-01-24T22:56:43.708Z","text":"Freeland is the class to take if you don’t really care about learning English. She assigns minimal hw, most of which is just reading. If there is a reading assignment make sure that you remember the names of all the characters and other details like that because there will likely be a reading quiz and missing even a couple of questions can really hurt your grade. She grades essays and formal writing very harshly so if possible finish it ahead of time (like 3-4 days before it’s due) and then arrange to meet with her to go over it. Make sure to take any advice she gives you very seriously. The easiest way to lose a lot of points is to not answer the prompt so look back at it frequently and make sure that you do. Overall a pretty easy class to get and A and definitely a B as long as you work hard for the 2-3 weeks when you write the essay.","rating":4,"version":0},{"timestamp":"2019-12-10T18:54:22.318Z","text":"Really bad she grades unfairly sooo bad do not take bros","rating":1,"version":0},{"timestamp":"2019-09-21T04:39:24.757Z","text":"Had her for English 2 second block and one time she didn’t show up until 40 minutes into class. She doesn’t assign much other than reading for homework so your final project is worth quite a lot. Good class if you’re already good at english and looking for a low effort class.","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Freeland's a wonderful teacher. I had her for two semesters and I really wish I had her now. You earn your A through quizzes, tests, essays, group projects, etc. She's very understanding and doesn't play favorites. She's reasonable, and doesn't give you a huge workload. Her class is pretty fun too, and she'll definitely help you if you need it. Highly recommended :)","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Ms. Freeland for both English tenth grade and American Literature and passed with all A's. She's a chill person and tends to remember people better if you're talkative or if you help out with passing papers. She's laid back, really funny and I had no problem with her so I recommend you take her but if you want an A, you have to work for it.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Freeland is such a great teacher. I've had her for 3 classes and i wouldn't want another teacher. She teaches you how to write an essay. She helps you with anything you need improvement on and she is SUPER understand. Everyone loves her! she is a very good teacher","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Freeland is pretty nice and easy going. Her class is mostly fun. She may be a hard grader when it comes to certain stuff like essays and projects. Even so, she is a great teacher who is pretty easy-going and her class is not that bad.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Most boring class I have ever taken. I am a good writer when I am interested, but not here. If you're into dissecting books where the characters \"find inner peace\" and talking animals are analogies, by all means you will be a large part of the class discussion. But if not, stay away. Easy to get an","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She can help with the essay a lot if that's what you're looking for. Her quizzes are hard as she expects you know the details. Easy B. Hard A. Seems very nice, open to ideas.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took Ms. Freeland for AP English. She is a very kind person and knowledgeable, however, she does not seem to particularly enjoy class discussions which we spend 90% of the entire year doing, which makes the class uninteresting. She devotes a significantly small amount of time to preparing students for the AP Language test. Though she is helpful when you ask her to read over your essay, overall I feel that my writing has not improved at all. Her instructions and assignments are very vague.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Freeland is a really good teacher. She's not hard but not too easy. You basically read books in her class and write and analyze them. The one thing is she makes you write in pen for everything and if you forget to you get marked down. Though I highly recommend her. She is super chill.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She don't seem excited about english and doesn't inspire passion in her students. Classes are boring and she doesn't contribute anything to in-class conversations besides the bare minimum so it's hard to tell if you're on the right track or not.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Freeland is super duper chill. She gives a lot of assignments so getting a bad grade on one won't affect your grade too much. Make sure you read when she tells you to, because she gives reading check quizzes. Pretty easy if you're only decently smart.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's okay. Her class is mostly seminar discussions which never works at Lowell. Easy B, hard A. Doesn't prepare you for the AP exam, but you read more interesting books and she's way more chill than Yuan. You can tell who her favorites are but she's not as condescending as Yuan.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I've had her for just 4 weeks and already think she's good. Yes, she does speak low so you have to catch every word she says, but she's nice. Class can be a bit boring, but it's relaxed and I enjoy it, which is what really matters.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her class is very chill. But be warned, she's a hard grader. But if you ask her for feedback and help and actually take her advice, it'll definitely help. Easy B, hard A.","rating":4,"version":1}],"rating":3.6363636363636362}},"__N_SSG":true}