{"pageProps":{"teacher":{"name":"Anne Guina","departments":["Miscellaneous"],"semesters":["Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019"],"classes":[{"name":"English 1","block":"2","semester":"Spring2016"},{"name":"English 1","block":"6","semester":"Spring2016"},{"name":"ENGLISH 71 Honors","block":"3","semester":"Spring2016"},{"name":"ENGLISH 71 Honors","block":"7","semester":"Spring2016"},{"name":"English and European Literature","block":"1","semester":"Spring2016"},{"name":"English 1","block":"2","semester":"Fall2016"},{"name":"English 1","block":"4","semester":"Fall2016"},{"name":"English 1","block":"6","semester":"Fall2016"},{"name":"English 2 Honors","block":"7","semester":"Fall2016"},{"name":"American Literature","block":"1","semester":"Fall2016"},{"name":"English 2 Honors","block":"7","semester":"Spring2017"},{"name":"American Literature","block":"1","semester":"Spring2017"},{"name":"Leadership 1","block":"6","semester":"Spring2017"},{"name":"English 2","block":"3","semester":"Fall2017"},{"name":"English 2 Honors","block":"4","semester":"Fall2017"},{"name":"English 2 Honors","block":"8","semester":"Fall2017"},{"name":"Leadership 1","block":"6","semester":"Fall2017"},{"name":"English 2","block":"2","semester":"Spring2018"},{"name":"English 2","block":"4","semester":"Spring2018"},{"name":"English 2","block":"8","semester":"Spring2018"},{"name":"Leadership 1","block":"6","semester":"Spring2018"},{"name":"English 1","block":"2","semester":"Fall2018"},{"name":"English 1","block":"4","semester":"Fall2018"},{"name":"English 1","block":"8","semester":"Fall2018"},{"name":"Leadership 1","block":"6","semester":"Fall2018"},{"name":"Leadership 1","block":"6","semester":"Spring2019"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's generally very nice to everyone but she'll fvck you up if she doesn't like you. Essays are worth ~80% of your grade & if she doesn't like you, she'll make an excuse that your essay doesn't answer the prompt or doesn't have enough analysis & give you a C which screws up your grade. Is super passive aggressive if you're not satisfied with your grade & refuses to change it. I can tell that she's very kind to other people tho. I'm just the minority.Submitted by a student","rating":3.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I only started this semester with her, but she's fun, interesting, and very laid back! She makes English fun!Submitted by a student","rating":3.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Guina is great of you don't want a challange and want to just chill. However some people want a challange. You will not find it. Ms. Guina is very dedicated to her students and will put in time to help you out.Submitted by a student","rating":3.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's the nicest English teacher I've ever had at Lowell. Really easygoing and chill. Had her for her first semester at Lowell and she was wonderful. First assignment was a drawing based on the summer reading book and classes for the rest of the semester were mostly reading aloud. Quizzes were super easy and assignments were 95% reading the book. Great teacher, great personality, and overall really, really nice. Not even sure the other people here had the same teacher as meSubmitted by a student","rating":3.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Reallly nice teacher, easy A!Submitted by a student","rating":3.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"It is extremely easy to get an A in her class!Submitted by a student","rating":3.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't deny that Ms. Guina is nice or easy. However, she refused to round my 89% for the semester for the dumbest reason. I had an A 1st & 2nd grading period. She wouldn't round bc I napped in class ONCE. She's so boring idk what she expects. I helped pass back papers and participated and put effort into homework. But she only looked at me negatively. So she's getting 1 star for this. It's quite an easy class but I can't believe she wouldn't round...for THAT reason. Unbelievable.Submitted by a student","rating":3.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Guina is such a nice person, she rarely gives tests and only occasional homework when reading a novel. Only had like three essays both semesters, and one was the final. Really helpful with the essays we did have, and will help you improve your writing if you put in some effort and ask her. Class can be a little boring sometimes though if you're not in to english.Submitted by a student","rating":3.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I seriously dont understand why there are so many hurtful and fake comments about Ms. Guina. She is a wonderful teacher, she always is so happy and bright. Ms. Guina is always there for you if you need help with anything. She's very understanding and knowledgable. Honestly, she is the nicest and best English teacher I have had at Lowell. She seriously needs to stay because most of our English department sucks.Submitted by a student","rating":3.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Generally a boring class, in the end My semester long A dropped to a B thanks to a D on our final group project (she told us it was because we were unprepared, but we were missing a group member so I'm not sure what she expected), learned nothing in the class, biased grader DO NOT TAKE.Submitted by a student","rating":3.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Rather easy teacher, but a lot of busy work. She doesn't teach very much, and mostly just prints worksheets off online. She's really really nice and I highly recommend for the people who want an easy A, but for an honors class (71H) where I wanted to be challenged, I was very disappointed.Submitted by a student","rating":3.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she gave me a 0 for vocab (which are heavily weighted) because I \"plagiarized.\" I just took the definition from Google like everyone else! If she wanted us to define it in our own words, she should've said so. so now I've been stuck with a B & she refuses to hear my side of the story. she picked on ME for no reason. she has no empathy whatsoever and is dead insideSubmitted by a student","rating":3.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Omg I absolutely love her classes. She thinks a lot about students and is open minded to every idea and absolutely loves watching plays. Nothing in her class is hard so its really an easy A. She's very easy to approach and she makes English fun with a bunch of plays. Though you might want to participate from time to time since it is kinda a big part of your grade. Just know when shes marking to see who participates and you'll do fine.Submitted by a student","rating":3.5,"version":1}],"rating":3.5}},"__N_SSG":true}