{"pageProps":{"teacher":{"name":"Bonnie Daley","departments":["Science"],"semesters":["Spring2016","Fall2016","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Biology","block":"1","semester":"Spring2016"},{"name":"Biology","block":"2","semester":"Spring2016"},{"name":"Biology","block":"4","semester":"Spring2016"},{"name":"Biology","block":"5","semester":"Spring2016"},{"name":"Biology","block":"7","semester":"Spring2016"},{"name":"Biology","block":"2","semester":"Fall2016"},{"name":"Biology","block":"4","semester":"Fall2016"},{"name":"Biology","block":"5","semester":"Fall2016"},{"name":"Biology","block":"6","semester":"Fall2016"},{"name":"Biology","block":"8","semester":"Fall2016"},{"name":"Biology","block":"3","semester":"Fall2017"},{"name":"Biology","block":"5","semester":"Fall2017"},{"name":"Biology","block":"7","semester":"Fall2017"},{"name":"Biology","block":"8","semester":"Fall2017"},{"name":"Principles of Biotechnology 1","block":"2","semester":"Fall2017"},{"name":"Biology","block":"3","semester":"Spring2018"},{"name":"Biology","block":"5","semester":"Spring2018"},{"name":"Biology","block":"7","semester":"Spring2018"},{"name":"Biology","block":"8","semester":"Spring2018"},{"name":"Principles of Biotechnology 1","block":"2","semester":"Spring2018"},{"name":"Biology","block":"2","semester":"Fall2018"},{"name":"Biology","block":"3","semester":"Fall2018"},{"name":"Biology","block":"8","semester":"Fall2018"},{"name":"Principles of Biotechnology 1","block":"5","semester":"Fall2018"},{"name":"Principles of Biotechnology 1","block":"6","semester":"Fall2018"},{"name":"Biology","block":"2","semester":"Spring2019"},{"name":"Biology","block":"3","semester":"Spring2019"},{"name":"Biology","block":"8","semester":"Spring2019"},{"name":"Principles of Biotechnology 1","block":"5","semester":"Spring2019"},{"name":"Principles of Biotechnology 1","block":"6","semester":"Spring2019"},{"name":"Biology","block":"1","semester":"Fall2019"},{"name":"Biology","block":"2","semester":"Fall2019"},{"name":"Biology","block":"6","semester":"Fall2019"},{"name":"Biology","block":"8","semester":"Fall2019"},{"name":"Principles of Biotechnology 1","block":"4","semester":"Fall2019"},{"name":"Biology","block":"1","semester":"Spring2020"},{"name":"Biology","block":"2","semester":"Spring2020"},{"name":"Principles of Biotechnology 1","block":"4","semester":"Spring2020"},{"name":"Biology","block":"5","semester":"Spring2020"},{"name":"Biology","block":"7","semester":"Spring2020"},{"name":"Principles of Biotechnology 1","block":"4","semester":"Fall2020"},{"name":"Principles of Biotechnology 1","block":"4","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-20T23:08:42.262Z","text":"One of the better bio teachers. She assigns a lot of Cornell notes but the labs are pretty fun. You can definitely tell if she doesn't like you though. ","rating":3,"version":0},{"timestamp":"2020-05-12T08:57:27.952Z","text":"Don’t take her for bio she is very boring she definitely had favorites but you should take her class for an easy A ","rating":1,"version":0},{"timestamp":"2020-05-08T20:02:03.450Z","text":"Easy A and little homework. Some of the experiments are pretty fun. Class can be a bit boring","rating":3,"version":0},{"timestamp":"2020-05-08T19:58:41.341Z","text":"Ms. Daley is an okay teacher. Class isn't the most interesting, but you will learn. Easy A and little homework.","rating":3,"version":0},{"timestamp":"2020-05-07T00:01:56.500Z","text":"Pretty boring but super nice. Just make an effort and you’ll get an A","rating":5,"version":0},{"timestamp":"2020-05-06T06:55:40.931Z","text":"easy A. she does play favorites. boring class but i met some new friends in that class :)))","rating":3,"version":0},{"timestamp":"2020-05-06T06:43:09.824Z","text":"soooo boring literally i almost fell asleep everyday. i was always dreading going to class. she plays extreme favorite. moves very slowly but there are some fun labs. easy A but i do NOT recommend. if u do get stuck w her, try to get close with your table to make the class a little enjoyable. ","rating":1,"version":0},{"timestamp":"2020-05-05T17:18:55.142Z","text":"little sense of humor. little hard but you can still get an A. ","rating":3,"version":0},{"timestamp":"2020-05-05T01:54:44.209Z","text":"She definitely plays favorites, but even if she doesn't like you, the class is still an easy A. The finals are super easy, but you still can learn a lot in the class.","rating":4,"version":0},{"timestamp":"2020-05-04T21:18:09.579Z","text":"She’s a pretty easy teacher and she seems to care about the subject. The class can sometimes be boring, but she’s pretty nice. Her final was also extremely easy to get an A in as long as you were half paying attention and somewhat understand the subject. The final was just using common sense. She doesn’t have much homework, and when there is, it’s pretty easy. The notebook checks are also just easy grade boosters as long as you do completely mess up.","rating":5,"version":0},{"timestamp":"2020-05-04T21:16:19.232Z","text":"her class was alright she played favorite with some people ( I was one of them 😔) lowest grade you can get is a B+ her class was so BO000RING ","rating":1,"version":0},{"timestamp":"2020-05-04T00:22:40.259Z","text":"A monotone voice. She also obviously plays favorites. I was one of her favorites, so I wasn’t harmed by this, but I was friends with one of the students she didn’t like and she graded him much harsher than anyone else. Her work isn’t that hard though.","rating":2,"version":0},{"timestamp":"2019-12-09T03:11:15.993Z","text":"Bio class is pretty easy, but the multiple choice answers on her quizzes can be rlly trippy so be sure to study for that. Lots and lots of textbook/notebook use, doesn't give out much homework. Her labs can be quite lame compared to some other teachers but some of them are fun. Not the best personality tho. Class can get quite boring at times (I've almost fallen asleep more than once)","rating":3,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is very nice and helpful plus has fun experiments but also heavy notebook useSubmitted by a student","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"While an easy A, her class is extremely boring. \"Real\" experiments (actually examining plants and animals) are rare and are usually substituted by elementary school level experiments (pineapples and jello) or \"virtual labs\" (computer simulations from the internet). Her class is heavy on textbook reading, Cornell notes, metacognitive journals, and packets. However, she's a nice person and will often allow you to turn in homework late as long as you have a valid excuse.Submitted by a student","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A, however very boring...students constantly falling asleep in her class and she makes no real effort to make her class more interesting. She is also very forgetful having lost several students work claiming they never turned it in (I saw them turn it in) having them redo it, and later finding it and realizing she had misplaced it. If you want a class you can sleep through and ace this is it. If you want an interesting class, I would suggest another teacher.Submitted by a student","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy class (for Bio), lots of labs, and doesn't really lecture. She assigns lots of worksheets, textbook reading, and Cornell notes. Sometimes also gives \"exit tickets\" that are more like mini quizzes. Tests are usually mildly easy and almost always multiple choice (Scantron). You might have to self-teach if the worksheets and reading aren't enough.Submitted by a student","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"tests gave my friend and I anxiety when there was a test coming up. She doesn't teach very well and she was a VERY confusing person. She does make quilzlets when there is a test coming up but she always posts them very late and they aren't that good anyways. She calls on you based on card numbers but she doesn't give any homework. ps- you can find the worksheet answers online :)Submitted by a student","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Class is an easy A, but honestly it is boring. I found myself zoning out many times. Heavy textbook and notebook use, only good thing is that she gives two days for homework to be done. Not many real labs, most are just elementary ones or online simulations. Tests aren't hard, just study off the textbook and you should be alright.Submitted by a student","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's more of a middle school biology teacher. I gotta be honest, I learned pretty much nothing from that class because it felt like a big review of seventh grade life sciences, but a couple of classmates who had crappy middle school teachers siad that they learned.Submitted by a student","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"So Ms. Daley is a decent teacher. She knows what she's doing, but can sometimes be confusing. A lot of time I didn't know what I was learning in her class. She's a nice person, but don't expect to form a close student-teacher bond with her. Little homework, classwork is mainly labs and there are periodic quizzes/tests. She's better with independent students. Don't get me wrong, she'll help students, but her personality makes it seem like she's unapproachable.Submitted by a student","rating":3.2,"version":1}],"rating":2.980952380952382}},"__N_SSG":true}