{"pageProps":{"teacher":{"name":"Bruce Cohen","departments":["Math"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018"],"classes":[{"name":"AP Calculus BC","block":"3","semester":"Fall2014"},{"name":"AP Calculus BC","block":"5","semester":"Fall2014"},{"name":"AP Calculus BC","block":"3","semester":"Spring2015"},{"name":"AP Calculus BC","block":"5","semester":"Spring2015"},{"name":"AP Calculus BC","block":"3","semester":"Fall2015"},{"name":"AP Calculus BC","block":"5","semester":"Fall2015"},{"name":"AP Calculus BC","block":"3","semester":"Spring2016"},{"name":"AP Calculus BC","block":"5","semester":"Spring2016"},{"name":"AP Calculus BC","block":"5","semester":"Fall2016"},{"name":"AP Calculus BC","block":"4","semester":"Spring2017"},{"name":"AP Calculus BC","block":"5","semester":"Spring2017"},{"name":"AP Calculus BC","block":"3","semester":"Fall2017"},{"name":"AP Calculus BC","block":"5","semester":"Fall2017"},{"name":"AP Calculus BC","block":"3","semester":"Spring2018"},{"name":"AP Calculus BC","block":"5","semester":"Spring2018"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good guy. Loved his Geo H class. You can get an A, if you did the homework, and made an effort. I actually learned, and felt that my semester grade was well deserved.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"does not teach, gives almost no partial credit, introduces new terms on test","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Cohen will teach you how to think, understand and visualize. His pedagogy is very student-focused, and his belief \"that taking tests is a part of the learning process\" is uplifting, positive, and puts things in perspective.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy A if you show you are trying to make an effort. weird but true. and study for those tests. as long as you score around top 7 you get an A on the tests because they're curved. and ask questions!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very willing to help me out of class. tests are obscure though.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes a good teacher, but his calculus tests are very challenging, much harder than hoffman's i think.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"it always feels like you're not getting anywhere and progress is really slow, but by the end of the year, you realize that you've actually done something and here we are with 5s! And he's so nice about curving, =D","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"just when you start thinking hes the worst math teacher ever, you get a 5 on the calc bc test. and then you realize just how much youve learned. i never got As on any of his test. solid b's through. never an A on the report card. but i guess i was more than prepared for the AP test, even though i thought i failed at the time. cohen is the math god...","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome Geo H teacher. He really makes you think outside the box. To him, it's really not important whether you know the book material or formulas, but whether or not you can apply them and make them your own. His tests make you think. Construction work is based on a computer program, and he uses it to help us visually see some of the concepts we learn in class.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his tests are very challenging but hes a good teacher. u get a lot out of the class and he notices when you are tryin to improve in his class.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For his first geo H class, Cohen taught pretty well. Most of the tests were obtainable A's(although there was 2 that had some questions which made everyone get B/C's on them). Has good curves if everyone does bad on tests, and it's an obtainable A if you put effort into it. Lots of group work, and not a lot of lectures, so if you're a lecture-note type of person, i wouldn't recommend him. Incorporates online geo programs/normal day situations into some thought up problems, which is cool.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i thought that i needed to take morehen in order to get a 5 on the ap, but it turned out that cohen prepared us well enough too. and my senior grade didn't suffer unlike those who had morehen.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For Geo H, most class days, it seemed like he just ignored us, just assigning us something in the beginning of class and then going off to his computer. I started off with an easy A, but my grade slowy crawled down to a B. I guess this is what I get for not doing my homework (rather I study other subjects), but I wish that Cohen actually went over the material so I’d be more motivated to work and later find out if I completed the problems correctly. I pretty much feel as if I could have learned","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Math God...nuff said","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great math teacher. His tests are really hard, but he notices if your trying in the class and he lets you know if he thinks that your doing a good job","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr. Cohen for AP Calc BC. He knows what he's talking about, but likes to assign group work so we figure things out for ourselves rather than telling it to us. I think I \"hit the wall\" in this class, but I DID learn a lot. Do the journals -- they actually DO help.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is the best and kindest math teacher at Lowell in terms of teaching style, and personality.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"We all thought he couldn't teach, but then we all got 5's on the BC Calculus test. He's like God--he's got a plan, and you sure as hell don't know what it is.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Basically if you pay attention, and try, you can get at least a B. I never did any homework, i have a B+/A-, even though i got Cs both semesters in accel. He's really nice, and BY FAR the best teacher i've ever had at Lowell","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Even though his tests were hard, he teaches very well. He is a very nice person. He really prepare for the AP test and maybe you can even get \"5\" on AP","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cohen's a pretty good teacher. Tests are very vague--sometimes have nothing to do with the stuff you're learning, but prepares you well for other types of math","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THREE. DOCTORATES. HE'S A LIVING GOD AT LOWELL.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is more interested in your thought process and thinking individually than just mindlessly memorizing proofs from the book. He's really cool and nice and has EXCELLENT curves on some tests. The only bad thing is on some tests he gives a problem or question that calls for extreme thinking and piecing together a lot of information.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool teacher, helps u outside of class if u need help","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Freakin awesome. He's my math idol.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"In my opinion, he is by far a lot harder than Hoffman. If I had the chance to pick Hoffman in the first semester, I would have made that decision no doubt. TAKE HOFFMAN!!!! Cohen is all group teaching which may turn out to hard for certain people.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easiest teacher!!!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Cohen is a genius","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cohen is the math god. my best math teacher to date. just do your homework, even if it's not due and you'll ace the class, plus you'll get a 5 for bc for sure.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a pretty laid back teacher. he doesn't collect homework, so it's kinda hard to know whether you've done them correctly or not. his tests are hard.he really challenges you on tests rather than assigning honors problem for hw, so i found that really difficult. also, the # of possible points for each problem on the test is sometimes ridiculously high (hard 1)so you either get them or you don't. if you don't get these problems, it can lower your whole test by a grade. curving doesn't help much","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For Geo 1H, he doesnt seem to teach alot, hes a really techy person (using programs for constructions and such). He does not collect homework and usually does not go over them, pretty easy B. He grades almost all on tests. Tests are not easy and not too hard, pretty fair. Semester started quite easy and got harder along the way for me.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really knows his stuff. Has a lot of teaching experience. Has a grand plan. He teaches students of all ages, and uses very simple, understandable language in class. He manages to make things laidback while teaching you a way of thinking that really helps you understand the concepts and how they fit into calculus. tests are hard when there are proofs, but pay attention and its obvious if the proof will be tested. otherwise, tests involve tying concepts together and understanding the big picture.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He DOES NOT TEACH. Every day in his class comprises of solely working on worksheets and learning from your table mates. Does not give lectures or clear presentations. Very confusing to follow and learn from. Tests do not reflect curriculum or matters learned. If you love yourself, take Mr. Hoffman.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Cohen is pretty cool for Geo Honors. Some people complain that he doesn't teach, and that he wants you to figure things out yourself. Thats partially true, but that's what I liked about his class. He's always willing to help you though if you ask. Tests are manageable, sometimes hard, but geo honors is pretty tough already. Really chill on homework too. Take him.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His tests really test your understanding of the subject matter. I reccomend him for Geo H because if you pay attention in class, you will be apt to do well.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Prepares for the AP well. Good Teacher.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"We were all worried about how far Morehan got in Calculus BC, and it lloked like Cohen was taking his time. But then we all got 5's.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HE CANNOT TEACH. DONT TAKE HIM.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cohen is a genius n a great math teacher. he knows his math backwards and forwards and is very excited about math, esp geo. test sorta obscure","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's really nice and teaches well.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"computer guy","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He knows his stuff. He has a Math PhD and has taught college and done serious programming stuff - but does not make an issue of it. He puts effort into his classes, there is a good bit of group work and fewer \"oh look, new subject\" lectures, but every day something new comes up and it all flows well. It is the first math class that I have had at LHS that I looked forward to every day. Sadly, nobody knows what \"Cohen\"'s class S'06 will consist of. I wish him well. He is one of the school's best.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is one of the best teachers I have ever had, and throughout my college years I will be lucky if I come across a professor that teaches as well as Dr. Cohen.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really, REALLY nice teacher. People who say Mr. Cohen can't teach are partially right, but I'd rather choose him over Morehen anytime.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very different and interesting teaching methods, but I learned a lot.","rating":4.4,"version":1}],"rating":4.400000000000003}},"__N_SSG":true}