{"pageProps":{"teacher":{"name":"Bryan Ritter","departments":["Visual Performing Arts","English"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP English Language and Composition","block":"3","semester":"Fall2014"},{"name":"AP English Language and Composition","block":"7","semester":"Fall2014"},{"name":"Literature and Psychology","block":"2","semester":"Fall2014"},{"name":"Literature and Psychology","block":"8","semester":"Fall2014"},{"name":"AP English Language and Composition","block":"3","semester":"Spring2015"},{"name":"AP English Language and Composition","block":"7","semester":"Spring2015"},{"name":"Film as Literature","block":"2","semester":"Spring2015"},{"name":"Film as Literature","block":"8","semester":"Spring2015"},{"name":"AP English Language and Composition","block":"2","semester":"Fall2015"},{"name":"AP English Language and Composition","block":"6","semester":"Fall2015"},{"name":"Literature and Psychology","block":"3","semester":"Fall2015"},{"name":"Literature and Psychology","block":"7","semester":"Fall2015"},{"name":"AP English Language and Composition","block":"2","semester":"Spring2016"},{"name":"AP English Language and Composition","block":"6","semester":"Spring2016"},{"name":"Film as Literature","block":"3","semester":"Spring2016"},{"name":"Film as Literature","block":"7","semester":"Spring2016"},{"name":"AP English Language and Composition","block":"2","semester":"Fall2017"},{"name":"AP English Language and Composition","block":"4","semester":"Fall2017"},{"name":"Literature and Psychology","block":"5","semester":"Fall2017"},{"name":"Literature and Psychology","block":"7","semester":"Fall2017"},{"name":"AP English Language and Composition","block":"2","semester":"Spring2018"},{"name":"AP English Language and Composition","block":"4","semester":"Spring2018"},{"name":"Film as Literature","block":"5","semester":"Spring2018"},{"name":"Film as Literature","block":"7","semester":"Spring2018"},{"name":"AP English Language and Composition","block":"5","semester":"Fall2018"},{"name":"AP English Language and Composition","block":"7","semester":"Fall2018"},{"name":"Shakespeare","block":"2","semester":"Fall2018"},{"name":"Shakespeare","block":"8","semester":"Fall2018"},{"name":"AP English Language and Composition","block":"5","semester":"Spring2019"},{"name":"AP English Language and Composition","block":"7","semester":"Spring2019"},{"name":"Film as Literature","block":"2","semester":"Spring2019"},{"name":"Film as Literature","block":"8","semester":"Spring2019"},{"name":"AP English Language and Composition","block":"2","semester":"Fall2019"},{"name":"AP English Language and Composition","block":"6","semester":"Fall2019"},{"name":"Shakespeare","block":"3","semester":"Fall2019"},{"name":"Shakespeare","block":"5","semester":"Fall2019"},{"name":"AP English Language and Composition","block":"2","semester":"Spring2020"},{"name":"Film as Literature","block":"4","semester":"Spring2020"},{"name":"AP English Language and Composition","block":"6","semester":"Spring2020"},{"name":"Film as Literature","block":"7","semester":"Spring2020"},{"name":"AP Art History","block":"2","semester":"Fall2020"},{"name":"AP Art History","block":"6","semester":"Fall2020"},{"name":"AP English Language and Composition","block":"4","semester":"Fall2020"},{"name":"AP English Language and Composition","block":"7","semester":"Fall2020"},{"name":"AP Art History","block":"2","semester":"Spring2021"},{"name":"AP Art History","block":"6","semester":"Spring2021"},{"name":"AP English Language and Composition","block":"4","semester":"Spring2021"},{"name":"AP English Language and Composition","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-05T23:48:32.813Z","text":"I love his class, but I can't say he's a good teacher. I had him for AP english but he doesn't really teach. If you take AP because you're not a strong writer but are looking to improve, don't take him. If you're going to ace the AP exam regardless, he's awesome. His stories are epic. Most classes you can either participate or space out (but don't fall asleep or he'll throw a beanie baby at you). He gives pop quizzes, but if you read the book you're fine. Most books in his course are cool. Essays are graded fairly, but whether they're graded in a fair amount of time is another story. Hardest part is in-class essays: he gives 3 prompts for you to prepare notes for and rolls a dice the day of to determine which one you'll write in 45 min. If this scares you, check what the AP test is for this course before signing up. I'd recommend ONLY if you're already a confident writer. I'd definitely recommend him for a non-AP class like film as lit; it's a shame he doesn't teach it anymore.","rating":3,"version":0},{"timestamp":"2020-05-04T22:09:55.716Z","text":"He's pretty good for AP Art History but pick another teacher for AP Lang/Comp. ","rating":1,"version":0},{"timestamp":"2020-05-03T17:19:10.092Z","text":"How is Ritter getting all these good reviews, like actually he was so mean to our class. His pop quizzes were given very unfairly and graded essays extremely hard. I would not take him for Ap Lang/Comp","rating":1,"version":0},{"timestamp":"2020-05-03T04:40:47.134Z","text":"He has really interesting stories that he shares to the class, but sometimes they're a little scary to think about...","rating":5,"version":0},{"timestamp":"2020-05-03T04:38:53.368Z","text":"Dang idk where these bad reviews came from lol. I had a great time in Ritter's AP Lang/Comp class. He gave a lot of pop quizzes, but you could easily do well on them if you've read the book or looked at the sparknotes before class. He allowed us to use our notes during the quizzes as well, so you should have no problem if you put in a little effort. I think he graded the essays fairly, and he puts criticism throughout the paper to help you improve your writing. I do think that you have to be a decent writing before taking his class to do well though. He gave/taught us a whole packet of literary devices that could've potentially been on the AP exam, timed essays that we could prepare for beforehand, and advice on taking the exam. Anyways, he's a chill guy and the class itself's a little boring, but he was helpful in preparing us for the AP exam.","rating":5,"version":0},{"timestamp":"2020-05-02T04:42:08.009Z","text":"Bad teacher. He hates a lot of people and only likes a few. If he likes you, you'll do well if he doesn't you screwed. A lot of pop quizzes and he grades super hard on essays. Don't take him for AP english if you want an A for college. Made a huge mistake by taking him :(","rating":1,"version":0},{"timestamp":"2020-05-02T00:06:52.937Z","text":"OK Ap english teacher, rather have took Bajet but had many pop quizzes very few essays but graded hard on the essays. Easy B hard A good luck!","rating":2,"version":0},{"timestamp":"2020-05-01T23:54:36.893Z","text":"Had him this semester, didnt teach well and gave few essays which he graded hardly on. A lot of pop quizzes. ","rating":1,"version":0},{"timestamp":"2019-11-14T03:25:58.546Z","text":"Have him for Shakespeare. As someone said before, he's not the fastest grader. 90% of the days in class we read the book. The other 10% is watching a movie related to said book (which I think are actually pretty interesting). You also need to recite a sonnet twice in the course of the semester. For essay's, you have a choice on which book you want to write on (for me it was Midsummer or Hamlet). We're also going to have an in-class essay on King Lear (not so excited for that). But he's super chill, really easy to talk to and also very nice to everyone. He also has a good sense of humor! Also the class is a little slow but that's to be expected. \nOverall an easy A with almost no homework, and I definitely recommend him if you want a chill teacher.","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Treats everyone with respect when they deserve it. Heavy on class discussion. Flips coin for pop quizzes so keep up on the reading. \"Geek out\" sessions are insightful. He shares his own research occasionally but doesn't cling to his own interpretation (not like most of my previous teachers). Ta","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Ritter's stories are sometimes too good to be true (but he always claims they're real). I wish I took him earlier. Makes you read lots of material and he expects \"proper\" essays, so don't ever turn in a first draft unless you're as smart as your parents tell you that you are.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's the coolest English teacher at Lowell. It's hard to get an A but he's super interesting and tells great stories. He really challenges you to think and to participate. His voice is sooo soothing and you really learn a lot. His hair is nice too.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher! I actually enjoy his class. He is interesting and offers good feedback on essays. Very chill class. Story time on Monday is exciting. Flips coins for pop quizzes.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's hella interesing. no hw at all but reading if you're taking him for lit n psych. monday is always story time. ritter is a kool kid.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Ritter seven years ago and like many I questioned his stories. Now I live in Italy and I just met one of his old roommates. He confirmed the ghost stories! He's that teacher you still talk about when you're reminiscing. Take him.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for journ2/adv, so I don't know what to put for easiness. He's always been available when I need help and he's always willing to just chat when we have nothing else to do. He's laid back, but he has expectations for his students and you just don't want to disappoint him.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good teacher. only pop quizes i actually liked. very fair and A FREAKING GENIUS. so much to absorb from him about ANY BOOK.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is SO cool. one of my favorites at lowell. its worth it to take him just for storytime. just make sure you tell one - it the easiest points to get.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Ritter for 9th H and I loved him! He is the best english teacher I've ever had. He makes class interesting and fun. We read lots of interesting books and he really helped me to improve my essay-writing.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"This guy is one of the best English teachers I've ever had (Ms. Canepa is another). Even if you're not in hia class anymore, he's still willing to look over your essay.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Just finished summer session at NYU. Ritter's 1984 lectures gave me a leg up on all my classmates. Even the prof. hadn't considered the \"rosebud\" allusion. Thanks dude! Fun and challenging. Loved the readings.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Flips A Coin for Pop Quizes. Story time is always fun. He's a hard grader for essays though..","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i LOVE mr. ritter.. you should definitely take him for lit&psych.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Ritter! Come back! I know you're on sabbatical but many of us really miss you. Tell us a story. Are you going to graduation?Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he talks in a very strange way kinda like a psychologist.. sometimes that kind of voice put me to sleep but overall he is a good teacher.. an easy B i guess","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take him only if you love to participate. You can ace everything and the highest grade you can get is a 85% B if you never participate. HW daily. You do a lot of work but it's not really challenging. He has a monotome voice. Interesting pretty good class. Somewhat conceited. He made me hate English class at Lowell because it's nearly impossible to get an A and I got straight C's even though I tried harder than some of my lazy classmates. Not fair.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His grading was very slow, but he was interesting in the class discussions. Participation is a must. Doesn't teach anything about themes, something that some of the other 9th grade English teachers focus pretty heavily on. Make sure you know how to write for his essays. They is hard.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best teacher u can get all u gotta do is read and pay attendtion along with hw its an A","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's such a great guy and seems really passionate about what he teaches. he always puts everyone at ease.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Do not be fooled by his soft-spoken exterior. Sure, he'll be easy for a while, happy happy storytimes,...then you get ridiculous amounts of latin roots to memorize, and I kid you not, a ten page debate paper! To top it off, we have to debate with partners in front of everyone in class w/ him videotaping us! unfair.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Love this teacher. Definitely take him if you get the chance. Story time on Mondays is awesome and sometimes it takes up the entire class period. I would take his class again if I could,","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"yah hes a realy relaxed teacher and hes got all these stories lyk about motorcyles. his voice is always calm and if u put an effort youll get a good grade","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Okay teacher, you will get a good grade if you participate. Storytimes are essential to your grade (unless you A the other stuff). He's pretty cool but i get the feeling that he thinks he is a genius (although he is smart.. still -_______-) I feel he really wants to be a \"cool\" teacher to everyone. that doesn't appeal to ME.. just my two cents","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's cool and his stories are awesome (although of questionable legitimacy). However, he is a tough essay grader. Don't procrastinate! (Hard for us to do, I know) Make sure to read for his pop quizzes.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A very very cool person. definitely worth taking his class, if only to experience the chillness of Ritter.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love mr. ritter. he is such an awesome guy. i wish i could have taken one of his classes, alas i got shafted by the system so i couldn't. viva ritter!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best teacher ever. party every day. TAKE HIM. really interesting guy and his class was really fun. he loves his students and his students love him. his bingo is so fun!!!!!! go mr ritter!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had Ritter for AP Eng 72/74 and it was one of the best classes I've taken so far. He's a really interesting person, lots of great stories during story time. In terms of teaching, we never used any textbooks and we read a variety of literature. Your grade is based off of mostly writing assignments so take them seriously. (It shouldn't be too difficult, most of it is creative writing.)","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"It'll take a little time to get used to his soothing voice (he doesn't like to \"yell\" at his students), but his class is awesome. Don't expect to learn much about writing if you take him for Expo. He grades with a metallic gold pen and leaves good comments. Storytime every Monday! Ritter has an amazing personality and has lots of interesting stories to share. His never-waning patience always surprises me. No matter how idiotic some students' comments are, he treats everybody with respect. =)","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Locks you out if you are 1 SECOND LATE! BEWARE!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"omg his class was so easy, i got an A but didn't learn anything!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"one of the few teachers who noticed me, one of the few classes i would always attend","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Ritter is subtly conceited. You may think he is quite \"cool\" at first, but you will probably soon discover that he makes some stuff up in his stories, and pretends to know everything about psychology! Psychology is a very intricate and complex subject and cannot just be explained with small book summarizing Freud. He gets on students' nerves sometimes with his know-it-all condescending attitude, but overall, his class is pretty fun, and heck of a lot more interesting than the rest of LowelL.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Ritter is the coolest person ever. He can do like everything in this world. He is super smart. Just participate and tell stories if you want an A. I got an A and I usually don't get A's in english.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Recall diagrams are the fairest pop quizzes I have ever experienced.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HILARIOUS! :D","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My fondest memories of Lowell usually lead back to Mr. Ritter's classes. Story time was great, and the reading selections were usually awesome. He always spoke in this somewhat monotonous voice, but just the way he presents the material in a way that engages you makes you forget his voice is trying to put you to sleep. I'm not sure if his class helped my English skills that much more by the time I took him(senior year), but his class sure was the most fun and engaging. Very highly recommended!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I like how his syllabus is clear. The recall quizes are the first ones that I know I can do well on if I read. Nice goatee too.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He might not be the fastest grader, but when he returns things, boy do they have a lot of useful commentary! He's also really laid-back and easy to talk to, with a great sense of humor. You won't get bored.","rating":4.6,"version":1}],"rating":4.224489795918364}},"__N_SSG":true}