{"pageProps":{"teacher":{"name":"Bryan Cooley","departments":["Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Physics 1","block":"3","semester":"Fall2014"},{"name":"AP Physics 1","block":"7","semester":"Fall2014"},{"name":"AP Physics 2","block":"4","semester":"Fall2014"},{"name":"Robotics 1","block":"8","semester":"Fall2014"},{"name":"ICT-Robotics 2","block":"8","semester":"Spring2015"},{"name":"AP Physics 1","block":"3","semester":"Spring2015"},{"name":"AP Physics 1","block":"7","semester":"Spring2015"},{"name":"AP Physics 2","block":"4","semester":"Spring2015"},{"name":"Physics","block":"2","semester":"Fall2015"},{"name":"AP Physics 2","block":"4","semester":"Fall2015"},{"name":"AP Physics 2","block":"5","semester":"Fall2015"},{"name":"ICT-Robotics 2","block":"9","semester":"Fall2015"},{"name":"Physics","block":"2","semester":"Spring2016"},{"name":"AP Physics 2","block":"4","semester":"Spring2016"},{"name":"AP Physics 2","block":"5","semester":"Spring2016"},{"name":"ICT-Robotics 2","block":"9","semester":"Spring2016"},{"name":"Physics","block":"2","semester":"Fall2016"},{"name":"Physics","block":"6","semester":"Fall2016"},{"name":"Physics","block":"8","semester":"Fall2016"},{"name":"AP Physics 2","block":"4","semester":"Fall2016"},{"name":"Physics","block":"2","semester":"Spring2017"},{"name":"Physics","block":"3","semester":"Spring2017"},{"name":"Physics","block":"7","semester":"Spring2017"},{"name":"AP Physics 2","block":"4","semester":"Spring2017"},{"name":"Physics","block":"5","semester":"Fall2017"},{"name":"Physics","block":"6","semester":"Fall2017"},{"name":"Physics","block":"8","semester":"Fall2017"},{"name":"AP Physics 2","block":"3","semester":"Fall2017"},{"name":"Physics","block":"2","semester":"Spring2018"},{"name":"Physics","block":"5","semester":"Spring2018"},{"name":"Physics","block":"7","semester":"Spring2018"},{"name":"AP Physics 2","block":"3","semester":"Spring2018"},{"name":"Physics","block":"2","semester":"Fall2018"},{"name":"Physics","block":"4","semester":"Fall2018"},{"name":"AP Physics 2","block":"5","semester":"Fall2018"},{"name":"AP Physics 2","block":"7","semester":"Fall2018"},{"name":"Physics","block":"2","semester":"Spring2019"},{"name":"Physics","block":"6","semester":"Spring2019"},{"name":"AP Physics 2","block":"5","semester":"Spring2019"},{"name":"AP Physics 2","block":"7","semester":"Spring2019"},{"name":"AP Physics 2","block":"5","semester":"Fall2019"},{"name":"AP Physics 2","block":"7","semester":"Fall2019"},{"name":"Physics","block":"1","semester":"Fall2019"},{"name":"Physics","block":"4","semester":"Fall2019"},{"name":"Physics","block":"2","semester":"Spring2020"},{"name":"Physics","block":"4","semester":"Spring2020"},{"name":"AP Physics 2","block":"5","semester":"Spring2020"},{"name":"AP Physics 2","block":"7","semester":"Spring2020"},{"name":"AP Physics 2","block":"6","semester":"Fall2020"},{"name":"AP Physics 2","block":"7","semester":"Fall2020"},{"name":"Physics","block":"2","semester":"Fall2020"},{"name":"Physics","block":"3","semester":"Fall2020"},{"name":"AP Physics 2","block":"6","semester":"Spring2021"},{"name":"AP Physics 2","block":"7","semester":"Spring2021"},{"name":"Physics","block":"2","semester":"Spring2021"},{"name":"Physics","block":"3","semester":"Spring2021"}],"reviews":[{"timestamp":"2019-12-08T17:57:28.236Z","text":"On the first day of school we had a class discussion on how grading should work. He's obviously aware of problems in the education system","rating":5,"version":0},{"timestamp":"2019-12-03T21:16:17.715Z","text":"Very good teacha. You will learn stuff.","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"WOW this guy is awesome, Extra cerdit outlines, extra credit class games, retakes on tests, with this guy for physics, its like your own lil birthday every single day. Labs with your buddies and pretty easy A. Hes also bald and i duno why but thats awesome!!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's not that great of a teacher because he makes you write your own textbook and you're basically all on your own. Mean when it comes to asking questions. I don't feel like I'm learning anything in his class!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BY FAR MOST AMAZING TEACHER EVER! SUPER FUNNY JOKES. CLASS IS AN EASY A !hes usper helpful and when something is not clear he makes it clear for you and you would understand. he allows you to retake your tests if you fail. he makes the class really easy and fun.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"don't take him. he doesn't explain problems at all.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cooley is better than Dickerman for AP Physics B. He's also a great person! Like every class though, it gets boring but the parts you're awake for are worth it! Do not take it if you don't have a friend in the class.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He isn't a great teacher but not bad by any means. He gives plenty of labs/ experiments from which you actually do learn, explains concepts okay, and tests are pretty easy. He is a good guy - just be quite in class and give him some respect.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fun labs and assignments! I had a great time in his class. The only things is that there is only one test per quarter (but there are makeups!). :) Just pay attention or you won't get things at all.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr.cooley is really funny and very nice in general, he's one of those teachers you can make jokes with. his lectures do get confusing and his tests are pretty hard but the makeups are really easy. the fact that there even is makeups is awesome. he basically just changes numbers and a few words. labs are difficult, for those like me who suck at physics its great to have a group who does everything. the thing about mr.cooley is that you can not know the subject at all but can still pull of a B.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes hella tyte. actually, all the physics teachers are. the physics and social studies departments are probably the tightest depts at lowell. anyways, so mr cooley gives a lot of labs, which count for a lot, a lot of extra credit if u want to boost up ur grade, and tests every chapter or so. PAY ATTENTION if u want to do well!!! as in any other class.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THE NAME SAYS IT ALL. he is fun, understanding, and lenient for reg. physics. teaches well, always helpful. minimal homework and tons of opportunities for extra credit and even make-up tests. Solid effort will earn an A. And be sure to have fun with the labs and his jokes/sarcastic comments!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best physics teacher at Lowell. He can both teach, and make the class entertaining.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's an awesome teacher! he's really helpful and explains things really well. i had him for both semesters of physics last year, but he was definitely easier the first semester. he doesn't assign too much homework, and most of the work is either classwork or group projects. easy A, but you need to put some effort into it.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I would say that he is one of the more easier physics teachers at the school; test aren't worth that much in his class, and there are many ways to score extra credit.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love his class..hes really silly, and never makes class boaring...if u take notes..you'll ace the test, no doubt, u barely even get any hw...and did i mention he gives way too much extra credit...? you'll enjoy his class..take him if u can","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You get to pick your own grade, which is a great thing (you have to fulfill some requirements though, which is fine). Would recommend to people who are passionate about physics, probably. Makes uncomfortable jokes but does his job as a physics teacher.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I didn't enjoy his class, i felt it was boring and sortta difficult. easy b. very hard a ( and im smart bruh)","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very funny and chill teacher. rarely gives out homework. tests are kind of hard but he has retakesSubmitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Cooley is a really knowledgeable, funny, and caring guy once you get past his provocative humor. He may seem too much at first with his swearing, but you'll soon find it extremely entertaining and adds on well to his lectures which are not only cool but teach you a lot. He's also quite easy if you just do your work. Most people ended up with As and learned a lot. He also gives so much time up for robotics, even though I'm not on that, I really admire all that he does. Take him for physics H!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"haha fun classes. test are easy as long as you pay attention everytime he introduces a new equation. just learn how to use them and you'll do fine on the tests. and if you dont, theres always a retake thats in the same format. if you have a question, he wud help you.hw is pretty easy also. and personality, awesome! like his name says it, he's \"COOL\"ey.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good teacher","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP Physics B = big no-no. if you don't know a bit of physics, you'll struggle through this class, esp. because his teaching rather, er.. not exceptional, let's put it that way.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cooley is amazing. an EASY A.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Cooley is really awesome! His class demos are always really fun and you actually learn things while having fun! He doesn't give too much homework and he gives a reasonable amount of time for it. His tests aren't too bad and you're almost always offered retakes on them.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a good physics teacher and makes class fun. You might fall asleep because it's physics afterall, but his class is fun. Extra credit basically IS the curve, so do it. Keep the tests, as they will help. On the finals, YOU ARE NEVER TAKING A **** RELATIONSHIP EXAM! Remember that.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Just like his name indicates, Mr.cooley is pretty cool. He is not the hardest grader and makes the class super entertaining. I must say that he is quite a character and I appreciate his efforts teaching the class about the evil named physics.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is AMAZING!!!!!! Take him!!! You have fun and learn a lot in his class :)","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"im sorry to say that even though mr cooley is a really awesome guy, he obviously isn't being very assertive in his classes = total disrespect from the students; it also makes the students unwilling to learn...i myself had prothro in my first semester, where i did learn lots...but second semester i took cooley and well...i felt really lazy in the class...getting an A was too easy...","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Is a very good teacher, you will learn a lot. Had him for normal Physics and he is one of the nicest and funniest teachers. Is really smart and can explain anything to you if you didn't understand it from his initial lesson. Helped me gain a really good conceptual understanding.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Cooley is really willing to help you. If you don't understand something in his class, you can always go to him afterschool and talk to him about it. His tests are hard to me, but they don't count that much. EXTRA CREDIT!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Didn't know /anything/ about physics...and I still got a B+/A.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a good teacher, relatively speaking probably the best physics teacher at Lowell. Very knowledgeable and will explain anything to you if you ask. Had him for physics 1 and as of S'18 he's still letting us choose our grades. Even if you don't get to choose your own grade when you take him, he's a very reasonable grader, (gives lots of curves and gives points for writing your name). He isn't very politically correct when it comes to comedy, but is extremely funny.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes so cool. you learn, but hes fairly easy. tests dont count for much, adn theres ALWAYS EXTRA CREDIT. yay. haha.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had no trouble in Cooley's class, but it helped that I had taken a basic physics class several years before.What I saw from the people I took him with was completely different. He used confusing language and tended to overcomplicate problems, eventually droning on about something unnecessary to whatever the discussion was. If you could follow it(Read: If you are a math person) it was fine, but I had to explain it to most of my buddies after he finished.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"dude isnt that bad...you dont get too much hw, and tests arent that hard, i did pretty much nothing at got a B","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's really clear if you pay attention. However, if you don't, the material can become really confusing. He's also very helpful if u ask for help, and has a very comical personality. He's very relaxed and allows eating, listening to music, etc. If you take him, be sure to PAY ATTENTION!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. cooley is a decent teacher. he is very moody and it is hard to understand what he is talking about most of the time. his tests arent too bad but his finals is tricky,however, he does add 20 free points on to it so its all good.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a funny guy and he's nice too. his tests arent that hard.. just study! and he's pretty good about extra credit, and he'll definitely try to get people to succeed in his class.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love mr cooley. he is the sweetest guy in the world and his class was a joy. it was a pretty easy A, he offers tons of extra credit and grades homework and labs very generously. hes very funny too, but not in an outward way.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"There are retake opportunities for every test (besides the final), even if it was a group test. He doesn't give too many sample problems, so you sometimes have to figure things out by yourself, wondering if he ever taught the material. Overall a humorous and helpful teacher.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He gives lots of labs, and those mostly count for your homework grade. He only checks if you finished worksheets, unless they're late. His tests have the equations on them, and have retakes too. An A in his class shouldn't be too hard unless you do nothing. But he is an kind and interesting guy. Some people in my class made shirts with his picture on them, and that should tell you something.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best Teacher at Lowell Period","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class is an easy A. Study for the final because his grades are cumulative. there is a lot of easy work that it makes up for tests. so test dont count as much. there is lets u make up the test but under conditions (i.e retake similar test but w/o partial credit). there is also extra credit. he's nice and is very helpful if u don't understand","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AHHH the name says it all. his class is so fun and i feel like i learned a lot. cooley is the best physics teacher. i had prothro before and i didnt feel like doing anything in his class. no offense. but cooley has lots of hands on learning in his labs which is way better than tons lectures. he acts silly and makes us laugh so we wont fall asleep. easy B and harder A but not THAT hard. overall really cool teacher. i never regret picking him.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr, Cooley is absolutely awesome for AP Physics B. He makes Physics incredibly fun, and teaches you how to derive everything in physics from simple equations rather than have you memorize the extremely long equations for specific instances. His class was amazingly fun, and he's such a goofball!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Cooley is one of the coolest guys at Lowell! He is very nice and helpful if you just ask. In regular physics, his lectures are interesting and there is practically no homework. If you want the grade, he is a pretty easy A if you just do the work. He is a giant physi dork and really really nice!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Looking over this semester, I would have to say Mr. Cooley was not that great of a teacher. He failed us in the first trimester by attempting to teach us by us teaching ourselves. Then when he left for jury duty, we were by left to fend for ourselves. That didn't work out either. When he did come back, he didn't really explain how physics work, just how to derive equations and how to plug in the numbers. I do not recommend taking him at all.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Cooley is extremely good, you learn from your mistakes and there is a ton of extra credit. He gives like 20-30 extra credits per semester. You learn a lot. EASY A. Take him, he is also funny. So if you want to have fun take a cool teacher like cooley.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"doesn't seem to care much about his students...","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"puts the cool in cooleyyou've been jabbed by an awful pun!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class is sometimes boring, but I still like it. His demos are pretty interesting and he swears. o.O Also has some pretty interesting stories to tell.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i've had him for regular physics, and i probably sleep or cut about half the classes. that being said, i pay attention during the other half of the time, and have found the class to be entertaining and easy. interested in an easy A? take cooley.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take him for Physics H and you won't regret it. Easiest class you will ever take, I got a 96 without studying for any tests, plus he's hilarious. One of the funniest teachers I've had.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"haha that was me! for my friends birthday. we thought itd be funny. its just that mr.cooleys a really nice guy, we always joke around with him, but as a teacher...i dunno, i hate physics. i dont get it and i do the work but still am not getting an A. but thats just the subject, overall not a bad class.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's cool !!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"By far the best physics teacher at Lowell.","rating":4.3,"version":1}],"rating":4.324561403508777}},"__N_SSG":true}