{"pageProps":{"teacher":{"name":"Cambria Gersten","departments":["Physical Education"],"semesters":["Spring2015","Fall2015","Spring2016","Fall2016","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020"],"classes":[{"name":"PE 1","block":"5","semester":"Spring2015"},{"name":"PE 1","block":"6","semester":"Spring2015"},{"name":"PE 1","block":"8","semester":"Spring2015"},{"name":"PE 1","block":"5","semester":"Fall2015"},{"name":"PE 1","block":"6","semester":"Fall2015"},{"name":"PE 1","block":"8","semester":"Fall2015"},{"name":"PE 1","block":"5","semester":"Spring2016"},{"name":"PE 1","block":"7","semester":"Spring2016"},{"name":"PE 1","block":"8","semester":"Spring2016"},{"name":"PE 1","block":"5","semester":"Fall2016"},{"name":"PE 1","block":"6","semester":"Fall2016"},{"name":"PE 1","block":"8","semester":"Fall2016"},{"name":"PE 1","block":"5","semester":"Fall2017"},{"name":"PE 1","block":"7","semester":"Fall2017"},{"name":"PE 1","block":"8","semester":"Fall2017"},{"name":"PE 1","block":"5","semester":"Spring2018"},{"name":"PE 1","block":"7","semester":"Spring2018"},{"name":"PE 1","block":"8","semester":"Spring2018"},{"name":"PE 1","block":"5","semester":"Fall2018"},{"name":"PE 1","block":"7","semester":"Fall2018"},{"name":"PE 1","block":"8","semester":"Fall2018"},{"name":"PE 1","block":"5","semester":"Spring2019"},{"name":"PE 1","block":"7","semester":"Spring2019"},{"name":"PE 1","block":"8","semester":"Spring2019"},{"name":"PE 1","block":"5","semester":"Fall2019"},{"name":"PE 1","block":"7","semester":"Fall2019"},{"name":"PE 1","block":"8","semester":"Fall2019"},{"name":"PE 1","block":"5","semester":"Spring2020"},{"name":"PE 1","block":"7","semester":"Spring2020"},{"name":"PE 1","block":"8","semester":"Spring2020"}],"reviews":[{"timestamp":"2020-05-07T00:51:30.818Z","text":"Ms. Gersten is incredibly nice and she cares a lot about her students. She pushes you but doesn’t make you suffer while exercising. So so caring, I highly recommend!","rating":5,"version":0},{"timestamp":"2020-05-06T16:53:37.177Z","text":"Had her 2018-2019. No written work whatsoever and is really nice. She genuinely cares about her students and she's chill as long as you show that you're trying. ","rating":5,"version":0},{"timestamp":"2020-05-06T00:09:18.121Z","text":"Probably the chillest, nicest P.E. teachers at Lowell. Cares about her students and isn't at all hard.","rating":5,"version":0},{"timestamp":"2020-05-04T20:57:32.829Z","text":"HELLLA chill she only gave 2 test and class is really fun doesn’t make do that much work  ","rating":5,"version":0},{"timestamp":"2020-05-02T19:17:24.951Z","text":"Ms. Gersten is SO sweet and she pushes you to exercise at your own pace. She’s so enthusiastic and i always looked forward to her classes. Def would recommend her! ","rating":5,"version":0},{"timestamp":"2020-05-02T05:09:02.436Z","text":"gersten is fucking amazing and the best pe teacher you will ever get in your goddamn life. shes considerate of the level ur at and doesnt push too hard, but you actually have physical activity in her class; theres not much textbook work and i loved the time we did foam rolling and meditation lol. really really really flippin nice and fun teacher to talk to. shes a really fit person herself who runs a shitload (i would die) and shes amazing. ur lucky if u have her.","rating":5,"version":0},{"timestamp":"2020-04-07T22:09:53.204Z","text":"I love her PE class! She's very funny and encouraging towards all students. She's also very understanding if you're not super athletic and personally tries to help you improve. ","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good teacher, gives alot of analogies with today's world. She also gives you all the notes from her laptop after she puts them up on the T.V. Homework isnt too difficult, just mainly reading about 3 pages each time in your S.S. book. She also makes games sometimes that relate to the subject so it gets kinda interesting. When she talks she can get your attention and keep it.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You go Ms.Gersten you do you.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best teacher ever. Love p.e. thanks to her.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"wow! ms. bower is one of my favorite teachers this year. she is interactive, fun and ive learned a lot.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool teacher her class is sooo much fun, doesn't give a lot of hw but you should always do it because she gives reading quizzes the next day. the games we play in class are so much fun!! She's also very funny ans always has interesting stories to tell.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Never really liked PE so I don't have much say in this, but she's a pretty nice teacher. Makes you run basically every day. She is clearly a sports fanatic, but is really upbeat and energetic. She will call you out if you're not doing anything and if she thinks you're not making an effort.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"u cant skip her class much, but you don't have to be good at sports to get an a. she just wants effort.you run alot though :/","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"So kind and amazing! Really energetic and unpbeat. Cares about everyone and wants them to do their best! Super kind and totally cool!!!!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"for those of you who have her right now, you're really lucky! i had her last semester for modern world, she's a great teacher. you'll learn a lot in her class. she's very understanding, if you fail a test, she'll let you retake it. she's really nice and funny. feel free to talk to her. and always do the reading because she might give you a reading quiz the next day. and always study for her tests.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a really fun teacher. She doesn't give too much homework and her classes are fun. She has all these creative ways to make things fun, and her class isn't horribly hard either. Try to take her if you can.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST TEACHER EVER!!!! I had her mods 1& 2 her class was a great start for my day, she always had funny stories to tell about herself it was a sad day for me and I think everyone who had her, when she told us that she wasn't gonna teach M.W. anymore. One of the best things about her class is that she gives you the notes and explains them. Great teacher! We're gonna miss you miss Bower!!=(","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Bower is such a bubbly and helpful person. She is always willing to answer questions and offer additional help. I had her for psychology last year, which I think was her first year teaching that subject. She always seemed a little nervous giving her powerpoint presenation, so they were not as effective as they could have been. Other than that, she's a really great teacher!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"No one is as enthusiastic at 7:30 in the morning as she is. Always fun, happy, and excited about the class. Def prepared us well for the AP exam and the class wasn't that bad either. Tests were a pain, but if ya study you'll do fine.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a great teacher! She also gives extra credit to students who really need it. Very helpful!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love her!!!!!!!!!!!!!!!! She makes P.E. sooo fun and she's in shape and can actually move around, unlike some other P.E. teachers...Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A wonderful teacher for modern world. Ms.Bower relates to the students and has a energetic personality. She does activities in class and is willing to help anyone who comes to her. Though she does get a bit side tracked in class. Light on homework unless your class is behind and she gives cramming study homework. She gives a study sheet of everything that is on her test but sometimes theres more to the test than she puts on the study sheet. But if you get a C or below you can retake it.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a really easy freshman PE teacher. Sorta strict about uniforms though. I wish we did more fun or challenging things.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best freshmen PE teacher you can ever ask for. She is very funny, nice, and chill. I am not an athletic person but she always encourages me and other not-so-fit students. She will always be there for you when you need her help. Her classes are also super fun.If you always show up and participate, you're pretty much guaranteed an A. Too bad she doesn't teach PE 3. OVERALL : AMAZING TEACHER","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Gersten is so awesome. Her class is so much fun.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have Ms. Gersten for P.E and she is awesome. She actually works her students hard so that they can be physically fit. You'll get an A for sure if you at least show her you try. If your lazy and enjoys doing nothing in gym class, dont take her. Shes also extremely nice and fun to talk to.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's a really cool teacher. i have her for gym and i think it's her first time teaching it, but she's doing a really good job so far. she has really fun activities on cardio fridays and will help you if you think you need more help. very encouraging and enthusiastic.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a great modern world teacher, I've learned so much in her class. just do the HW and study and youll get an A","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's a great teacher. she teaches with lectures from powerpoints, and her tests are okay.. if you study for them. she's also very helpful, nice, and can be funny.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You must work hard to get an A in her class (study, review notes, etc.) but she's such a sweet and wonderful teacher! I literlly did not study for the AP exam (did not even read a word), and I got a 5! Amazing teacher!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Bower is an awesome teacher! Her tests are extremely hard, but she is very funny and interesting.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For psychology: She is very nice and funny, but she does not TEACH! 85% of the material we covered was from the book and she always \"doesn't have time to do that.\" She is very lenient with tests though, like you can take them over if you get lower than a C, but she DOESN'T prepare you for her tests!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is an awesome teacher!!! i hope she will continue teaching p.e.!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"wow! boy do you learn a lot in her class! i mean, if you compare her notes to the book's info, she tells you so much more! sadly, shes not teaching mw next semester. shes gonna teach ap psych. anyways, great teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have her for AP Psych. I think that she is the most lenient out of all the psych teachers, but you have to spend a bit of time studying for the tests, but thats because they are AP tests. She also curves her tests.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the bomb. super nice and helpful. Her lectures are fun and she is easy to understand","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a really nice P.E. teacher and her classes are usually interesting, although that can vary according to personal preference when it comes to units and P.E. in general. She's enthusiastic and fair. Although the work is moderate, if you hate doing anything in P.E. then you probably shouldn't take her.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have her for AP Psych and I love miss Bower!!! Greatest teacher ever!! She really made me love psychology!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's the best teacher ever! She's very good at explaining, tells amazingly fun [and related to lecture] stories. Ver easy class. I read AND outlined every chapter one block before the class and still aced almost all the tests. You don't have to study AT all for AP's and still easy 5. You won't regr","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"All I can say is she made PE the only class I look forward to during the day. I don't regret taking her for both semesters. She's so upbeat, caring, and sees potential in everyone. Wish I could've taken her for the two years of PE. LOVE HER SM. I TOTALLY RECOMMEND HER!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is full of energy and we did so many cool thing. Take herSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"psych. amazin. fun. yes. like her. no. love her. always. made me wanna major in psych. definitely.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Gersten is really nice, she doesnt teach much but shes really nice and will help you and encourage you to do better. I love Ms.Gersten shes hella cool and supportive","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had her for AP Psych. At the time, she was a new to teaching psych, so that may have been why she wasn't a good teacher for it. But, she didn't really teach much. And when she did, she almost always ran out of time to go over the material. She also tends to go off topic in class--wastes time. Doesn't exactly prepare you for her tests. Your grade is basically made up of the test grades. However, her class is fun and she's a great person!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Gersten is literally the sweetest person ever. She always has a smile on her face and is so happy and energetic that it’s contangious. Her workouts are enjoyable and she often does them with us. She shows how much she cares about her students and is super encouraging. She’s probably the nicest teacher you will ever meet.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"FABULOUS! BEST EVER","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's funny and easy going. Overall easy class. Not much work. Covers everything in class. Not clear on what's going to be on tests, but just study ur notes and you're good.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her last semester for modern world and she was awesome! You learn a lot from her class, and she's really helpful and outgoing. She doesn't put anything you dont know on the tests, and if you get a bad grade she'll help you move it up. Im so sad she's not teaching next semester. She always tries to make history fun. by far one of the best teachers at lowell!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her College and Career class was awsome. We had little to no homework, the sparce few was a small report researching any job we wanted. Her class is really relaxed, and she adds all of these cool videos and stuff (including a movie clip from Election) to her lessons. She's open to new ideas, and probably will eb even better next time she teaches C and C due to her students requests.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Bower is an excellent Psych teacher. She makes psych concepts as clear as possible by using pictures and great video clips to do so in her powerpoints. She has great energy while teaching and she is very understanding and open to talk if any problems in her class or have a big workload.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Honestly, she's the nicest person ever. She is very encouraging, even though I am pretty bad at PE. She has only ever gotten mad at someone when they literally put someone else in mortal danger (We do some dangerous stuff like archery). She's good at what she teaches, and some how knows and is good at every unit. The only fun unit we missed was tumbling, as she has some back problems and can't do tumbling. I really recommend her. She's so kind and supportive.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Bower is very active and a kid at heart. Her tomboy-ness really makes the class fun. She tells us that she has bad handwriting- the reason why we only have slide lectures. She's extremely cool and understand.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's a nice version of taylor ray for P.E you run everyday, or do an intense warm up, then mini exercises and do the sport or game.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for modern world when I was a freshman and she was one of the best teachers I've ever had. She made the subject seem a little less boring! And she's really funny and easy to talk to!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's awesome. she's so enthusiastic about teaching and makes learning fun. doesn't assign enough graded homework so grades are mostly on reading quizes and tests.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took Ms. Bower for AP Psych. She is a pretty easy psych teacher. but doesn't know her material as much as kwong and shimmon and also does not go that much in depth as them. but overall its a nice class. I especially love the video clips she shows us to explain certain psych terms/ concepts","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had Ms. Bower for Ap Psych and is a great teacher.She makes lessons fun and easy to understand.She doesn't give you a load of work and is open to any questions.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Gersten is my reg teacher, excellent teacher, very nice, very helpful.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is a wonderful person! for p.e., if u are good at sports, her class is super fun and easy, but if u are not athletic, DO NOT FEAR! she will encourage her students to do the best they can. shes my favorite teacher ever! shes a people person, and loves to talk to u about mostly anything, and shes usually very knowledgable about all that stuff. many people have nvr heard of her, thats because she was on maternity leave, but u can tell shes an athletic person by how much weight she has lost! :)","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Incredible! She is my favorite teacher by far!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really outgoing teacher. She's pretty easy but she does work students.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"It's so cool to have Ms. Bower as your teacher because she talks like a surfer chick. Since she's young she understands the low interest levels among most students in American Government, so she'll toss in some cartoons, comedy skits, and Daily Show bits that relate to topical issues. As long as you study, you'll be fine.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i have her for P.E. and she is just awesome! coolest teacher ever! i hope she continues to encourage students and places more challenges so we can strive and improve. :)","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Omg! You guys can not stop yourself from loving her class. Her class is fun and great. She is an amazing teacher, she makes running, exercising more fun. She always motivate her students and push them to do their best. Also the units she have are so fun!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Ms Gersten for PE and I loved her class so much. You actually do exercise, but she makes it enjoyable and will do the exercises with you. The units we do are fun. She cares about her students and pushes them to do their best. I came into her class not being able to do a single push up and when the time came for the PFT I was able to do 10. Would highly recommend. As long as you put in effort, you'll be fine.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"extremely nice person! shes always so enthusiatic! her lectures are based off of powerpoints and include lots of videos to make the lectures more fun. tests are sort of hard; need to know the material really well to do good. dont be afraid to talk to her because shes truly an understanding person!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My favorite teacher at Lowell yet. She makes history my favorite subject! Take her class at all cost! HW's easy and she prepares you for tests very well.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great PE teacher! Truly cares about her students- makes it a point to memorize everyone's name within the first week, really helps you push yourself without grading you harshly if you don't meet your goal. Just don't be disrespectful (talk while she's talking, not listen to directions) and you'll be fine","rating":4.7,"version":1}],"rating":4.73043478260869}},"__N_SSG":true}