{"pageProps":{"teacher":{"name":"Carole Cadoppi","departments":["Foreign Language"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Spanish 3","block":"3","semester":"Fall2014"},{"name":"Spanish 3","block":"7","semester":"Fall2014"},{"name":"Spanish Native 2","block":"8","semester":"Fall2014"},{"name":"Spanish Native 3","block":"8","semester":"Fall2014"},{"name":"Spanish 3 Honors","block":"2","semester":"Fall2014"},{"name":"Spanish 3","block":"3","semester":"Spring2015"},{"name":"Spanish 3","block":"7","semester":"Spring2015"},{"name":"Spanish Native 3","block":"8","semester":"Spring2015"},{"name":"Spanish 3 Honors","block":"2","semester":"Spring2015"},{"name":"Spanish 1","block":"8","semester":"Fall2015"},{"name":"AP Spanish Language and Culture","block":"3","semester":"Fall2015"},{"name":"AP Spanish Language and Culture","block":"7","semester":"Fall2015"},{"name":"Spanish 1","block":"8","semester":"Spring2016"},{"name":"Spanish 3 Honors","block":"2","semester":"Spring2016"},{"name":"AP Spanish Language and Culture","block":"3","semester":"Spring2016"},{"name":"AP Spanish Language and Culture","block":"7","semester":"Spring2016"},{"name":"Spanish 2","block":"2","semester":"Fall2016"},{"name":"Spanish Native 3","block":"8","semester":"Fall2016"},{"name":"AP Spanish Language and Culture","block":"3","semester":"Fall2016"},{"name":"AP Spanish Language and Culture","block":"7","semester":"Fall2016"},{"name":"Spanish 3 Honors","block":"2","semester":"Spring2017"},{"name":"Spanish 3 Honors","block":"8","semester":"Spring2017"},{"name":"AP Spanish Language and Culture","block":"3","semester":"Spring2017"},{"name":"AP Spanish Language and Culture","block":"7","semester":"Spring2017"},{"name":"Spanish Native 3","block":"8","semester":"Fall2017"},{"name":"Spanish 3 Honors","block":"2","semester":"Fall2017"},{"name":"AP Spanish Language and Culture","block":"3","semester":"Fall2017"},{"name":"AP Spanish Language and Culture","block":"7","semester":"Fall2017"},{"name":"Spanish 3 Honors","block":"2","semester":"Spring2018"},{"name":"Spanish 3 Honors","block":"8","semester":"Spring2018"},{"name":"AP Spanish Language and Culture","block":"3","semester":"Spring2018"},{"name":"AP Spanish Language and Culture","block":"5","semester":"Spring2018"},{"name":"Italian 1","block":"8","semester":"Fall2018"},{"name":"Spanish 1","block":"3","semester":"Fall2018"},{"name":"Spanish 1","block":"4","semester":"Fall2018"},{"name":"Spanish 1","block":"7","semester":"Fall2018"},{"name":"Spanish Native 3","block":"2","semester":"Fall2018"},{"name":"Spanish 1","block":"3","semester":"Spring2019"},{"name":"Spanish 1","block":"4","semester":"Spring2019"},{"name":"Spanish 1","block":"7","semester":"Spring2019"},{"name":"Spanish 3 Honors","block":"2","semester":"Spring2019"},{"name":"Spanish 3 Honors","block":"8","semester":"Spring2019"},{"name":"Italian 1","block":"8","semester":"Fall2019"},{"name":"Spanish 1","block":"2","semester":"Fall2019"},{"name":"Spanish 1","block":"3","semester":"Fall2019"},{"name":"Spanish 1","block":"5","semester":"Fall2019"},{"name":"Spanish 1","block":"7","semester":"Fall2019"},{"name":"Spanish 1","block":"2","semester":"Spring2020"},{"name":"Spanish 1","block":"3","semester":"Spring2020"},{"name":"Spanish 1","block":"5","semester":"Spring2020"},{"name":"Spanish 1","block":"7","semester":"Spring2020"},{"name":"Italian 1","block":"8","semester":"Spring2020"},{"name":"Spanish 1","block":"3","semester":"Fall2020"},{"name":"Spanish 1","block":"5","semester":"Fall2020"},{"name":"Spanish 1","block":"8","semester":"Fall2020"},{"name":"Spanish 2","block":"2","semester":"Fall2020"},{"name":"Spanish 2","block":"7","semester":"Fall2020"},{"name":"Spanish 1","block":"3","semester":"Spring2021"},{"name":"Spanish 1","block":"5","semester":"Spring2021"},{"name":"Spanish 1","block":"8","semester":"Spring2021"},{"name":"Spanish 2","block":"2","semester":"Spring2021"},{"name":"Spanish 2","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-06T20:12:06.173Z","text":"Honestly not the best option for a language teacher. For Spanish you should take Lombardi instead, and for Italian you should take Pelagatti","rating":2,"version":0},{"timestamp":"2020-05-06T17:30:56.871Z","text":"I’m surprised her ratings are so high, I’ve never spoken to a person who likes her. Her tests are very hard, and I went downhill in that class because she gave my whole group a bad grade when one person didn’t put in any effort. She’s a decent human being, but can be cold if she’s not in a good mood. She offers unlimited extra credit, however I spent hours grading papers in her office and still didn’t get enough to pull an A. ","rating":2,"version":0},{"timestamp":"2020-05-06T00:22:18.638Z","text":"I love señora cadoppi with all my heart. Her class is so fun, she offers unlimited extra credit, and we dance","rating":5,"version":0},{"timestamp":"2020-05-05T22:17:12.171Z","text":"Kindest woman on the planet. You need to take this class.","rating":5,"version":0},{"timestamp":"2020-05-05T22:14:21.074Z","text":"Me gusta bailar en el clase de español^^ oops \nhave a nice day everyone\n \n","rating":5,"version":0},{"timestamp":"2020-05-05T22:13:47.680Z","text":"She is the best, I love her class and she offers unlimited extra credit and WE DANCE ALL THE TIME. QUE BELLA ES LA VIDA!","rating":5,"version":0},{"timestamp":"2020-05-05T22:13:02.335Z","text":"Me bailar en el clase de español. Cadoppi is a pretty good teacher :)\n","rating":5,"version":0},{"timestamp":"2020-05-05T22:12:58.684Z","text":"MS. CADOPPI IS THE BEST TEACHER IN THE WORLD PERIOD. HER CLASS IS SO FUN, WE SPEND 60% OF THE TIME DANCING, AND SHE STILL SOMEHOW MANAGES TO MAKE US EXTREMELY GOOD AT SPANISH. I can't believe that there is such an amazing teacher on this planet, AND SHE SELLS FREAKING MUFFINS IN HER CLASS. Let me repeat that. MUFFINS. IN. HER. CLASS. THAT YOU CAN BUY. You need to take Cadoppi. I have spoken. SENORA CADOPPI ES LA MEJOR MAESTRA DE LA ESCUELA. ","rating":5,"version":0},{"timestamp":"2020-05-05T02:20:41.151Z","text":"TERRIBLE teacher! One of the most disliked teacher at Lowell, I’m surprised she has such  high reviews (probably bc everyone at Lowell is a kissa$$). Had her for spanish 1, and shes completely unreasonable, picks favorites, and tests are very hard. ","rating":1,"version":0},{"timestamp":"2020-05-04T03:21:51.865Z","text":"Terrible teacher. Shes very rude to you unless you suck up to her, and her tests are incredibly hard. Don’t take her unless you’re a suck up","rating":1,"version":0},{"timestamp":"2020-05-02T05:09:40.146Z","text":"She is so much fun and engaging. She offers unlimited extra credit for grading HW, doing PP presentations, memorizing scripts, etc. She is also such a good teacher. I've learned so much in the first year in her class and I wish I could take her next year. She really stresses speaking the language (pronunciation important!!) and doesn't just let you read and translate. She encourages mistakes and is always open at lunch and after school if you need extra help or if you have questions.","rating":5,"version":0},{"timestamp":"2019-09-21T04:42:37.140Z","text":"Very sweet and helpful teacher for spanish 3H! She has unlimited extra credit that made her class a lot less stressful than people make it out to be! She helped me a lot to pass the AP Spanish test even when i was out of her class! I love Ms. Cadoppi!","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Senora Cadoppi is a great teacher, and she does a great job of making learning fun. Her homework is rediculously easy, you just have to put in average effort and make sure you do it ALL. She gives out a lot of projects that only require average effort for a B at least. If you pay attention and take notes, her tests can be a breeze, but I've seen slackers fail miserably. She offers after-class help in her office, and has parties galore. Simple notes are vital in her class though","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i personally really like her. we have fun activities in class to make it more interesting. its torture though when you have three mods. shes a really nice lady and is willing to help at any time. theres a lot of homework though, and shes quite difficult.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Cadoppi is genuinely passionate about Spanish and you will learn so much from her. The exams are difficult, but there are a lot of ways to bring your grade up. The class is not an easy A, but it is worth it when you realize how much your Spanish has improved by the end of the semester. Disappointed that she won't be teaching AP next year.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's an incredible teacher who does everything she can to help students learn the material. She does an excellent job of balancing the workload with quizzes, tests, skits, and dairy entries. She's funny and always there to help. I wish I could've had her for every semester of spanish.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a hard tester. Before every test she has a story to read and asks you questions about it on the test. One time half the test was a one page response. She's a hard grader but she is very good though. My reading comprehension improved and started to remember irregular verbs better. She is hard b","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Nice. Kind of hard but bearable if you really pay attention and study. She does well at making things understandable. Do your homework every night because it does matter. Doesn't favor people which is refreshing for a lowell teacher. Lots of skits but it's not hard and a great way to boost up your grade.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms cadoppi is pretty hard, but her tests are worth the same as her projects ,which are not difficult to get 100% on, so they balance out.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mrs cadoppi teaches and really wants everybody to learn alll the tenses of spanish but her finals is really HARD but i guess all the projects even them out","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I agree with the bad ratings in that she may not be the coolest teacher, but honestly I learned the most from her. And you can tell she really does care and wants you to succeed (unlimited extra credit when I had her). I took her class in 2014. im oldSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's willing to give students 10 points of extra credit for bringing a pound of cheese to Kermes! 5 stars!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Cadoppi is an amazing Spanish teacher. Her tests are really hard and you have to work for an A, but she offers tons of extra credit opportunities. She's very passionate about Spanish and teaches you a lot. After a year of taking her, my Spanish has seriously improved. There are also group project plays at the end of each grading period which are pretty fun. Im super disappointed that she wont be teaching AP next year!! I would 100% recommend for anyone that wants to better their Spanish.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Branzburg is way easier, but Cadoppi teaches so much more extra stuff. She speaks in Italian a lot. Coming from Branzburg, I had a little trouble adjusting, but got solid A's all three trimesters. Nice person, gives extra credit to those in need. Both classes were great fun, but Branzburg fills up in arena earlier for some reason.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"senora cadoppi is an incredible teacher. she comes up with all these fun and creative activities that dont really seem like they help, but when the test comes around, youll be surprised to find out just how much you learned from them. very understanding and helps her students as much as she can. she hates lazy people though, so try to do your best. lots of in-class parties. the projects are sometimes demanding but the end results are HILARIOUS!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Cadoppi is a really nice person. Sometimes a bit dramatic, but it's pretty funny. Tests are hard, so do lots of EC! Presentations are pretty enjoyable, it's just the process that's stressful.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MS.CADOPPI! I had her for Spanish 3 Native and Honors last year and she is so easy! My grammar sucked last year because I never really developed it but now that I am in AP it is so much easier. Her tests are like a fifth of your grade but as long as you study and you understand the vocab and conjugations(they are actually pretty easy) you are good to go! Take her!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her Spanish 5 and Spanish 5H classes are basically the same thing. If you take Spanish 5, and you get her, you might as well just take her honors calls. She makes you write diarios (basically mini compositions) a few times per quarter, but it helps boosts up your grade up. If you manage to get B's on her tests and A's on everything else, you can get a borderline A in her class. She teaches her class all in spanish, so it's a bit confusing at first, but you gradually get use to it.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Senora Cadoppi's activities are very fun. They may seem stupid but they actually help you learn. In Spanish 6H we played a dating game one time during the whole class and it was hilarious.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes very cool. class sucks when its long though. she tries to make it as fun as possible though, and you learn a decent ammount","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. would reccomend. skits and hw is pretty easy. have parties.give extra credit. know the materials because she review over them the next day. need help? just ask. you do work but learn a lot","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cadoppi is hard, and her tests are hard, and her projects are very, very annoying. you can score a B with work, but an A is hard. Maquinana is easier but you'll be sorry next year.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. great class. always there to help.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a great teacher, and speaks in Spanish a lot unless she's explaining an essay you have to write. There are a lot of skits, but they help with your pronunciation and she grades them fairly easily. She assigns a lot of homework that you have to do, but it's a really easy way to boost up your grade. If you study for her tests and do your work, you won't have a problem.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"only take her if you can speak spanish orally, not native. you have to be paying attention all of class and she might ask you some random question (she uses cards) her tests are super long and pretty hard, but she has projects which can boost your grade (B's or below on all my tests, A's on my projects, I have an A) she also has unlimited extra credit. She also has a lot of stuff on the side, like diarios which are pretty easy A's if you get them checked by her or a native spanish speaker.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Senora Cadoppi explains the material very well. The culture is interesting, not the stupid stuff out of the book. Her are hard and most people get around a 75% but she grades projects (1 per grading period) very easily (almost guarenteed A's on them). People complain that they are failing but it is their fault because she gives unlimited extra credit. The people with bad grades are those who are too lazy to do the extra credit.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Sra. Cadoppi's class was the most fun out of all the other Spanish teacher I had while at Lowell. If you are taking her for Spanish 5, just take 5H, the classes are taught exactly the same. She has a huge emphasis on speaking and writing. There are daily writing assignments called \"diarios\" and the exams, while difficult are not impossible. Extra credit is unlimited! I memorized a lot of Spanish songs for extra credit and it was a lot of fun! You get ~15 pts for reciting and 5 for singing.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is nice, she actually teaches unlike brandsburg(darn it)","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's the best! Unlimited extra credit! Games! Projects! Grammar days!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A wonderful teacher. You will certainly learn a LOT from her. Not the easiest but very helpful.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HER CLASS WAS AMAZING. She is the best. She teaches really well and is really helpful. You can go to her office if you need extra help and also offers a lot of extra credit. She's really nice and you learn alot. Definitely take her.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome teacher, makes learning fun and is extremely fair. Pick her!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Obscenely hard. People will average 65 on tests, and she doesnt curve, just hands out a ton of extra credit. Only take if youre willing to pay attention in class, because she doesnt teach out of the book. On the plus side, dont do your homework, and spend that time studying her annoying stories that","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is one of the best teachers at lowell compared to all the others! She actually takes time to help you if you need it! The only bad thing is that she calls at you at random with her cards. But overall she's funny and actually teaches!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had her for spanish 5/6. great teacher. makes learning fun, and tries her best to make a good environment. homework EVERYDAY, which gets a bit annoying, but its easy and you learn. fun projects and skits.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool and caring. always tries to help her students in any way she can. gives homework that you have to do, but it helps to understand the subject a lot better. still remembers me after a year, which shows just how much she respects her students","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms cadoppi is awesome! the only part i dont like about her is that she assigns seats. =(","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very good. I took her this past semester and she explained herself very well and I feel like I got a lot out of the class. Makes learning fun. Wish she taught AP for next year. :( She offers TONS of extra credit. One kid did so much his grade went a whole letter. I recomend her. (:","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Cadoppi is really great. She knows how to make learning languages fun and allways wants to help her students. If you are taking spanish, take her,she will teach you a lot. I went to that class and it was by far my most favorite spanish class ever","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You have to participate in Cadoppi's class. She calls on random people and it's kind of scary so you have to pay attention. But she likes to do fun activities and games with Spanish so you probably won't be bored. She gives homework almost every day, but projects, quizzes, and tests make up most of your grade. My tip is to pay attention and you'll be fine.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"With the classes, she teaches (3H, 3 Native, AP Spanish), the difficulty depends on how much she likes you, and (obviously) how good you are at Spanish. I took her for AP, where every student she has ever had has passed the AP test. It was a difficult class, but you can get rounded up to 3% in each grading period if you do the homework every night. It is critical you pay attention as well because she cold calls most of the time. However, she is a great person and I learned a TON from her class.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i dont care what people say. she is NOT EASIER than ryland or ballbe. however, she is more fun. she tries to incorporate lots of projects and skits to make the learning more interesting. she also puts you in partners so you get to interact a lot. her tests arent meant to be tricky, but for some reason they always are. lots of people fail them. :( if youre consistent in your homework and pay attention well, youll probably end up with a B or higher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. learn a lot, and have fun while doing so. lots of activities, parties, etc.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes a very nice lady, but i rather have balbe or ryland. theres nothing really wrong with her, but she doesnt really prepare you, and you have useless work","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher for spanish. really fun and understanding. always there to help no matter out. her tests are actually really hard, but all the projects boost your grade back up. she wants everyone to learn, but people take advantage of her. shes not afraid to give Ds or Fs though, so you better try.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes really fun and nice. have GREAT ways of teaching. she doesnt only depend on the book.. she does lots of things for us to do to make it fun. i really like her.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes a good teacher. mrs cadoppi is really nice and is always willing to help. she wants you to learn. its good cuz u dont jus have tests you get to do a lot of projects and activities. shes not very hard.get on her good side tho.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's a nice teacher and her class was fun because we did all sorts of activities","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her class is so much fun. For spanish 6, we played a dating game and everyone laughed a lot. She tells you what to study for tests and her homework takes like 20 minutes to do on average. Some tests are so hard though but other work makes up for it.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's very nice, and extra credit helped me a lot.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her last year and she was a really great teacher because she spoke so clearly. She recommended me for honors so her class is definitely not difficult at all.","rating":4.7,"version":1}],"rating":4.529508196721307}},"__N_SSG":true}