{"pageProps":{"teacher":{"name":"Christopher Newhouse","departments":["Science"],"semesters":["Fall2015","Spring2016","Fall2016","Spring2017"],"classes":[{"name":"Physiology","block":"1","semester":"Fall2015"},{"name":"Physiology","block":"2","semester":"Fall2015"},{"name":"Physiology","block":"3","semester":"Fall2015"},{"name":"Physiology","block":"6","semester":"Fall2015"},{"name":"Physiology","block":"7","semester":"Fall2015"},{"name":"Physiology","block":"1","semester":"Spring2016"},{"name":"Physiology","block":"2","semester":"Spring2016"},{"name":"Physiology","block":"3","semester":"Spring2016"},{"name":"Physiology","block":"6","semester":"Spring2016"},{"name":"Physiology","block":"7","semester":"Spring2016"},{"name":"Biology","block":"6","semester":"Fall2016"},{"name":"Biology","block":"7","semester":"Fall2016"},{"name":"Physiology","block":"1","semester":"Fall2016"},{"name":"Physiology","block":"2","semester":"Fall2016"},{"name":"Physiology","block":"3","semester":"Fall2016"},{"name":"Physiology","block":"1","semester":"Spring2017"},{"name":"Physiology","block":"2","semester":"Spring2017"},{"name":"Physiology","block":"3","semester":"Spring2017"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great bio teacher. He let us watch the Simpsons and he has some pretty interesting lectures that won't put you to sleep. My only comment is that he doesn't teach by the book, but WHO CARES? You're one cool guy, Mr. Newhouse!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really cool teacher, and funny too. doesn't give that much homework either.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very cool teacher.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher. Virtually no homework and almost no classwork. Its just notes notes notes. Hes hilarious and u dont use ur book.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have him for mod 1/2/(3) during my fresh year without enough sleep = b average. my friends all like him cause he's funny and teach well? (iono cause i snooze)","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Bio: I find his powerpoints effective but Newhouse doesn't enforce HW. That being said.. his powerpoints cover up 70% of what you need to know (they're that good...) and the rest you learn before the test or when you ask him questions. (he's even better than his powerpoints in person). I asked him questions from time to time and did everything asked. Doing so gets you an absurdly high grade (self-experienced, hoho ^.^) so you dont have to worry about your grade in his class during finals.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"this teacher. definitely one of the best. its a power point every day and maybe a lab every other week. videos every month maybe. only hmk are colorin sheets, that always get full credit. video questions at times. he's funny tho!! like its not borin. def one of the best physio teachers. easy to talk","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Newhouse was definitely one of my favorite teachers! I'm taking him for physio and this is my senior year. Class is basically all notes, sometimes videos and labs. All around fun class but make sure to take good notes and study from them for the test, Also listen in class because sometimes the stuff he says is on the test wherter he tells you to write it down or not. BUUUT amazing teacher!!Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ahhh! he's the coolest eacher! he likes to make jokes and he's sarcastic in a fun way! but his tests are freaking hard","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"if you copy down everything he writes on the board and you STUDY it then you'll do well in his class, NO EXTRA CREDIT WHATSOEVER! and you never use the book","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I'm glad to have met this guy. He's extremely intelligent and is good at sharing his knowledge (as long as you pay attention). He's really funny too. Normally, I dislike PowerPoint lectures, but his slides are awesome. All in all, he's my favorite teacher....ever.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"newhouse is the bomb. his class is light on classwork and homework, so that's good. he only has four tests per semester (and one is a takehome test), but those tests are worth a lot of your grade, so you need to be careful. take notes in class, and show up every day, but he's lenient when it comes to tardies (even those 20 minute ones). His class can be really fun, but it's what you make of it that counts","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's really nice pretty cool , tests are hard, homework can be hard sometimes","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love newhouse! for our physio final.. he let us play jeopardy! and even if you lost, you still got an A.. he also gave us coloring sheets that were worth a test grade that he always gave you a 100 on! =)","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's so great. There's barely any homework, but when there is it really counts so do well on what little assignments he gives. I really wish Escophele would stop getting sick though, as his illnesses take a while to diagnose/confirm. xO Tests also count for a lot; the final is 33% of your semester grade so don't screw up!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is so chill all the time. His class is always really fun. He gives you a charger for your phone when you need it and has a funny and quirky attitude overall. His class is basically all notes and reallly hard tests. But his class always manages to be the class I'm looking forward to everyday. So sad that he's retiring bc he's such a nice teacher!Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have him right now for Physio (F08) & it's one of the most chill classes I have. His lectures are usually accompanied by powerpoints. He doesn't give out homework, coloring sheets only. Vis Quizzes are pretty easy, just memorize everything before the night before. Tests are hard though, so study!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"worst teacher ever! I usually get all A's and B's (2100 SAT score, too, with 720 Biology SAT) and he gave me a \"C\" for not participating in his \"biotech class. My \"smart\" friend failed his \"body class\" (that's what she calls it) with an F","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"newhouse is very nice and helps u when u ask however labs can get really confusing and tests are VERY hard. u gotta study a lot. best part is that he writes notes on the board which makes things easier. if your a big biology person, take him.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he doesn`t teach from the bio book. he teaches his own thing. sometimes, it`s a little hard to understand what his lectures are about.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Newhouse is definitely the chillest teacher ever! His lectures however can get really boring at times.. but you must pay attention cause his tests are based on his lectures. I dont think i learned so much from his class, but it was a very chill class where i can just relax.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"from DNA spooling to \"moo goo gai pan\" recipes, Newhouse knows it all! brilliant man, awesome teacher. his room is dimly lit, so it kinda hurts your eyes, but at the same time it adds to the overall chillness of his class. :)","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"barely any homework. truly funny teacher he made me lol. tests are hard but huge so you would have to get several questions wrong to get a bad grade on it. bio & physiology man.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he has very interesting lectures. his tests are hard but with so little homework they have to be. he is one of the funniest teachers out there.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"absolutely no homework. take notes all day every day occasional video and then a super hard test. study hard and get good grade. he's funny too","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a GooD TEACHER TAKE HIM IF YOU GET THE CHANCE!!!! I crack jokes about him and he doesnt care. all he do is crack k=jokes about me in class haha. Lots og note taking. I GOT A \"B\" and i just passed all the labs and F the test with a high one.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Funny teacher","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Nice teacher, but felt a little uncomfortable around him.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Although Mr. Newhouse does not offer much homework for his freshman biology class, the quizzes ad tests are extremely difficult and usually consists of material not yet explained in class. In addition, he is a very harsh grader and will not offer any extra credits or easy points. There is an average of about six or seven assignments per grading period and nearly three or four of them are quizzes and test.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"lets just say newhouse is my fav. teacher ever! doesnt teach from the book so you have to go to his class everyday and take notes but its interesting so its all good. his tests are soo hard and you have to study for them cuz theres only like 2 of them a semester. and they're not factual Q's, more like critical thinking","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"coolest teacher ever. very little homework, and hard tests.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Newhouse is the chillest teacher to take for Physio. There's barely any homework except for coloring worksheets. Everyday, you either take notes, watch videos, or work on labs. But make sure you pay attention to what's on the notes instead of just blindly copying or else his quizzes/tests will not be as easy as expected.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome teacherSubmitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Newhouse is one of my favorite teachers by far at Lowell. He is the chillest and most laid back teacher I have ever had. He is the most humorous, hilarious, and easiest teacher you can have. If you want something or to go somewhere during class, just ask! He will most likely allow it. His class is easy as long as you copy down what he tells you to and memorize everything. It's such a pity that he's retiring this year. MR. NEWHOUSE YOU WILL BE MISSED! :) ;) (P.S. He is a mystery.)Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's the best teacher ever! He's incredibly knowledgable and fun. His class is always laid back but there are a lot of notes to take! He's fun to talk to too. NEWHOUSE4PRESIDENT!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Newhouse is great! I am one of the fortunate few that had him for biology as a freshmen for both semesters.His class has a college classroom environment because we have intense note-taking every day unless we do labs. We have jeopardy tests sometimes and if you're lucky, a jeopardy final.If you're looking to learn, this may not be the class for you, but if you want an A then this is a great choice.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's SOO inspiring! makes jokes and side remarks that keep you entertained.. but he's not just clowning, he could be a professor. he can seriously write a book entitled \"Knowing Everything About Everything\" .. you learn A LOT AND it's easy too.. and he's very open-minded to practicality","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Newhouse is so relaxed. I have him for 1-2 and I can walk in at 7:45 and still be early. The class usually starts around 7:50. As for the work, there is barely any, except for the end of the quarter tests, which are manageable if you study. Very good class to take overall.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love his grading policy. get 100% on a easy homework assignment but get 60% on a test...you'll still get a B! take notes and ask questions then your good.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr. Newhouse for Physio in senior year. HE IS THE BEST TEACHER EVER. He made my Lowell experience epic. 100% recommended!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best personality ever! i love mr. newhouse. he's a really good teacher, but his class is designed such that you can forget everything after a test (but that's okay!) i actually found his class really exciting, 1/2 in the morning.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best teacher ever!!!! super nice 1 test a grading period. coolest teacher ever. period. no textbook. no homework. repeats this multiple times so very very clear. sadly he wont be teaching bio anymore =( . come baaack mr newhouse come baaaack.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's the funniest teacher ever!!Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome reg teacher!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome, laid back teacher. Good class","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST. TEACHER. EVER. he's ridiculously funny and humorous. he's mysterious. he's so laid back. i'm gonna miss him a lot. it's not that easy of a class but just study and you'll be fine. no homework except current events, studying, not many labs. wonderful teacherrrr. don't ever change, newhouse!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"funny, teaches interesting things, hard tests, little hw","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for Bio in F04/S05. It was tough having a 1/2 Bio class, but he made it easy to stay awake. Jeopardy was always a lot of fun. The tests can be a little tricky, but we always had a couple extra credit problems at the end. I miss being in his class.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"newhouse is a cool teacher. he's jokes sometimes and he's funny. u won't have to do any homework... but... his tests... their HARD.take him, he's cool!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"you cant leave lowell without taking newhouse. there is a facebook group devoted to him, he has an almost cult-like following. it took me a little whilte to warm up to him, but i have decided he is AMAZING. also a really easy A, as long as you show up. and when you dont, he doesnt really care either, you'll still probably get an A. also, he ALWAYS lets us out early, so take him B code.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"barely any homework. and we havent even touched our biology books. great lectures. i love the material he gives us. interesting.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MR. NEWHOUSE IS THE COOLEST PERSON ON EARTH!!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best. Teacher. At. Lowell. Bar. None.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great for physiology. Just copy down what he puts on the screen. ALL the test are from the back of the chapters in the book. Study those, and u'll get an A, Plus very easy labs","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome guy! Great for Physiology, easiest class ever! All tests from end of book chapter, lecture in class optional, attendance is \"mandatory but not necessary\" in class. Easy and cool.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for physio for both semesters and he was hella easy. almost no hw, and there's only simple quizzes and tests. He uses powerpoints to teach and we had a few labs we had to do. He gives us coloring sheets to do and you basically get an automatic 100 on it unless you screw up. Relatively easy A.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Newhouse is probably the chillest teacher ever! He starts class whenever he wants to..maybe 10min later than usual. His class, however, is mostly about lectures.. and maybe a few labs. The lectures can get a bit boring, but he also have videos for us to watch as well. oh yeh there are always vid qu","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Greatest teacher ever. You'll do very well if you pay attention/take notes. What's green and red and moves at 50 miles an hour? Love love love this guy! We get coloring sheets!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Like everyone said, generally, the class it pretty fun, but you'll really need to cram for the tests. He's like your Simpson loving friend.","rating":4.4,"version":1}],"rating":4.400000000000003}},"__N_SSG":true}