{"pageProps":{"teacher":{"name":"Christine Hosoda","departments":["Physical Education"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"PE 1","block":"1","semester":"Fall2014"},{"name":"PE 1","block":"2","semester":"Fall2014"},{"name":"PE 1","block":"4","semester":"Fall2014"},{"name":"PE 1","block":"7","semester":"Fall2014"},{"name":"PE 2","block":"5","semester":"Fall2014"},{"name":"Racket Sports","block":"5","semester":"Fall2014"},{"name":"PE 1","block":"1","semester":"Spring2015"},{"name":"PE 1","block":"2","semester":"Spring2015"},{"name":"PE 1","block":"3","semester":"Spring2015"},{"name":"PE 1","block":"7","semester":"Spring2015"},{"name":"Racket Sports","block":"5","semester":"Spring2015"},{"name":"PE 1","block":"1","semester":"Fall2015"},{"name":"PE 1","block":"2","semester":"Fall2015"},{"name":"PE 1","block":"3","semester":"Fall2015"},{"name":"PE 1","block":"7","semester":"Fall2015"},{"name":"Racket Sports","block":"5","semester":"Fall2015"},{"name":"PE 1","block":"1","semester":"Spring2016"},{"name":"PE 1","block":"2","semester":"Spring2016"},{"name":"PE 1","block":"3","semester":"Spring2016"},{"name":"PE 1","block":"6","semester":"Spring2016"},{"name":"Racket Sports","block":"5","semester":"Spring2016"},{"name":"PE 1","block":"1","semester":"Fall2016"},{"name":"PE 1","block":"2","semester":"Fall2016"},{"name":"PE 1","block":"3","semester":"Fall2016"},{"name":"PE 1","block":"6","semester":"Fall2016"},{"name":"Racket Sports","block":"5","semester":"Fall2016"},{"name":"Racket Sports","block":"5","semester":"Spring2017"},{"name":"PE 1","block":"1","semester":"Fall2017"},{"name":"PE 1","block":"2","semester":"Fall2017"},{"name":"PE 1","block":"3","semester":"Fall2017"},{"name":"PE 1","block":"6","semester":"Fall2017"},{"name":"Racket Sports","block":"5","semester":"Fall2017"},{"name":"PE 1","block":"1","semester":"Spring2018"},{"name":"PE 1","block":"2","semester":"Spring2018"},{"name":"PE 1","block":"3","semester":"Spring2018"},{"name":"PE 1","block":"6","semester":"Spring2018"},{"name":"Racket Sports","block":"5","semester":"Spring2018"},{"name":"PE 1","block":"1","semester":"Fall2018"},{"name":"PE 1","block":"2","semester":"Fall2018"},{"name":"PE 1","block":"3","semester":"Fall2018"},{"name":"PE 1","block":"6","semester":"Fall2018"},{"name":"Racket Sports","block":"5","semester":"Fall2018"},{"name":"PE 1","block":"1","semester":"Spring2019"},{"name":"PE 1","block":"2","semester":"Spring2019"},{"name":"PE 1","block":"3","semester":"Spring2019"},{"name":"PE 1","block":"6","semester":"Spring2019"},{"name":"Racket Sports","block":"5","semester":"Spring2019"},{"name":"PE 1","block":"1","semester":"Fall2019"},{"name":"PE 1","block":"2","semester":"Fall2019"},{"name":"PE 1","block":"3","semester":"Fall2019"},{"name":"PE 1","block":"5","semester":"Fall2019"},{"name":"Racket Sports","block":"6","semester":"Fall2019"},{"name":"PE 1","block":"1","semester":"Spring2020"},{"name":"PE 1","block":"2","semester":"Spring2020"},{"name":"PE 1","block":"3","semester":"Spring2020"},{"name":"PE 1","block":"5","semester":"Spring2020"},{"name":"Racket Sports","block":"6","semester":"Spring2020"},{"name":"Racket Sports","block":"6","semester":"Fall2020"},{"name":"Racket Sports","block":"6","semester":"Fall2020"},{"name":"Racket Sports","block":"6","semester":"Spring2021"},{"name":"Racket Sports","block":"6","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-20T23:11:22.715Z","text":"She's not too bad for a PE teacher. Definitely has favorites. Too much running but not many tests/assignments.","rating":3,"version":0},{"timestamp":"2020-05-07T18:26:37.473Z","text":"She's a nice teacher who you can tell cares about P.E. The grading is mostly based on effort so you have to work really hard.","rating":4,"version":0},{"timestamp":"2020-05-07T00:54:45.109Z","text":"She was really scary and has favorites and makes you run every Monday, but she's nice and tries to be funny.","rating":4,"version":0},{"timestamp":"2020-05-05T22:09:11.593Z","text":"She's very nice, but her class is definitely a lot of work and it is not an easy A.","rating":4,"version":0},{"timestamp":"2020-05-04T18:58:30.204Z","text":"Actually makes you exercise but cares about all of her students. I had fun in her class, even though the units weren't my favorite.","rating":5,"version":0},{"timestamp":"2020-05-02T15:56:15.727Z","text":"Had her for freshman PE. She really cares about how her students are doing even outside of her class, the units were all decently fun, very approachable, very clear instruction and expect to do the normal load of exercise you would in a PE class (graded on effort though).","rating":5,"version":0},{"timestamp":"2020-03-04T17:50:34.332Z","text":"She is pretty challenging. At times I see her favorite the athletes more. She is definitely one of the hardest freshman PE teachers. take lopez if you dont want to do hardcore work lol","rating":3,"version":0},{"timestamp":"2019-09-21T04:44:27.205Z","text":"She sure was a scary teacher to have freshman year, but after getting to know her rules and getting used to the amount of exercise we have to do (she mostly grades on effort) she’s very sweet and cares about PE a lot.","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is really nice and understanding but her tests are hard.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's alright. Has really really annoying quizzes and \"skills\" tests. If you fail those, it'll probably drop your grade to a B or lower. Fail both & you might get a C. Makes you run alot. She's okay overall.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good but TOUGH.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's not even that hard. I am the most nonathletic person in her class and still got an A. All you have to do is try your best. Like when you're running the mile or have Monday Run day, actually go your pace and don't go too fast because you will want to walk if you use up all your energy. Her tests aren't really hard. It's stuff she goes over in class. If I could, I would take her again.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love her as a teacher but she's kinda like a drill sergeant. She really pushed me to improve and i did! <3 B/c of her I passed the PE test. But if you're sick, you still have to do everything.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The class wasnt to bad but you do have to work way harder than you should have to in pe","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Hosoda is the best P.E. teacher especially if you want to become fit. She makes you sweat tons. So I recommend that you bring a towel and water. At first, she really scared me, but then I got to know her. She's really nice. But always be on time.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Definitely the hardest P.E. teacher, so take her if you want to stay fit! I've had her for a year now and will continue taking her for another semester. She's a great motivator and keeps you healthy. The only thing that might harm your grade is the final, which, unlike other teachers, requires making a poster presentation or a tumbling routine. Other than that, I love her! :) Take her for a fun class and to stay fit.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"if you want to slack off, don't take ms. hosoda. She makes you run but is really cool. Grades portfolio and does really annoying quizzes tho.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shes pretty chill. Just work hard in her class. It doesnt mattter if ur not fit at all czu she grades u on how hard u work,","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"terrible. you try to have fun and she'll think you're screwing around.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Hosoda is awesome!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's not the easiest PE teacher, but in my opinion, she's one of the best. You actually exercise. Her class is really fun too. All you have to do for an A is to really participate. And have a tiny bit of athletic ability for those rally tests.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a great teacher. She actually cares for her students. The written tests are a bit tricky, but participation and effort make up most of your grade. Get her if you can! Her class is really chill and she cares if you're really tired or something. She will never work you until you're dead.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best pe teacher I have ever had. Would 10/10 take her again if I could. Monday rundays are a little bit hard. As long as you push yourself she is an easy A. She is very nice and always willing to help. Her final tests are a bit odd, but super easy.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take her if you want a 6 pack.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"keeps me well fit. she's super nice. not a hard grader, but definitely the hardest among the PE teachers. my favorite pe teacher. (:","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms hosoda is the most amazing pe teacher i have ever had. (out of 3, yes, but w/e). step days and weight days were hard, but now we are that much more fit, yay! the routines we did were fun, and involved getting to know your teammates much better. very young, enthusiastic, and great teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"In Ms.Hosoda's class you actually work, and stay fit, but it is an easy A regardless if you are extremely athletic or not. Also she is the nicest pe teacher. She says hi to you in the hallways and is very sweet","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Hosoda may seem mean or intimidating at 1st but once you get to know her she is a really kind person who cares about her students. She may be one of the harder PE teachers, but it's because she wants to push you to be the best person you can be.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"one hard core teacher cant live a easy life in her class but u can learn","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes so hard man she makes u run 2 miles if u mess up a burpie, and if u dont run the 2 miles in time, you have to do 100 burpies! but still i love her and shes the best pe teacher i ever had. the heart rate monitor thing is genius as wellSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A very good teacher who is much more active than other PE teachers, in her class, you will definitely have fun and will most definitely stay fit. Her class is also very knowledgeably and she strives to help every single student succeed.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i've heard people say ms. hosoda was the hardest pe teacher -- and maybe she is -- but if you follow directions and try hard you'll be fine. i wish i took her for racket sports bc she only teaches that and pe 1 i think","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"This class is easy for athletes. For non-athletes (like me), if you try really hard and ask for help then you'll do well in this class. Tests are unit-related (ie running) or simple written tests.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She may be tough, but her class helps me stay in shape. She's very cool. and I think I'm going to have her for all 4 semesters of PE.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of my favorite teachers at Lowell. You run a lot and she keeps you in shape which is really nice. If you study for her tests they will be easy. Getting an A in her class is manageable if you work hard. Ms Hosoda motivates you to be a good athlete and is a genuine person. I definitely recommend taking her.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"meeeh...i mean i like her as a person and i get an A in the class, but many people complain that she is too dificult for them. it depends how in shape you are, if you dont do well n PE, Ms hosoda does not come recommened","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is good.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You have to try your hardest and not just 100%, but you need 110%... I actually shaved a minute on my mile","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I became much more fit and healthy in terms of exercising while I had her in freshman year. She's very nice, but she can be strict. She's very encouraging and pushes you to self-improve.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THE BEST PE TEACHER EVER!! I took her for FOUR semesters because she is TOTALLY AWESOME! Her class keeps me fit, and she's a great person. I wish i can take PE Junior year with her again!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's sweet, thoughtful, funny, and wants the best for everyone. Sportsfolio checks, study guides for written tests. Offers help for PE and nonPE related subjects. Keeps you in shape for sure. Running, pickleball, weight room, badmitton, bleachers, fitness stations, fire lane run = things we've done","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Love her! She's EXTREMELY helpful and positive about your health and needs. She understands our bodies and she's just a great teacher overall. Very fun and enthusiastic personality. Definitely recommend her.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Too involved!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Totally awesome teacher. really nice and has a great sense of humor. you learn a lot about stuff because if you don't know it, your grade goes down when you fail her tests. her group activities are very fun.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Hosoda pushed me to do better in exercising. She'll say hi to you when she sees you, and she's really sweet. She cares about her students, yet it seems she can be really strict about it. I recommend her for P.E. She's a great teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Hosoda is the toughest pe teacher. She pushes you to do your best, and you really do feel great after her class because you know you're in shape. At the time i had her, i wanted another teacher. One that didn't care what I did. But now i miss her class. It's a weird feeling, but she pushes you to be in shape. She's a really good pe teacher!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy class as long as you participate. Written and control tests can be difficult but they don't affect your grade too much. Her units for 1st semester 9th grade P.E. are not too exciting but there O.K.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her classes are fun and you actually learn the sport well enough to play with your friends or something. the tests are that hard because you are learning the material everyday. beleive or not, i learned about the location of muscles.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is so fun and I even have her for Reg. Her best phrase is \"your killing me\" do good on tests and sportfolio and its an A.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think ms. hosoda is the best PE teacher ever. She's super nice if you get to know her, she's funny, and she pushes you to do your best. If you're looking to just sit around and be lazy don't take her, but if you're interested in getting fit while having fun, do take her and you'll be happy. She's","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Ms. Hosoda for one semester and she isn't as bad as I thought she would be. I'm not that athletic and I still managed an A in her class. We run every Monday, but she's not too intense. She is very understanding. Grades are based on participation.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is very nice.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She will get you in shape!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a really easy teacher because all you have to do is participate. She's very good at remember names also!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"not as hard as everybody down there made her seem. not athletic at all but hosoda made my pe super fun this year. may be the hardest pe teacher bc we have heart rate straps and run weekly, but she pushes u to ur best and gives lots of positive feedback to make sure ur mastering unit skills. rly caring person and super funny. i don’t like her written tests tho which are maybe once or twice a semester but should get an A if u put all ur effort in and u participateSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is an amazing teacher! But when it comes to basketball tryouts, is hard. Like in the begnning she said we dont take you base on your skills and stuff like that. But at the end, she took all the skilled people. All the people who made it on the team are mostly guards. I hope she can take some other positions for next year.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very good at teaching you sports and helping you. However, she gives WRITTEN tests!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Im not really into exercise, but her class is pretty interesting. Shes very supportive :)","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Loves to make her students memorize their muscels. really nice and sweet.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A P.E teacher that makes you exercise?! No way! Make sure you really push yourself to your limits when she grades you, because you can collapse later, but not then. Participating in her practices helps too, because they'll strengthen you. Recommended if you can and want to do P.E.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She may seem very strict at first, but overall she is a great P.E. teacher. She makes sure to keep everyone on task and working.. to keep pushing yourself. She is by far the hardest P.E. teacher but its worth it. Her tests and assignments are too bad, but she can be a little technical on grading.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's nice, but makes you run the 800 everyday and do lots of pushups...","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pretty awesome ! only hate her grading on tests and finals","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she considers PE important when 4real it iz not. tries to make her class like the other academic classes. that is why she gives us written tests. i mean dis is PE we r suppoose to only be excercising not putting not useful infor in our brains.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I KNOW MY MUSCLES NOW","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome pe teacher! I had her both semesters, the 2 one she lightened up A LOT and we only had 1 quiz and 1 sportfolio check. if you want to be physically fit and have fun take her!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty dam hard... but beats you up to shape if you take her regimen seriously","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She takes P.E very seriously and actually makes you exercise because she wants everyone to be healthy and fit. She is very nice and easy to approach. It is true, she is a drill sergeant but if you work hard everyday and have a positive attitude, you'll get an A. My first and favorite P.E teacher!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hardcore! Never had to exercise so much before... almost died from running","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Hosoda! She's very helpful, and her class keeps me awake in the morning. The only bad thing about her, is her written tests. but other than that she's great!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes cool and helpful! just show effort!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She actually teaches physical education and is reasonably nice. A bit strict but probably the most helpful. However, If you have the same IQ, grammar, and mentality as the person who posted all 1's on 12/11/10, you shouldn't take her.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's okay. runner favs but it's okay","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"super tough.... can never come out of her class not sweating (or tired)","rating":4.7,"version":1}],"rating":4.637837837837831}},"__N_SSG":true}