{"pageProps":{"teacher":{"name":"Claudia Park","departments":["English"],"semesters":["Spring2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"English 2","block":"4","semester":"Spring2017"},{"name":"English 2","block":"6","semester":"Spring2017"},{"name":"English 1","block":"1","semester":"Spring2018"},{"name":"English 1","block":"7","semester":"Spring2018"},{"name":"English 2","block":"3","semester":"Spring2018"},{"name":"English 2","block":"5","semester":"Spring2018"},{"name":"Critical Writing","block":"4","semester":"Spring2018"},{"name":"English 2","block":"3","semester":"Fall2018"},{"name":"English 2","block":"5","semester":"Fall2018"},{"name":"English 2","block":"1","semester":"Fall2018"},{"name":"English 2","block":"7","semester":"Fall2018"},{"name":"Critical Writing","block":"4","semester":"Fall2018"},{"name":"English 2","block":"1","semester":"Spring2019"},{"name":"English 2","block":"5","semester":"Spring2019"},{"name":"English 2","block":"6","semester":"Spring2019"},{"name":"Literature and Philosophy: Ethics of Eating","block":"2","semester":"Spring2019"},{"name":"Literature and Philosophy: Ethics of Eating","block":"4","semester":"Spring2019"},{"name":"English 1","block":"3","semester":"Fall2019"},{"name":"English 1","block":"5","semester":"Fall2019"},{"name":"English 1","block":"7","semester":"Fall2019"},{"name":"English 2","block":"1","semester":"Fall2019"},{"name":"English 2","block":"4","semester":"Fall2019"},{"name":"Literature and Philosophy: Ethics of Eating","block":"1","semester":"Spring2020"},{"name":"English 1","block":"3","semester":"Spring2020"},{"name":"English 1","block":"5","semester":"Spring2020"},{"name":"Literature and Philosophy: Ethics of Eating","block":"6","semester":"Spring2020"},{"name":"English 1","block":"7","semester":"Spring2020"},{"name":"English 2","block":"2","semester":"Fall2020"},{"name":"English 2","block":"6","semester":"Fall2020"},{"name":"English 2","block":"2","semester":"Spring2021"},{"name":"English 2","block":"6","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-07T17:42:36.389Z","text":"English 2: She’s really nice and explains things well. Her tests aren’t hard as long as you pay attention but her participation system isn’t the best. You have to participate at least twice a day to get an A in participation. Everyone usually had an 80-88 for participation ","rating":4,"version":0},{"timestamp":"2020-05-07T13:38:05.184Z","text":"I had Ms Park for eng 1 and I’m taking her for eng 2 again. She’s sooooo nice and chill. She likes to throw in some jokes and funny videos once in a while. You’ll learn a lot from her. Essays are graded harder than other work but it’s a pretty reasonable system. She rarely gives quizzes and when she does if you put the slightest effort a high B wouldn’t be a problem. She values building a community in class a lot which is very important. I met one of my best friends through her English class. Anyway just pay attention in class and you’ll be fine. Take her!","rating":5,"version":0},{"timestamp":"2020-05-02T05:05:14.586Z","text":"shes super good at communicating and is clear with instructions. values participation and has relevant homework regarding the books we read. i had her for english 1 and did pretty well. essay grading is pretty rough but you can ask her for criticism and advice. overall really good teacher and would take her again.","rating":5,"version":0},{"timestamp":"2019-06-01T21:26:12.625Z","text":"She's a really nice and friendly teacher. People think she grades harshly on her essays, but I think that her grades are pretty realistic. Her class is a lot of book discussion in groups or as a class and she's very considerate with homework.","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Park is a really good English teacher and her class is a fairly easy A as long as you put in the effort. (She doesn't know everybody's name - only a few students.) Sometimes projects might seem a little overwhelming, but if you manage your time well you can finish them on time.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Park is one of my favorite teachers! Her class is so chill but not too chill to the point where you don't learn. She's super nice and understanding and homework is usually a couple of reading questions that take no longer than 30 minutes to do. Tests are easy as long as you keep up with the book and do the homework. I would definetly take her class again!!!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Ms. Park her first year teaching here at Lowell and she is one of the most sweetest people I have ever met! Her class is fairly easy, homework usually reading questions with the occasional vocabulary comprehension quiz. If you have the chance take her!!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Park is honestly my fav. teacher ever. She's so chill and understanding its insane how nice she is. She doesn't give terrible homework assignments and usually assigns reading questions. I really recommend her cause she's super clear, understanding, and not a stressful teacher at all. My class always laughs and its just SOO CHILL OMG. TAKE HERSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took Ms. Park the first time she was an English teacher. She is such a sweet and approachable teacher. I like her and her class is an easy A if you put slight effort. She was an easy essay grader and kinda helps with writing. I totally recommend her for English because she's helpful and I like how her class is chill. One of my favorite teachers, especially English!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher! You learn a lot and her class is really interesting. Gives a couple of essays which are pretty challenging but overall not a super difficult class, and very engaging. She's very nice and is proactive in helping her students both academically and socially. Highly recommended.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A lot of people get high B's or low A's in her classes. She grades hards on essays, so if you do bad on one, your grade won't recover. (they're worth 65% of your grade). Pretty nice teacher, and doesn't accept late homework. Also you'll take a test where you fill out your classmates' names on a piece of a piece of paper and graded on whether or not you get them correct.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Park is the nicest English teacher at Lowell! She's always willing to help and happy and I don't think I've ever seen her mad. My only complaint is that she graded kind of harshly on our presentations but other than that she's very fair. Homework is usually a few reading questions but they're simple and she goes over them. Tests are fair, some vocab and some book testsSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Park is super nice. Her class is very chill yet she still teaches. Homework is usually just reading questions on whatever is being read in class. Quizzes are just on vocab and English rules sometimes. Would highly recommend.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is really nice & incredibly knowledgeable. she is a hard grader on essays but tests are infrequent and easy. you'll get maybe 30 min of homework a night but you will learn a lot. Participation will help a lot if you want a good grade. Hard to get below a B in her class. You also watch movies a lot and analyze themSubmitted by a student","rating":4.7,"version":1}],"rating":4.714285714285715}},"__N_SSG":true}