{"pageProps":{"teacher":{"name":"Cristina Billingsly-Ballbe","departments":["Foreign Language"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Spanish 2","block":"3","semester":"Fall2014"},{"name":"Spanish 2","block":"4","semester":"Fall2014"},{"name":"Spanish 2","block":"7","semester":"Fall2014"},{"name":"Spanish 2","block":"8","semester":"Fall2014"},{"name":"Spanish 3","block":"2","semester":"Fall2014"},{"name":"Spanish 2","block":"3","semester":"Spring2015"},{"name":"Spanish 2","block":"4","semester":"Spring2015"},{"name":"Spanish 2","block":"7","semester":"Spring2015"},{"name":"Spanish 2","block":"8","semester":"Spring2015"},{"name":"Spanish 3","block":"2","semester":"Spring2015"},{"name":"Spanish 2","block":"3","semester":"Fall2015"},{"name":"Spanish 2","block":"4","semester":"Fall2015"},{"name":"Spanish 2","block":"8","semester":"Fall2015"},{"name":"Spanish 4","block":"7","semester":"Fall2015"},{"name":"Spanish 3 Honors","block":"2","semester":"Fall2015"},{"name":"Spanish 2","block":"3","semester":"Spring2016"},{"name":"Spanish 2","block":"4","semester":"Spring2016"},{"name":"Spanish 2","block":"8","semester":"Spring2016"},{"name":"Spanish 4 Honors","block":"7","semester":"Spring2016"},{"name":"Spanish 3 Honors","block":"2","semester":"Spring2016"},{"name":"Spanish 2","block":"3","semester":"Fall2016"},{"name":"Spanish 2","block":"4","semester":"Fall2016"},{"name":"Spanish 2","block":"8","semester":"Fall2016"},{"name":"Spanish 3 Honors","block":"2","semester":"Fall2016"},{"name":"Spanish 4 Honors","block":"7","semester":"Fall2016"},{"name":"Spanish 2","block":"2","semester":"Spring2017"},{"name":"Spanish 2","block":"3","semester":"Spring2017"},{"name":"Spanish 2","block":"4","semester":"Spring2017"},{"name":"Spanish 2","block":"8","semester":"Spring2017"},{"name":"Spanish 4 Honors","block":"7","semester":"Spring2017"},{"name":"Spanish 2","block":"2","semester":"Fall2017"},{"name":"Spanish 2","block":"3","semester":"Fall2017"},{"name":"Spanish 2","block":"4","semester":"Fall2017"},{"name":"Spanish 2","block":"8","semester":"Fall2017"},{"name":"Spanish 4 Honors","block":"7","semester":"Fall2017"},{"name":"Spanish 2","block":"2","semester":"Spring2018"},{"name":"Spanish 2","block":"3","semester":"Spring2018"},{"name":"Spanish 2","block":"4","semester":"Spring2018"},{"name":"Spanish 2","block":"8","semester":"Spring2018"},{"name":"Spanish 4 Honors","block":"7","semester":"Spring2018"},{"name":"Spanish 2","block":"2","semester":"Fall2018"},{"name":"Spanish 2","block":"3","semester":"Fall2018"},{"name":"Spanish 2","block":"4","semester":"Fall2018"},{"name":"Spanish 2","block":"7","semester":"Fall2018"},{"name":"Spanish 3 Honors","block":"6","semester":"Fall2018"},{"name":"Spanish 2","block":"2","semester":"Spring2019"},{"name":"Spanish 2","block":"3","semester":"Spring2019"},{"name":"Spanish 2","block":"4","semester":"Spring2019"},{"name":"Spanish 2","block":"7","semester":"Spring2019"},{"name":"Spanish 3 Honors","block":"6","semester":"Spring2019"},{"name":"Spanish 2","block":"3","semester":"Fall2019"},{"name":"Spanish 2","block":"4","semester":"Fall2019"},{"name":"Spanish 2","block":"7","semester":"Fall2019"},{"name":"Spanish 2","block":"8","semester":"Fall2019"},{"name":"Spanish 3 Honors","block":"2","semester":"Fall2019"},{"name":"Spanish 3 Honors","block":"2","semester":"Spring2020"},{"name":"Spanish 2","block":"3","semester":"Spring2020"},{"name":"Spanish 2","block":"4","semester":"Spring2020"},{"name":"Spanish 2","block":"7","semester":"Spring2020"},{"name":"Spanish 2","block":"8","semester":"Spring2020"},{"name":"Spanish 2","block":"3","semester":"Fall2020"},{"name":"Spanish 2","block":"4","semester":"Fall2020"},{"name":"Spanish 2","block":"6","semester":"Fall2020"},{"name":"Spanish 3 Honors","block":"2","semester":"Fall2020"},{"name":"Spanish 3 Honors","block":"7","semester":"Fall2020"},{"name":"Spanish 2","block":"3","semester":"Spring2021"},{"name":"Spanish 2","block":"4","semester":"Spring2021"},{"name":"Spanish 2","block":"6","semester":"Spring2021"},{"name":"Spanish 3 Honors","block":"2","semester":"Spring2021"},{"name":"Spanish 3 Honors","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-06T19:22:31.174Z","text":"her class is rly easy and she's super funny. sometimes shes rly mean, but in a funny way and she doesn't know how student vue works so every assignment, including the final, is worth 1 point. Shes super lazy too. easy A","rating":4,"version":0},{"timestamp":"2020-05-04T18:55:42.734Z","text":"One of my favorite teachers- extra credit makeup for tests so you can always get at least a 90%. Be nice to her and she'll be nice back. One of my absolute favorite classes, by far the best mix of easygoingness and actually learning a lot of Spanish. I recommend!","rating":5,"version":0},{"timestamp":"2019-06-04T15:30:37.398Z","text":"Ms ballbe is funny and good.","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Señora Ballbé is amazing! Doing the homework is not very important, but you really have to pay attention in class to get As on the tests. Don't hesitate to sign up for Ballbé. She's one of the best teachers I have ever had, and is very sarcastic and funny.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ballbe's class helped me alot verbally and in writing. She does speak fast sometimes but her class is fun.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's so easy. I didn't have to do homework. In fact, I was doing my other homework in her class. You just have to learn how to improvise on the spot and keep it simple. Simplicity in her class is the key. Also she's really moody.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Literally do the homework and show up to class and she will move your grade an entire letter. I had an 86 at the end of the semester and she changed it to a 90","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I just have two words for Ms. Ballbe. QUE BUENO.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher!i recommend her to all my friends!Tests are easy and straightforward.She doesn't look at homework too much so it's really chill.Time flies by in her class and i look forward to it everyday.Try taking 19/20..","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"lazy in class. sometimes too lazy to help students.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes really funny! i love her class! her final was hard and like halve the class failed but she is so cool!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms balbe is SUPER COOL. seriously, at first you might be like eghh but she really grows on you and she has a really good sense of humor. if you study for the tests, you'll be fine and it can be a really fun class. just take her!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not the best, but shes better than everyone else. Doesnt really teach, but very relax. Mostly skits in Spanish 5, and movie every friday(en espanol)cuz shes soo lazy.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THE FUNNIEST TEACHER I EVER HAD. If you want a fun learning experience take this class, but she does grade harshly and will take points off. Her tests are a little difficult sometimes, and if she knows you name you will be called on a lot","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She talks way too fast and does not teach much. Sometimes she mumbles and I find it difficult to comprehend what she's saying, especially since I'm still learning the Spanish basics. On Wednesdays, it is usually lab for Spanish Honors and Friday is MOVIES! Haha. I love the movies. Anyway, if she knows your name, she'll keep calling on you every single time. Senora Ballbei likes to chew gum a lot and always comes to class late, even though she's the teacher.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think she's an awesome spanish teacher! My class and I all love her. She's really funny and sometimes we'll all be laughing so hard that we start crying in her class. I've also learned a HUGE amount.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Funniest teacher ever! Last week, she wrapped tape around her finger and couldn't get it off. Her TA used a scissor to try to cut it off, but Ballbe was scared. So 20 minutes of class was spent looking at Ballbe struggle getting masking tape off her finger. Typical day in Spanish class (=","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SHE IS MUY AWESOME! Even though she favors people (A LOT)she's still really easy to talk to when asking questions. Also, what she teaches really sticks to my brain. Her tests aren't hard, just STUDY and prepare to enjoy and laugh hard if you sign up for her class.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Super nice and as long as you turn in your work on time and KEEP YOUR FOLDER NEAT you'll do fine. Her tests are really if you know your vocabulary and grammar but practically impossible otherwise. folders projects and make up work all count the same as a test so as long as your work is neat youre good (especially if you can draw and decorate she loves that stuff). QUE BUENOSubmitted by a student","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"QUE BUENO!i love her, she's great","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She actually teaches you Spanish. I had Mr. Lipman first and learned NOTHING! Having her for my second semester helped a lot though. You don't have much homework, but you do have presentations. The presentations are easy though because they only need to be ten sentences. She only gets mad at people who don't do the homework or talk during class. Overall, I think she is a really good Spanish teacher. In your next Spanish class, you will realize that she taught you everything you need to know.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms ballbe is the best spanish teacher!!! she's really funny and makes class interesting. sometimes she can be a little moody but she's usually really nice. take her if you have a chance because she can improve your spanish","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms balbee is the best spanish teacher ive had by far. very cool and relaxed, can talk to her about anythign and she'll understand.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good teacher, teaches well, fair grader","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I will sum up Balbe's daily routine. She writes a page number on the board, we practice the dialogue from it, memorize it, present it. About three tests a grading period. Her tests are of medium diffuculty, but some of the things on the test come by surprise, meaning we she never told us to study it. We spend about the whole class reading our text book, while she is busy painting her nails, and etc. She is VERY lazy and MOODY. She gets angry easily taking fustration on ALL her students. Warned u","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really funny. her class passes by really fast and she is a really good teacher.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i've had her for two semesters now i think her tests are hard but i gues it's my fault because she doesn't make up her tests it's from the book if you study and get A's then you get an A people think her notebook is hard but i don't think so as long as you do what she tells you to homework is everyday almost but it's not that long 10-15 mins. she's kinda slow though i think because we're suppose to finsih the book which is 9 units but we only got up to unit 7 pretty nice she'll always help you","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Nice, fun and super awesome teacherDo a lot of dialogues in class Light homework loadBUT IMPOSSIBLE TEST (no word bank)","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"everyone thinks that shes moody&mean&lack the mood to teac, yes true at times, but also false.shes funny most of the time,even if she makes fun of people, it makes the class laugh.theres random moments in class but i loved it.i had her for spanish&algebra,she teaches everything very clearly and helps you until you get it.istrongly recomend her. theres a test every couple weeks and presentations that last literally 30 seconds long.many inclass activities but pretty easy.easy b.better than lipman.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She isn't a horrible teacher. You learn alot and you get to practice verbal and oral spanish alot. Her movie choices are pretty kiddy though. Need some rated R's","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Excellent teacher! You get oral and grammar practice, and she gives good notes. Everything's pretty much by the book, and anything that isn't, she makes sure to explain. She's very funny and gives parties, but can be moody. She picks on students who know what they're doing, but grades objectively.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Amazing.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms, Babble was not a good Spanish teacher. She did not teach well and had difficult exams. I would not recommend taking her for Spanish 2.Submitted by a student","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I learned a lot from her and she's a great teacher.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's so funny. you learn. many presentations, but they're fun. lot's of class disscussion and movies if you're good.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good teacher. cool class. students learn a lot.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best thats all i can say","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"its not balbe, its Ballbe(with an accent on the E) She is AWESOME. she is cool with everything and her laugh is contagious. you'll have a BLAST in he class. Ella es la maestra mejor!!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's the most awesome spanish teacher ever!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Balbe is the best teacher ever. Lots of dialogues and projects and fun stuff. Even if you aren't good at spanish, you will most likely get an A in her class. She is super funny and chill. Take her if you can. QUE STUPENDOSubmitted by a student","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Just take her. Awesome teacher. A bunch of cool, fun, in class activities like making dialogues into improv. Tests can be hard, usually not. Homework is usually not that long either. Workbook pages that you can do in <15 minutes, and it's not even everyday. She's also one of the few teachers that really care about her students too. She loves her students, but if you're one of her favorites, instant-A.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"dude. the spanish teachers at lowell arent great at all but ms ballbe is THE BEST you'll ever get.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shes hard. She doesnt allow you to speak English.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"OMG. hahahha. one of the laziest teachers EVER. you watch movies very often and the homework is just a joke. VERY EASY. id take her again if i could","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ballbe > all the other Spanish teachers. Moderate amount of homework. Tests aren't that bad as long as you know the vocab and how to conjugate verbs. A lot of dialogue, but you can improvise it. Keep things simple on projects and you'll do fine. She's so funny and nice too.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's very easy going, but on some days, she can get really irritated. I'd say about 95% of the time, the classes went by really fast. Her tests are not from the book, so you have to pay attention in class. She's a bit scary at first, but you get to like her after a while.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the things that people said about mrs. ballbe are both true and false. although she is laid-back and lazy, she is not mean, she is just blunt. she likes making fun of people, but its hella funny. people need to stop taking things seriously. her test are easy, if you study. in my opinion her class wasnt hard at all. i got an A in her class for spanish 2. she is really cool to talk to. dont piss her off or else she will give the class a U. she talks really fast and in mainly spanish, so listen.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ballbé is pretty easy for Spanish honors, but she speaks way too fast, and has frequent mood swings.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"alright, shes NOT THE BEST. ill admit. but better than cadoppi and ryland. had em both... this one is easier. :)","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had her class for two semesters freshman year. she's funny, and she teachers alot!!all you need to do is ace her tests and its an automatic A","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"have her for spanish. she can have an attitude but she's a good teacher (=","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Señora Ballbé is funny, but she's a horrible teacher with bad movie taste and an inability to teach clearly!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"not the best teacher. maquinana>ballbe if you dont like to write like me, then take her cuz everything is about dialogues. her tests are kind of hard tho.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE BALLBE! OMG haha she goes BRAVOO! MUY CUTEE! yeah she taught a lot, tests arent hard if you just study. they are pretty straight forward. Learned a lot.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I didn't give her the best of ratings, but I love Senora Balbe. She's so funny & knows the material, but she's not too enthused about teaching GPA mongerers","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's the best teacher i ever had. i learned so much, and shes the funniest teacher ever! everyone cracks up. once you have her, you'll never regret it.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hecka smart and the best spanish teacher- EVER","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Better than maquinana, FUNNY, and is cool. Her tests get harded 2nd year but she is cool.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's very funny! She does play favorites so try not to make her mad. Homework is pretty easy and as long as you listen in class and study, you can ace the tests.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Two years of sra ballbe! i had trouble with tests so one day during lab she worked with me instead. if you study the material and try you'll be fine.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She gave a bad impression at first because it was hard for me to understand her by her strong accent, but in the end, she was a really good teacher. Shes funny and the tests were easy (if you study). I would take her again but sadly shes not teaching my time.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"extremely eccentric but hilarious--watch out for that culture stuff!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher and REALLY funny!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I better get her for the second sem. shes just a great teacher, and also a cool person. she is really fun to joke around with. if you get on her good side, you'll do good.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is eccentric. But she teaches Spanish pretty well (better than anyone else). She is moody but can be hilarious, and she's not intimidating the way certain teachers are.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"moody, ridiculous and just about the best ever. she has favorites, but she's a fair grader. Tests matter the most, so study. Homework is eh, just do it before she collects your binder. Volunteer for dialogues, theres no reason not to get extra puntos in that area.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is funny and easygoing if she likes you, but sometimes you can be hard and unforgiving if she thinks you're rebelling. her tests are okay if you do your work and minimize spelling errors.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I loved Balbe's class! She's awesome! I learned a lot. I thought her class was pretty easy. & a 89% in her class is an A-. She's very nice, although she may seem a little intimidating at first, but she's pretty cool. (= I would recommend her.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's really funny. Her tests can be hard, but it's definetly worth it. I learned so much and I'm planning on getting her for 2nd semester. [:","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes so hilarious but has a huge attitude but its always for fun. her work is never difficult but since she speaks spanish the whole class it may b hard to understand what she wants. easy B somewhat difficult A. shes way better than lipman. also dont be intimidated. she always tries to help u even if she sounds sarcastic","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I've taken Lipman/Balbe/MaquinanaLipman: Less predictable grades, but you don't have to do ANY homework.Don't really have to do anything in class, but class can be boring. You will not learn as much.Maquinana: Predictable grades, quite easy to get A IF you do homework- but there WILL be homework and projects galore. You will learn.Balbe: Hardest grader, easy B hard A. Hard tests. Moderate homework. FUN class, and you WILL learn.I suggest Balbe unless you think grades > fun/learning","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best teacher i ever had, but of course, i had her for Algebra 1. Ridiculusly Funny, but i had to teach myself the material. If you have the opportunity, defenitly take her.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I'm close to failing but it's great because I'm learning so much. If you take the time to ask her about things you don't get, she'll explain them.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"maquinana>ballbeshes funny and all, but she doesnt teach as much. everything is about oral exercies and dialogues. easy B","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not that bad as a teacher overall, certainly betetr than some other spanish teachers out there. You won't be bored in her class, although there are a LOT of presentations that you have to do. Tests are hard to most people, but you can get decent grades by studying and listening to her. When she gets mad though, run for the hills...","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love ms.ballbe!! she is soo awsome! i took her for spanish 1 and i learned a lot from her. she is a great teacher and she is really funny!! i am soo going to take her for spanish 2","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cool teacher! LOVE HER! shes funny nd nice.. If she knows ur name she'll call on u..she dsnt give extra credit but her projects boost ur grade up. Test are hard othen than that its pretty chill.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love her personality and her jokes...she's really nice but i'm not very good at spanish so i think it's a hard A her tests are ok, you just need to study the textbook. overall she's a good teacher but sometimes does get carry away","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes so lazy that its funny. you watch movies every friday, and its a pretty easy class.","rating":4.1,"version":1}],"rating":4.121250000000002}},"__N_SSG":true}