{"pageProps":{"teacher":{"name":"Dacotah Swett","departments":["Science"],"semesters":["Fall2014"],"classes":[{"name":"AP Biology","block":"1","semester":"Fall2014"},{"name":"AP Biology","block":"2","semester":"Fall2014"},{"name":"AP Biology","block":"4","semester":"Fall2014"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP Biology Pros: Nice and friendly as a person, not a lot of homework, except the reading and taking notes. sometimes tests are a little hard Cons: she goes off topic a lot, sometimes power point lectures put you to sleep, and its hard to keep the information in your head, cause theirs a lot of stuff you need to learn in a short amount of time.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Swett is not the best and not the worst teacher. Had her for AP Bio and not very much homework. Tests are ok in difficulty, if you study. I didn't read the book AT ALL. its freaking huge! needless to say, im borderline A...picks favorites, try to be one of them. She's very nice and a good person, but I studied the crap out of Cliffs AP Bio. I would definitely reccomend taking Chem and Physio before this course.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy teacher, but definitely a lot of self-learning going on. ALWAYS remember to read the book before a test. Because she puts a lot of stuff that we didn't cover sufficiently in class on the tests. Most of the learning are through labs. She has her favorites, so try to get into that circle. Rarely homework, but just remember to study a lot before tests.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not a very good AP Bio teacher, but she's very nice; rounded my B up to an A. Somewhat easy A if you study from the textbook and online resources.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take her for AP Bio. Not any other science courses. She knwos her material, teachers very well, prepares you for AP test, and her tests are NOT tricky. SHe is a very kind person and is very easy to talk to. Not much reading compared to Hill. choose her over hill all day everyday.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the learning process is different (see person below) but she helps you a lot with understanding the concepts, and labs are often and fun. she's really fun in class, and she definitely knows what she's doing.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Don't bother thinking you're going to be taught the material. Self studying the whole year.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty good teacher and does alot of labs, but she does not do lectures alot (not a boring class), so u gotta learn from the book, shem akes u read it too","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"self studying","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Swett is the coolest chemistry honors teacher. She is nice and you learn a lot. I got a D in Dr Marten;s class and i got an A in Swetts. She gives LOT of extra credit so that will boost up the hard tests, and they re not actually that hard if you read the book. She tells you what will be on the test so just study from her workshts. 1/2 of the stuff on the wrksht will be on the test and the other half is in the bk. She is the best science teacher at Lowell. She also lets you out on long days.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She ruined my AP bio experience last year. Her Tests are pointlessly hard and dont help for the Ap test. She is kind of mean some times and her labs are stupid. She plays favorites with students.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mrs.swett is cool, but shes really hard to understand. little homework, but tests are soooo hard. they seem easy, but theyre really tricky and are therefore really hard. boring!","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms swett is pretty cool. the class is kind of a joke, and you dont learn a lot. but you have lots of labs. shes really funny and cool if you talk to her one on one.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"first off she teaches ap bio now, and is a really cool teacher but tends to get off topic into environmental science. i love her lectures b/c it is powerpoint. pretty easy but must read the book for yourself if you have to do well on the tests. she doesn't give very many tests","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her tests are unreasonably hard and she is not a good prep for AP Bio. Take hill. He can read you the book. In her class, I was doing everything on my own.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she`s SO COOL!! take her if you actually study ... like by yourself. it`s very easy to go downhill in her class cus she doesnt enforce the work. but shes a GREAT teacher because she cares about the students . and i learned a LOT from her.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mrs Swett is a great Chem teacher and a perfect alternite to Green. SHe tries to help students as well as being very nice and good natured. She knows her stuff too.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hecka easy. dont learn a thing though.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she great! sometimes there isnt a lot of learning but thats beacuse she does most of her teaching through labs which are REALLY fun! dont take her for first semester though if you r in Chem H and have a crappy pick second semester because then you will have a hard time if u get Marten","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"LOVED her for AP Bio. People say that she doesn't teach you anything, but that's NOT TRUE.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"her class is very hard. lectures are entertaining sometimes, but long. she picks on certain students in front of the entire class. funny but unclear.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She sucs for AP Bio doesnt teach and tests are extreemly har. our last test avg was 60.5 % and she said this was on of the easier test of the semester. Take hill at least he makes and attempt to teach","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's really easy (She'll postpone tests or give you freebie points if you complain!), but she assigns too many boring labs!","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's nice and barely gives hw and u do cool labs.she doesn't teach you very well and therefore when it comes to test, it's extremely hard to get a good grade.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"you are all crazy... she is so nice, and her tests are the same as Hill's, but she actually teaches. And if you actually WANT to take Hill, please do. That'll leave space for non-masochistic people to take Swett. She looks like her pet turtle, but she's def. enthusiastic, clear, and knowledgeable. labs are pretty interesting. The A you yearn for is yours if you work for it.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Swett is the kind of teacher who tries to please her students. She's not bad and her labs are fun.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Swett hardly teaches you enough for the AP test;from what I've heard, Dr. Hill doesn't get that far either. At least Ms. Swett is funny and understands that we have homework in other subjects. I can't say that she doesn't try to teach, but she doesn't go fast enough. Choose Ms. Swett over Hill","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ha...cool i'm the first person rating her! anyway, i really like her class, she makes chemistry fun! and she makes some jokes which can amuse u during class :)","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She teaches you Chemistry, but you don't notice it until the end of the year. I was quite surprised by how much I knew. She's good, discreet. She's a joker, too, so her classes are interesting. She is a very charismatic person, and you just want her to like you.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Useless for AP Bio. At least Hill reads the book to you.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ok this is a baisis rating from her rocket scientist engineer. Total excellent, ut I have known her for her whole life! Mark","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Swett! I had her for Chemistry Honors both semesters and she's quite easy! You can get a B on all of the tests and still get an A for the semester through labs and paper-towel extra credits! =] She doesn't assign that much homework, so you have to learn on your own, but besides that,s he's really nice and fun to talk to!","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"swett doesnt teach doesnt do anythin people eat in class she deosnt care her tests are hard and she favorites talks bout random things i swear dont take her","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ok teacher, but lectures a lot.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Loved her class. She even ate chalk.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Swett is a really cool teacher overall...but the thing is that she doesn't really teach as you normally would...the class usually goes off topic...if you are a good self-learner take her. I took her for AP Bio...I learned little from her but still pulled a 5 out by self-studying. Her grading is actually kind of arbitrary. If she feels like you deserve an A, she'll give it to you...so really befriend her.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her love and enthusiasm for biology is contagious, but her teaching methods and lectures do not effectively teach the material needed for AP BIO. Moreover, her time management isn't the best. Like many other classes at Lowell, you will have to self study to really understand the curriculum and do well. Since Dr. Hill is gone, I suggest running to the next teacher who will replace him because I heard that he is a very good teacher.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes a very good chem teacher n i learned a lot. her labs wer very fun n she always tells stories. d chem book s boring tho.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for Chem; she was AWESOME! Fun labs.. little lab reports. Not a lotta homework. If you have a question, she'll gladly answer it. Gives freebie points cause sometimes she makes errors. She lets us out early on long days =) Listen to her lectures & read over the chapter and you'll do fine if you understand the material. She's not as difficult as people say..maybe cause they don't pay their UNDIVIDED attention in class. Got an A =]","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"while ms. swett is a cool teacher i felt unprepared for the ap test. you need to study on your own if are trying to aim for a high ap score for ap bio. she goes off on a tangent about sea turtles a lot. test are also hard but then labs and other class activity can bring your grades back up agian","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You don't do much in class, and there's not much homework either, but the tests she gives are really hard. The book will be your best friend if you take her class.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty fun class because she NEVER talks about chem! so you don't learn much. not too much homework. but she's really understanding. if you have an 88.8 percent, you'll get the A. she's funny and fun to talk to! you do lots of labs, which are bonus points!","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very cool and funny. hard though... not too much homework, but tests are very difficult","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Swett's okay. Her tests are not that bad if you read the book, which can get tedious because you have to study a lot on your own.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Biology is not an easy course and having a teacher who doesn't making engaging and interesting doesn't help either. Very nice person, but doesn't prepare you well enough. Very hard A, somewhat easy B.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"choose hill over swett any day. ok 1. i was not prepared. 2. not an easy A, hill has way more a's 3. hard unclear tests, while hill's are straight from the book. just dont risk ur year on this, you will regret it.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She can't teach and she's too hard","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Swett is probably the best chemistry teacher at Lowell. She's definitely not the easiest, but she's a great teacher. Not a lot of homework (which is a plus), but her tests are pretty hard. If you don't like studying and putting in some good, hard work, don't take her. But Ms. Swett is one of my favorite teachers, even if I didn't get an A. She's cool, funny, and her labs are usually interesting.","rating":3.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes fun. realli fun. she tries to teach u, but majority of the time u wont entirely get it. not much hw. test are semi hard.","rating":3.2,"version":1}],"rating":3.1999999999999993}},"__N_SSG":true}