{"pageProps":{"teacher":{"name":"David Lipman","departments":["Foreign Language"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016"],"classes":[{"name":"Spanish 1","block":"3","semester":"Fall2014"},{"name":"Spanish 1","block":"7","semester":"Fall2014"},{"name":"Spanish 2","block":"1","semester":"Fall2014"},{"name":"Spanish 2","block":"2","semester":"Fall2014"},{"name":"Spanish 2","block":"6","semester":"Fall2014"},{"name":"Spanish 1","block":"3","semester":"Spring2015"},{"name":"Spanish 1","block":"7","semester":"Spring2015"},{"name":"Spanish 2","block":"1","semester":"Spring2015"},{"name":"Spanish 2","block":"2","semester":"Spring2015"},{"name":"Spanish 2","block":"6","semester":"Spring2015"},{"name":"Spanish 2","block":"1","semester":"Fall2015"},{"name":"Spanish 2","block":"2","semester":"Fall2015"},{"name":"Spanish 2","block":"6","semester":"Fall2015"},{"name":"Spanish 2","block":"7","semester":"Fall2015"},{"name":"Spanish 3","block":"3","semester":"Fall2015"},{"name":"Spanish 2","block":"1","semester":"Spring2016"},{"name":"Spanish 2","block":"2","semester":"Spring2016"},{"name":"Spanish 2","block":"6","semester":"Spring2016"},{"name":"Spanish 2","block":"7","semester":"Spring2016"},{"name":"Spanish 3","block":"3","semester":"Spring2016"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"It's not really an easy A -___-... U have to participate alot and you can't just expect an A if you got A's on your tests...I mean it...Not easy at all...","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lipman is nice, easy, and helpful. If you need help, do not hesitate to ask him, he will explain everything very well. Grades are based mostly on tests and the rest on participation.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"(Spanish 1) The problem with Lipman is that he does not really teach you anything. He gives you vocab sheets around 2-4 weeks prior to the unit exam that your grade is based on, then he scarcely teaches about the vocab that he has given you. In my class, we looked over the words maybe 5 times throughout the 2-4 weeks prior to the test, when there was 2 chapters worth of material. He also does not grade that easily, about 3 people per class got A's on their tests.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's soooo nice and easy and chill. if you have a question, he'll answer it, plain and simple. he's one of my favorite teachers. take him!!! :D","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"in order to pass his class you have to participate and do well on the tests, and he sort of picks favorites","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a nice guy who really is a easy A he gives some hw but he does a lot of class review and doesn't grade hw most of the time","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I actually think he's a pretty good teacher, except he gives us lower grades to \"motivate\" us. Personally, it's frustrating, and it should be easier to get an A than it is.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's okay. Friday's are usually movie days so I nap in the corner. Uh tests are basically textbook excersizes. Subs usually once a week. If you wanna slack off a extra block just take Lipman. Usually sleep in this class.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't get why people don't like him. He's really easy. You just gotta make sure he gets to know you like knows you on a name basis. Say hi to him in the hallways. Don't be obssessed over your grades and ask him over and over what your grade is. If you're gonna raise your hand to participate, make","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THey're all wrong. Lipman is great. I learn a lot. You guys just need to learn to stop depending on people. Plus, EASY A.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lipman must be one of the nicest teacher in the school. Just chill and eat. However, if you actually want to LEARN spanish, do not take him. May be easy but teaches essentially nothing.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"such an easy teacher, but like your tests and participation are your grade. I only had a few pieces of homework the whole semester.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is a really COOL teacher, but you don't learn much, if you're SURE you'll get him for 4 years, then take him","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"class is boring. and u basically only have one test and thats ur grade, SO STUDY HARD","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Well.....all I can tell you is that it's an easy A. You should particapate alot becuase last time I had a B and then I had an A. You should take him. He's REALLY easy.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had him for spanish 2. he knows more than just the textbook and is a good teacher. i you do your work, then you are fine.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"After 4 semesters, he still doenst even know my name.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He doesn't give A's when they are deserved....I mean seriously....","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"you spend your whole time reading and when he gives hw he doesnt collect it so your whole grade is based on a final test at the very end of reading and translating. super easy if you study and hav good memory","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lipman>Maquieana","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Lipman is a good guy, he is willing to help you in any way possible, too. But he doesn't give you that much room to make a mistake, two graded assignments tops each trimester. You also read a lot in his class, which is fine. It can be fun, but the written translations can become a tedious job.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"if you try your hardest no matter how bad you do, youll still pass...but you must show that you care and try hard","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class can be boring at times, but it's so easy I honestly don't mind. Gives homework but never checks it (ever!) and tests are incredibly easy (I usually finish in 3-5 minutes). At the end of the semester, you have to do a group project--which is to make a movie in Spanish. He lets students eat and move to different sets when they feel like it.Submitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For Spanish, it's an very easy B, hard A unless you seem like the type to have taken Spanish before. He's friendly but the class can be a little to laidback that it might not be good especially for the more advance Spanish later on..","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Grading policy is confusing and difficult. I believe that if you get mostly a's on your tests you should get an a, regardless of where the tests are during the semester. Test scores should be averaged","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ok teacher; had him for french. he was somewhat depressing really easy B. I Learned alot i guess. okay teacher but seems like he has issues !","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"la clase de sr limpan esta un poco abburido(boring). time moves REALLY SLOWLY. u learn...but quickly forget so study heard.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very nice however you do not learn much.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"lipman's a pretty nice guy. though he doesnt really teach, his class is fairly easy. just participate and do well on tests (which are extremely easy), and you'll get an A.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"kinda lazy, but nice. you can learn from him. his grading policy is messed up. in what world does getting all As and one B on his tests get you a B ?","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had him fpr span 1. didnt learn anything at all. his grading policy makes absolutely 0 sense........","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"so he's become a lot more difficult since a few yrs ago. no more easy a's. unless you pretty much ace all his tests. it's a chill class, but definitely hard to ace unless you have the time to prepare for the exams. he's going on sabbatical next yr, so he won't be back to 09. take him if you're a fluent spanish speaker and a hard worker, or just really good at espanol.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"class is really chill. the grade is 2 parts: tests and participation. He assigns small amounts of hw that take like half an hour max, and his tests are simple if you know your stuff. you can talk alot in his class, and he's not strict at all","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good calculus teacher, helped me get a 5 on the calc BC testSubmitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a good teacher, but when he says \"participation points\", he doesn't really mean it. Your grade all depends on his tests, which are pretty okay if you studied. He gives the class two chances to listen to the oral part during the test, which is very helpful.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lipman's alright. Like everyone's said, he doesn't take attendance, most of the work is reading, but its an east grade. You can pay attention half the time and pass. Plus he doesn't really give homework and only test grades really weight heavily.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a really nice teacher, I just don't his grading policy.....","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him second semester of spanish one, after i had maquinana, and I pretty much lost alllll the spanish I'd learned. Most boring class in the world, not only do you not learn, you forget what youve already learned. Grading policy is completely tests, languages shouldnt be like that. ballbe and ma","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"In class, we just review hw and participate. Not much. Tests are worth 70& of your grade and he assumes you know everything. Don't be tardy. He passes back your tests by the highest scores to the lowest (so it's embarassing if you failed cuz everyone would know). Basically to learn, you study by yourself. Class is boring.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for Spanish F'08. He didn't teach much, was boring, and gave me a C for no apparent reason. I will say he's a pretty nice guy, but that's about it.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's not a particularly good teacher, but he's very nice, and very easy. We watched El Norte in his class. But he doesn't teach the vosotros form!","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's ok. can't really teach, and has like only 2 tests.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very kind gentle and linient. You do your best he takes that into great consideration. Good man. Very hard to get a C unless u slack off","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"class not very fun though easy. u will still learn as much as the other students if u are devoted to sp and spend some time on it","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"EASY A, if you have a little bit of prior knowledge in Spanish. if you do not you will have to try when you do normal work, which is rare. You spend most days learning about the spanish culture and watching travel guide commercials and him telling you how cheap everything is there.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"has stupid grading system, and you dont learn anything","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for College & Career. Easy course. Little work, little worry, though a bit boring and somewhat unproductive.","rating":3.6,"version":1}],"rating":3.5999999999999965}},"__N_SSG":true}