{"pageProps":{"teacher":{"name":"David Hereford","departments":["English"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"English 1","block":"1","semester":"Fall2014"},{"name":"English 1","block":"5","semester":"Fall2014"},{"name":"Expository Writing","block":"7","semester":"Fall2014"},{"name":"Shakespeare","block":"2","semester":"Fall2014"},{"name":"Shakespeare","block":"4","semester":"Fall2014"},{"name":"English 1","block":"6","semester":"Spring2015"},{"name":"English 1","block":"5","semester":"Spring2015"},{"name":"Expository Writing","block":"7","semester":"Spring2015"},{"name":"Shakespeare","block":"2","semester":"Spring2015"},{"name":"Shakespeare","block":"1","semester":"Spring2015"},{"name":"English 1","block":"4","semester":"Fall2015"},{"name":"English 1","block":"6","semester":"Fall2015"},{"name":"Expository Writing","block":"2","semester":"Fall2015"},{"name":"Shakespeare","block":"1","semester":"Fall2015"},{"name":"Shakespeare","block":"7","semester":"Fall2015"},{"name":"English 1","block":"4","semester":"Spring2016"},{"name":"Expository Writing","block":"1","semester":"Spring2016"},{"name":"Expository Writing","block":"7","semester":"Spring2016"},{"name":"Shakespeare","block":"3","semester":"Spring2016"},{"name":"Shakespeare","block":"5","semester":"Spring2016"},{"name":"English 1","block":"3","semester":"Fall2016"},{"name":"English 1","block":"7","semester":"Fall2016"},{"name":"Expository Writing","block":"1","semester":"Fall2016"},{"name":"Shakespeare","block":"4","semester":"Fall2016"},{"name":"Shakespeare","block":"6","semester":"Fall2016"},{"name":"English 2","block":"1","semester":"Spring2017"},{"name":"English 2","block":"5","semester":"Spring2017"},{"name":"Expository Writing","block":"6","semester":"Spring2017"},{"name":"English 2","block":"1","semester":"Fall2017"},{"name":"English 2","block":"5","semester":"Fall2017"},{"name":"Expository Writing","block":"2","semester":"Fall2017"},{"name":"Expository Writing","block":"6","semester":"Fall2017"},{"name":"Shakespeare","block":"4","semester":"Fall2017"},{"name":"English 2","block":"2","semester":"Spring2018"},{"name":"English 2","block":"4","semester":"Spring2018"},{"name":"Critical Writing","block":"5","semester":"Spring2018"},{"name":"Critical Writing","block":"7","semester":"Spring2018"},{"name":"Shakespeare","block":"1","semester":"Spring2018"},{"name":"English 1","block":"3","semester":"Fall2018"},{"name":"English 1","block":"7","semester":"Fall2018"},{"name":"English 2","block":"4","semester":"Fall2018"},{"name":"Critical Writing","block":"1","semester":"Fall2018"},{"name":"Critical Writing","block":"5","semester":"Fall2018"},{"name":"English 1","block":"3","semester":"Spring2019"},{"name":"English 1","block":"7","semester":"Spring2019"},{"name":"English 2","block":"4","semester":"Spring2019"},{"name":"Critical Writing","block":"1","semester":"Spring2019"},{"name":"Critical Writing","block":"5","semester":"Spring2019"},{"name":"Critical Writing","block":"3","semester":"Fall2019"},{"name":"Critical Writing","block":"5","semester":"Fall2019"},{"name":"English 1","block":"1","semester":"Fall2019"},{"name":"English 1","block":"7","semester":"Fall2019"},{"name":"Shakespeare","block":"6","semester":"Fall2019"},{"name":"English 1","block":"1","semester":"Spring2020"},{"name":"Shakespeare","block":"2","semester":"Spring2020"},{"name":"Critical Writing","block":"3","semester":"Spring2020"},{"name":"Shakespeare","block":"5","semester":"Spring2020"},{"name":"English 1","block":"7","semester":"Spring2020"},{"name":"Critical Writing","block":"3","semester":"Fall2020"},{"name":"Critical Writing","block":"7","semester":"Fall2020"},{"name":"Shakespeare","block":"1","semester":"Fall2020"},{"name":"Shakespeare","block":"5","semester":"Fall2020"},{"name":"Critical Writing","block":"3","semester":"Spring2021"},{"name":"Critical Writing","block":"7","semester":"Spring2021"},{"name":"Shakespeare","block":"1","semester":"Spring2021"},{"name":"Shakespeare","block":"5","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-31T08:35:35.900Z","text":"When I’m in his class I don’t feel motivated to do work. All we do is read books and class is very boring ","rating":2,"version":0},{"timestamp":"2020-05-05T23:49:47.464Z","text":"Otherwise known as \"The Republican\", he's the nicest person unless you start talking about politics. Then he'll rant about how NPR is fake news and similar topics for at least 15 minutes. Otherwise, great guy, and brings you bagels once a month if you're in his class. Had him for reg. ","rating":4,"version":0},{"timestamp":"2020-05-04T21:02:04.361Z","text":"he doesn’t make you do that much work all you do is read books in class 90% of the time easy grader but personally he doesn’t  prepare  you that much because he’s worried that we are overwhelmed  with all of the homework in other classes ","rating":4,"version":0},{"timestamp":"2020-05-04T19:35:14.126Z","text":"Wants you to put in the effort for a good grade, even if your writing isn't the best. Focuses on strategies to improve essay-writing. Look forward to the occasional story and essay. Will help you via. appointment during free blocks or after school.","rating":4,"version":0},{"timestamp":"2020-05-03T17:48:11.832Z","text":"Hereford is definitely an easy teacher and grader but don't be fooled, he will tear your writing into pieces and he makes you a better writer. Plus free bagels","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you can, get him. He's hella good.1. Before we get the test, he makes sure to outline all the details first.2. He's just awesome.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"doesn't rage when the class is too loud. he's very nice and buys the whole class bagels whenever he gets his paycheck. he makes the class really fun and you also learn at the same time","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome teacher! Must take for everyone attending Lowell.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is one of the best English teachers in this school. Mr. Hereford is passionate and cares about you getting better. He brings positive vibes to the classroom and also food! I don’t know what the people below are talking about. I haven’t heard him talk about his “strong political views.”Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"While Mr. Hereford may not teach using the same method as other teachers, he is still able to educate his students effectively. He's willing to share experiences, whether they are extremely personal or just humorous, so that we can easily make connections with vocabulary words. While he doesn't give out a lot of assignment, thus making ur grade a heavily dependent on these, he understands that we're not all writing the same, and grades us fairly. I am lucky to call him my Freshman teacher.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford has an extremely unique and fun way of teaching, such as.. posters, mini plays(Romeo and Juliet), etc.Not to mention, he is extremely enthusiastic! I LOVE YOU. OMG. ASDAHSLKDFJGDG;S.Don't leave us!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's chill, great story teller. Once he tried to explain irony to my class by mentioning a whole story about this war hero returning home and dies by hitting his head on the sink at home. Great guy, big heart, :) Not very strict about homework, his priority is that he wants you to get the work done. If i had been first pick in arena, i'd rush to his table. YOU CAN RELY ON HIM FOR EVERYTHING! (including a helping hand for hard times.) He treats each person uniquely. :D BAGELSSSSSS","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford is simply amazing. He teaches beyond good and it's very easy to understand. He will give you as much time as you need to finish an essay/project and he doesn't mind if you turn your work in late. It's very hard not to get an A in his class. He literally cares about his students more tha","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford is one of the sweetest teachers I've ever had. He cares so much for his students. He is known for his bagel days (which are great) as well as how much time he spends outside of school to help his current and former students with essay and recommendations. I feel like my writing style and technique has improved since I first entered his class. Only down side to his class is how often he brings up his political view in such an intense way and sometimes it comes off as insensitive.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best English teacher EVER. Nuff said. Zxxvvbngdsrhgsetgdfgytsaweyhhjlkhgdxvhgdryhjhftujgruhdruhdgijgf","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best english teacher I ever had. He is a really nice person, and can teach as well. Always tells us funny stories about his life, very helpful when you don't get something. It's impossible to get a B in his class. He gave everyone an A","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford is a great guy, but he really lacks in his teaching. He forgot to teach us parts of his curriculum, then gets mad at us for not knowing it. He spends whole periods just talking about things not related to the class. He can't even accept climate change is real. He even deleted my other comment which had a lot more and was so much more polite.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford is not only a great teacher, but a great mentor to all of his students. he inspires you very much, and he really does care about all of his students very much.. MUCH LOVE MR. HEREFORD!!!!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford is one of very few republicans I absolutely love... he is the most genuine, helpful, and kind teacher at Lowell. His assignments aren't there to give you a grade or score, they're there to help you improve your writing. I HOPE YOU READ THIS AND BREAK DOWN IN TEARS, MR. HEREFORD! I love this dude. He cares about every single one of his students and never forgets to mention that everyday. Take him if you can!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I was gonna give a negative comment so nobody would pick him for arena, but I have a heart. Today he gave us all See's lollipops. Expect to get an A, even if you punch him in the face everyday and tell him you hate him. Which you probably wouldn't do.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Just simply the best English teacher ever. No mandatory assignments, projects, or homework given and tells the greatest stories of all times.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Truly care about all of his kids. He is, however, very right wing and may try to influence his kids beliefs, though he will truly respect their opinion. Animated and interesting.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford is great for people who like english, and enjoy writing A LOT. The essays he assigns take a long time, and sometimes there can be up to three drafts plus an outline. Pretty much if you show up and do all your work, you get an A. If your missing a couple of assignments and didn't do well","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Hereford is a hands on, passionate teacher. I had him as a teacher in Everett middle school 1992-1995And then i went to John O'Connell high school 1995-1999. Of all of my teachers. He made me challenge myself to do better . I loved him he always took time before and after school to mentor you and explain things. ....-Anthony Arevalo","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i envy all who shall have this man for the semesters to come, I do, i really really do....... -____-","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He focuses on writing, instead of quizzing your reading comprehension (like dr. yuan). so he's great. You don't have to read a chapter everyday. I'n fact, you don't really need to do anything for hw. You just focus on writing, and boy will it get good. His goal is to prepare you for personal statements. And Mr. Hereford is the reason why MANY people have made it into great colleges such as UC Berkeley and Stanford. He is an extremely good guy. He pulled $500 to pay for my tuition. he's greatSubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He definitely chooses favorites and those people will always get A's. If you are struggling with a paper, see him afterschool and you'll spend a couple hours going over it, but you will for sure get an A on it. Kind of boring class, he just rambles the whole period, but if you pay attention some things he says will make your writing better. Also bagel day every month.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Must take. Awesome and amazing","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Seriously, why the heck is this teacher still in the school? Sure, he's nice on the first impression and I've heard he gives out easy A's (which is the only reason why people take him.), but at least teach us some English. When he's on his bad side, just watch out for him. He's just a bad guy wearing a nice mask on his face.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HIS CLASS IS AWESOME. SO FUN. BUT ONE THING I DON'T LIKE, IS THAT HE WAS BEING COMPLAINED ABOUT GIVING TOO MANY A's SO HE SAID HE GAVE OUT B's AT RANDOM. AND THAT HAPPENED TO BE ME. I THINK THIS IS TOTALLY UNFAIR. MY FRIEND, WOULD DITCH HIS CLASS OFTEN, AND GOT AN A, WHILE I DID ALL OF HIS WORK, AND GOT A B+. I'M MAD.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He would not force you to do things, but he would say it in a way that is so nice that you would motivate yourself into doing it. I improved a lot in my writing after being in his class. He is so helpful and nice, one of the best teacher i have ever had in my life so far!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Everybody likes Mr. Hereford for his bagel days at the beginning of each month, which is pretty great, but that's about it. He rambles on and on during class and his method of teaching is acting out the Odyssey or Cyrano de Begerac. Don't get me wrong, he cares a lot about his students, but you learn nothing and your entire semester grade is probably going to be based on one paper, so if you screw up on the one assignment he gives you there's nothing you can do.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My favorite class ever.He cares a lot about his students cos we're the \"Best Kids in the World\".He rarely gives any homework they're mostly bigger projects like page-long paragraphs/essays but you have to do well because that's all he grades.He makes horrible jokes that you just have to laugh at,tells a lot of stories, swears quite frequently, sings you a HBD song and buys the entire class bagels on the first of every month.You will learn how to write like a pro TRUST.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a really great teacher. Cares about his students and improves on our writing skills!Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is like a mom, very caring. He will not only stay up until twelve to help you but give the whole class A's. TAKE HIM, BEST TEACHER EVER","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"YAYS He teaches a few important concepts such as the “power closer”, takes time to write helpful suggestions on your essay, gives you LOTS of time for essays, and deeply analyzes books you read. Very devoted to his students, especially those applying for college.NAYS Often rambles in class about off-topic subjects, doesn’t input many grades so be careful if you do badly on one paper, gets into arguments and petty at the ones he fights with, often saying hurtful thingsSubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford is one of the best English teachers at Lowell! He really knows his stuff. At the end of class he never forget to say his famous \"You're the best kids in the world!\" And he really does mean it when he says it. Of all the English teachers I've had in my life, he was the only one who actually opened my eyes to the love of English writing. I believe that through his storytelling, you forget that English is one of those dreaded classes like Math. I'll really miss him as my teacher =')","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The biggest-hearted teacher at Lowell, Mr. Hereford lives everyday with a smile on his face and one goal in mind, to give his students the best learning experience he possibly can. Mr. Hereford doesn't just teach you about school, he prepares you for the world, teaches you to live life to the fullest. One of my favorite quotes of his - \"Don't be the victim in life! Don't think about what life has done to you, but what you can do with life!\"","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford is by far the best teacher I've ever had. Not only does he genuinely care about his students, he knows his material. It doesn't seem like he's teaching, but you're unconsciously absorbing all the information. Super chill about students doing other hw in class, but encourages you not to.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Herford is the best English teacher i ever had. He doesn't give busy work and is very supportive and understanding. He tries to make everything in his class fun and always listens to and understands his students. He helps with problems and is generally willing to side with the student and forgiv","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford is great! He really cares about us and wants us to succeed. His grading is super easy, but he does assign a LOT of essays (little to no regular homework though). BUT, I feel like his class always turned into The David Hereford Show and we didn't do a ton of learning; we'd always get super off-track and have to listen to his ramblings about how great he is. If you can deal with that, I would really recommend him. And also, BAGEL DAY. What more can you say?Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford is one of the best teachers you'll find at Lowell. Not only does he enjoy teaching, he truly cares about his students. I was never a standout student to any of my teachers, but he makes a special effort to connect with everyone individually. He'll offer help to anyone who needs it. He gives his students bagels every month! The only thing is that he doesn't have a format for grading-last semester he gave out lower grades randomly because he was giving out too many As.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's an amazing teacher. He's really funny and nice and he is extremely dedicated to his job. He's easy, but i've actually learned some things and i look forward to going to english. TAKE HIM IF YOU CAN! you won't regret it. Easy A, super nice, really funny, and just a really good person.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you actually try to pay attention, you will get something out of his lectures. He truly is a teacher who cares about his students, and even if you disagree with his teaching methods or political associations, you'll still find him a great guy. If you're the person looking for a study hall/ phone period, this is also the place.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Incredible. He has the biggest heart. He's not like all those other phony teachers pretending to be good by giving you analyzing to do. He makes you understand and fully absorb english for what it is. He's super helpful and he's a lot more than bagels and fun. He does that because hes too nice and t","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford is actually the best english teacher there is, not only is he extremely knowledgeable, hes also a very good person. He buys his students bagels and cream cheese every paycheck he gets. He tells us personal stories, and makes sure that we know and understand that we are his treasures. He","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The most self-actualized person I have ever met. Definitely one of the best teachers at Lowell.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hereford is the best teacher ever. He teaches us through stories, jokes and sometimes, lectures. He doesn't give much homework, but he expects good work when there is. He really cares about the students and brings bagels every month for us. Try to get him at all costs. He is like a father to students and really prepares you for life. He would stay up to 4 AM to help some seniors on their personal statements and would do anything to help you. Though he sounds easy he actually teaches.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He knows what he's doing and has a great teaching style. He has such a big heart! However, I feel as if he's emotionally troubled. He'd tell his problems to his students, and they sometimes get realllllly weird.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Hereford is honestly the coolest teacher ever. You not only learn English but you also learn a lot about life as well. He's super funny and a genuinely nice man. Take him.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best teacher I've ever had in my life. Extremely nice and very sweet. Tells us we are the best students in the world. Has very nice things to say about everything. Spends his paycheck on bagels for the class.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don’t really need to say much... I mean he is awesome.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's an extremely easy teacher and he cares for his students a lot, but I'm pretty sure he gave everyone A's. The district will probably send him a note to give less A's and more B's, so I don't how that's going to work out later on.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE YOU MR HEREFORD","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great class, you get bagels every once in a while, and no matter what you do, you get a A- or higher.","rating":4.6,"version":1}],"rating":4.509090909090905}},"__N_SSG":true}