{"pageProps":{"teacher":{"name":"Elizabeth Statmore","departments":["Math"],"semesters":["Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Geometry","block":"2","semester":"Spring2015"},{"name":"Geometry","block":"6","semester":"Spring2015"},{"name":"Pre-Calculus","block":"5","semester":"Spring2015"},{"name":"Pre-Calculus","block":"7","semester":"Spring2015"},{"name":"Pre-Calculus","block":"1","semester":"Spring2015"},{"name":"Algebra 1","block":"2","semester":"Fall2015"},{"name":"Algebra 1","block":"6","semester":"Fall2015"},{"name":"Geometry","block":"1","semester":"Fall2015"},{"name":"Geometry","block":"5","semester":"Fall2015"},{"name":"Geometry","block":"7","semester":"Fall2015"},{"name":"Algebra 1","block":"2","semester":"Spring2016"},{"name":"Algebra 1","block":"6","semester":"Spring2016"},{"name":"Geometry","block":"1","semester":"Spring2016"},{"name":"Geometry","block":"5","semester":"Spring2016"},{"name":"Geometry","block":"7","semester":"Spring2016"},{"name":"Algebra 1","block":"1","semester":"Fall2016"},{"name":"Algebra 1","block":"7","semester":"Fall2016"},{"name":"Geometry","block":"2","semester":"Fall2016"},{"name":"Geometry","block":"4","semester":"Fall2016"},{"name":"Geometry","block":"6","semester":"Fall2016"},{"name":"Geometry","block":"2","semester":"Spring2017"},{"name":"Geometry","block":"4","semester":"Spring2017"},{"name":"Geometry","block":"6","semester":"Spring2017"},{"name":"Algebra 1","block":"2","semester":"Fall2017"},{"name":"Algebra 1","block":"6","semester":"Fall2017"},{"name":"Geometry","block":"1","semester":"Fall2017"},{"name":"Geometry","block":"5","semester":"Fall2017"},{"name":"Geometry","block":"7","semester":"Fall2017"},{"name":"Algebra 1","block":"2","semester":"Spring2018"},{"name":"Algebra 1","block":"6","semester":"Spring2018"},{"name":"Geometry","block":"1","semester":"Spring2018"},{"name":"Geometry","block":"5","semester":"Spring2018"},{"name":"Geometry","block":"7","semester":"Spring2018"},{"name":"Algebra 1","block":"2","semester":"Fall2018"},{"name":"Algebra 1","block":"6","semester":"Fall2018"},{"name":"Geometry","block":"1","semester":"Fall2018"},{"name":"Geometry","block":"5","semester":"Fall2018"},{"name":"Geometry","block":"7","semester":"Fall2018"},{"name":"Algebra 1","block":"2","semester":"Spring2019"},{"name":"Algebra 1","block":"6","semester":"Spring2019"},{"name":"Geometry","block":"1","semester":"Spring2019"},{"name":"Geometry","block":"5","semester":"Spring2019"},{"name":"Geometry","block":"7","semester":"Spring2019"},{"name":"Algebra 1","block":"2","semester":"Fall2019"},{"name":"Algebra 1","block":"6","semester":"Fall2019"},{"name":"Geometry","block":"1","semester":"Fall2019"},{"name":"Geometry","block":"3","semester":"Fall2019"},{"name":"Geometry","block":"7","semester":"Fall2019"},{"name":"Geometry","block":"1","semester":"Spring2020"},{"name":"Algebra 1","block":"2","semester":"Spring2020"},{"name":"Geometry","block":"3","semester":"Spring2020"},{"name":"Algebra 1","block":"6","semester":"Spring2020"},{"name":"Geometry","block":"7","semester":"Spring2020"},{"name":"Geometry","block":"1","semester":"Fall2020"},{"name":"Geometry","block":"3","semester":"Fall2020"},{"name":"Geometry","block":"7","semester":"Fall2020"},{"name":"Geometry","block":"1","semester":"Spring2021"},{"name":"Geometry","block":"3","semester":"Spring2021"},{"name":"Geometry","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-06T19:18:42.314Z","text":"Best math teacher I ever had. She's super nice and it's an easy A but you really learn a lot","rating":5,"version":0},{"timestamp":"2020-05-05T17:01:08.544Z","text":"she is the most friendly teacher I've had and she helps you when you don't understand. the only bad thing is that she spends a lot of time on homework discussions but you can work on other homework if you don't need help. I wish she taught algebra 2 so I can have her again.","rating":4,"version":0},{"timestamp":"2020-05-05T11:28:19.787Z","text":"Dr. Statmore, she was literally the nicest and easy going teacher! She’s so sweet and she gives a minimum of a page or two of homework. She moves quite fast. But the best part is if you follow her instructions, you’ll have an easy A for he semester.","rating":5,"version":0},{"timestamp":"2020-04-08T02:24:58.855Z","text":"i love dr s so much. she is the sweetest teacher ever. if you don't understand something its easy to go to her for help. very very chill class. you don't have to pay attention and you could still get an A. usually she starts class answering hw questions which is very helpful and then she moves onto a lesson. follow her study guide and you will get an a","rating":5,"version":0},{"timestamp":"2019-12-08T18:11:20.623Z","text":"SFUSD forced me to take geometry and her class is how I am able be productive instead of being forced to learn stuff I already know.","rating":5,"version":0},{"timestamp":"2019-09-21T04:55:56.194Z","text":"The kindest sweetest woman, will always help you and has unlimited patience. I’m a total dumbass at math but she helped me so much, never was condescending to me. LOVE YOU DR S","rating":5,"version":0},{"timestamp":"2019-09-21T04:47:07.201Z","text":"I learned a lot from her geometry class and her tests are very easy! You can basically choose how much you want to learn in her class because she will lecture but doesn’t really care if you listen. Her homework is consistent but she barely checks it so it is very much an easy but self-taught class. I love Dr. S because she will help you whenever you need help! ","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's nice (though cringy) but her class is fairly dull & defiantly lecture based and not very involved. i had trouble learning in her class. speed dating (one side moves & shares problem with other side) is literally the worst.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"literally never did homework but still got credit... and i somehow still learned and passed the final with an ASubmitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A. Good pace, lessons are all from textbook. Does group work often with whiteboards. Tries to be funny. Tests are average difficulty but she grades them very loosely. Would recommend, but if you want a challenge, take Mr. Evans.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Look, If you like learning via notes, she's one of the best teachers. I like that style, so it worked for me. Yes, you can cheat in her class, but that's all up to you. If you do, however, you are going to be so woefully unprepared for any higher level math classes.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"EASY A AND YOU GET THE INFORMATION CLEARLY but she is pretty boring and in a way treats you like a little kid. She was awesome, but when I took a different teacher; I didn't know anything. It was hard for me to keep an A in the other teacher class. Take her if you want an easy A, but if want to learn and do well in future classes, don't take her.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took Statmore for Alg 1 and I have no regrets, I used to struggle in math and I didn't begin to understand concepts until I actually went to her and asked questions. Her tests can be studied for by using the textbook and she always says what the test will be on so you have no excuses. Overall a really great teacher that knows her stuff, just pay attention, take notes, and do the homework. Many people use their phones or sleep in her class. If you are not good at math, she will build you up!Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"honestly, an easier teacher only goes so far. take more challenging teachers to prepare yourself for more advanced, upcoming classes.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ay this doesn't really apply to freshmen, but if you plan to take this teacher your first semester of sophomore year, BEWARE. Her class WILL fill up, and depending on your pick and scheduling conflicts, it is unlikely that you will get her two semesters in a row. Additionally, she does not prepare you for future geo classes, her lectures are dull, and even though she's nice and easy, I don't recommend her class because you don't learn anything.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is the best, and I promise you won't regret taking her. She gives very easy tests, and this is good for all the people that are nervous during tests. She might even let you have a note card with any information that you want if she fells like the class isn't ready for the test. she is a teacher that hates memorizing, so she won't make you memorize anything, which helped me a lot. you should definitely take her without a doubt, good luck!!Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a terrible teacher, she doesn't know what she's teaching sometimes and wastes her time in class trying to learn the material for herself.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Dr. S! She makes bad jokes which makes them funny, and when she teaches, you have to listen to get it. If you don't get it, there is A LOT of group work, so if you're not a fan of that, you might not like it. Tests are very rare(mostly group) and she collects hw every two weeks, so you have a lot of time. She answers questions mostly clear. She is just so chill, highly recommend.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Statmore is pretty easy. Her main teaching method is notes, if you like that kind of teaching style. HW is from the textbook and is pretty easy. I thought she was a little eccentric but thats just me.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Dr. S is one of the best and nicest math teachers at Lowell. Although her lecture note taking style may not be for everyone, she is very approachable and will tutor you afterschool if you need it. It's a really chill class even though geometry is kind of hard. Tests are not hard as she prepares you well for them. I think she runs out quickly in arena but take her if you can!Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I loveeeeee Dr. S!!! She is the most kindest, sweetest, and darlingest teacher at Lowell. She always helps students out. There is a lot of note taking, but its good because its all on her tests. So its easy to study from. I highly recommend her.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Super easy teacher for Algebra 1Only 15 questions or so on tests, homework very easy, material she teachers is really easy. Takes a lot of notes which is really boring in class.Easy ASubmitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great time to do ur homework for other classes and great for catching up on sleepSubmitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Dr S is great! Lots of group work and working on problems in class. The biggest issue I have is that when she writes, everything is covered by her hand until she stops writing. This has nothing to do with her as a teacher, however if you are impatient it is unbearably frustrating.Submitted by a student","rating":3.9,"version":1}],"rating":4.179166666666668}},"__N_SSG":true}