{"pageProps":{"teacher":{"name":"Erin Bird","departments":["Science"],"semesters":["Fall2014","Spring2015","Fall2015"],"classes":[{"name":"Biology","block":"2","semester":"Fall2014"},{"name":"Biology","block":"3","semester":"Fall2014"},{"name":"Biology","block":"5","semester":"Fall2014"},{"name":"Biology","block":"8","semester":"Fall2014"},{"name":"Environmental Science","block":"7","semester":"Fall2014"},{"name":"Biology","block":"2","semester":"Spring2015"},{"name":"Biology","block":"3","semester":"Spring2015"},{"name":"Biology","block":"5","semester":"Spring2015"},{"name":"Biology","block":"8","semester":"Spring2015"},{"name":"Environmental Science","block":"7","semester":"Spring2015"},{"name":"Biology","block":"2","semester":"Fall2015"},{"name":"Biology","block":"3","semester":"Fall2015"},{"name":"Biology","block":"6","semester":"Fall2015"},{"name":"Biology","block":"7","semester":"Fall2015"},{"name":"Biology","block":"8","semester":"Fall2015"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"This is her first year at Lowell, so she is still adjusting. For biology, She's toughened up a bit this second semester, but overall is still really easy. She is a decent teacher, mostly uses powerpoints and lots of labs. Homework every day, but it's not too difficult. Lots of tests, which are easy to ace if you study. If you do bad, she'll always give you the option to retake. But, she is the NICEST teacher I've had. Always happy, energetic, and sweet. Take her!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is nice, fun, interesting, easy, BUT i don't know why I couldn't just focus. Her teaching is ok-good, but im not sure if she was boring to make me not focus. Take her class, she's really good, but I think it's just me that's not feeling good about her class.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take Wenning if you want to get solid with regular Bio before going to AP Bio. For regular bio, she's super easy. Nothing special. Nice teacher.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I never thought that I could learn from a teacher that's easy. I have always thought that you couldn't learn anything from the easy teachers, but she proved me wrong. Through my experience, there has only two easy teachers that I really learned from, including Ms.Bird. Her homework packets to me are","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a great teacher, idk why people say that she isn't. Just because a teacher is easy, it doesn't necessarily mean that the teacher is bad. She really gets concepts into your head. You can tell that she is extremely passionate about biology. Take her if you want a teacher that is easy and teaches well at the same time. You will NOT regret taking her. Best science teacher I've ever had.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Bird is an easy teacher, but I learned a lot in her class. She's like the nicest teacher ever; she's twenty-something. Her homework isn't too hard, but I always spent a lot of time on them (I have a short attention span ;P). The activities/labs she has in class are really fun. She also really cares about her students. You should totally take her for Bio.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Bird is my favorite teacher at Lowell so far. She is very good at explaining, although you may need to ask questions for clarification. Homework is everyday, but it's interesting and somewhat easy to get through. Tests are mostly multiple choice, and quizzes are a bit of everything. Good thing to know: the homework she assigns is pretty much what you need to study for tests and stuff, along with notes you may take in class. Her is the reason I love science and am continuing to AP Bio.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really nice and understands that you are still adjusting to high school as a freshmen. Lots of labs and we go to the garden a lot. When we do have lectures, she draws pretty pictures with different colors on the board :) I only had her for first semester and I heaard she got really hard during 2nd semester but she had a lot of extra credit opportunities during the last two weeks of the semester to bring up your semester grade. And she had homework passes. And I ended up with an A in her class :)","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Please don't leave! We miss you! Come back next year! 😢😢😢😥😥😥😥Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Bird is a great teacher! She is super sweet, and knowledgable. We do a lot of labs, and spend a lot of time in the garden. Not a lot of homework, and her lectures are always short and clear. Her tests are multiple choice and very straight forward. I love her class and her! Highly recommended 1","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Bird is so awesome shes a really good teacger i understand most of everything she talks about shes cool.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Bird is really nice, but she is not a very good Bio teacher. She is way too easy; probably easier than my seventh grade biology teacher. You could get a A- without studying at all or paying attention in her class. You can't really blame her though, because she used to teach seventh grade. Good t","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Okay so i AGREE she is a very easy teacher but...... honestly i havnt really learned a whole lot....so go for Ms. Bird if you jkust want a easy class, just remeber you will get kinda get a lot of HW","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Bird is a nice, patient motherly figure that will pretty much hold your hand at Lowell. I recommend taking her for first semester of freshmen year for Bio, to get adjusted to Lowell but then taking someone else second semester if you actually want to LEARN biology. Tests not that hard, many activities and labs, has good intentions for her students. Wrote me a nice letter of rec...get on her good side, participate and you're good :)","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a great teacher. She knows her stuff and makes sure you learn the material as well from her. The only odd thing about her class is that even if you don't study for tests and quizzes, you can still get an A - she doesnt do any weights. But she's a very likable and nice, and a great science teac","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Bird is amazing! Take her! The best biology teacher you'll ever had. She's the sweetest, kindest person. You won't regret it.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I currently have Ms.Bird and she is amazing! :) She's passionate about science and always willing to clarify anything you don't understand :D","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Bird was the only teacher that I felt like I can relate to my first semester at Lowell. She's very nice, and always smiling. do her homework; ask questions when you dont understand; participate and you'll have a great time in her class. A lot of self study, her lectures are not very specific. Tes","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If there's an award for \"Perfect Teacher\", Ms. Bird fits that bill instantly. I've never had a teacher who was easy and yet taught so well - drills concepts into your head while making it fun and enjoyable. However, her class is a bit of self-teach - learn the concepts the night before and she'll reinforce them. I had her Fall 11, so Im not sure if she's changed, but her tests and quizzes are extremely easy - little to no studying required. Take her - easy A, if not B, and you learn a ton.","rating":4.3,"version":1}],"rating":4.299999999999999}},"__N_SSG":true}