{"pageProps":{"teacher":{"name":"Francisco Rosales","departments":["Math"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019"],"classes":[{"name":"Geometry","block":"3","semester":"Fall2014"},{"name":"Geometry","block":"7","semester":"Fall2014"},{"name":"Pre-Calculus","block":"2","semester":"Fall2014"},{"name":"Pre-Calculus","block":"4","semester":"Fall2014"},{"name":"Pre-Calculus","block":"8","semester":"Fall2014"},{"name":"Geometry","block":"3","semester":"Spring2015"},{"name":"Geometry","block":"5","semester":"Spring2015"},{"name":"Pre-Calculus","block":"2","semester":"Spring2015"},{"name":"Pre-Calculus","block":"4","semester":"Spring2015"},{"name":"Pre-Calculus","block":"8","semester":"Spring2015"},{"name":"Geometry","block":"3","semester":"Fall2015"},{"name":"Geometry","block":"7","semester":"Fall2015"},{"name":"Pre-Calculus","block":"2","semester":"Fall2015"},{"name":"Pre-Calculus","block":"4","semester":"Fall2015"},{"name":"Pre-Calculus","block":"8","semester":"Fall2015"},{"name":"Geometry","block":"3","semester":"Spring2016"},{"name":"Geometry","block":"5","semester":"Spring2016"},{"name":"Pre-Calculus","block":"2","semester":"Spring2016"},{"name":"Pre-Calculus","block":"4","semester":"Spring2016"},{"name":"Pre-Calculus","block":"8","semester":"Spring2016"},{"name":"Geometry","block":"3","semester":"Fall2016"},{"name":"Geometry","block":"5","semester":"Fall2016"},{"name":"Pre-Calculus","block":"2","semester":"Fall2016"},{"name":"Pre-Calculus","block":"4","semester":"Fall2016"},{"name":"Pre-Calculus","block":"8","semester":"Fall2016"},{"name":"Geometry","block":"3","semester":"Spring2017"},{"name":"Geometry","block":"5","semester":"Spring2017"},{"name":"Pre-Calculus","block":"2","semester":"Spring2017"},{"name":"Pre-Calculus","block":"4","semester":"Spring2017"},{"name":"Pre-Calculus","block":"8","semester":"Spring2017"},{"name":"Geometry","block":"3","semester":"Fall2017"},{"name":"Geometry","block":"5","semester":"Fall2017"},{"name":"Pre-Calculus","block":"2","semester":"Fall2017"},{"name":"Pre-Calculus","block":"4","semester":"Fall2017"},{"name":"Pre-Calculus","block":"8","semester":"Fall2017"},{"name":"Geometry","block":"2","semester":"Spring2018"},{"name":"Geometry","block":"4","semester":"Spring2018"},{"name":"Pre-Calculus","block":"3","semester":"Spring2018"},{"name":"Pre-Calculus","block":"5","semester":"Spring2018"},{"name":"Pre-Calculus","block":"7","semester":"Spring2018"},{"name":"Geometry","block":"2","semester":"Fall2018"},{"name":"Geometry","block":"4","semester":"Fall2018"},{"name":"Pre-Calculus","block":"3","semester":"Fall2018"},{"name":"Pre-Calculus","block":"5","semester":"Fall2018"},{"name":"Pre-Calculus","block":"7","semester":"Fall2018"},{"name":"Geometry","block":"2","semester":"Spring2019"},{"name":"Geometry","block":"4","semester":"Spring2019"},{"name":"Pre-Calculus","block":"3","semester":"Spring2019"},{"name":"Pre-Calculus","block":"5","semester":"Spring2019"},{"name":"Pre-Calculus","block":"7","semester":"Spring2019"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"he doesnt teach at all because he explains the examples in the book which we can do by ourselves. he also takes points off for random LITTLE mistakes. he is NOT helpful","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is not as bad as everyone thinks. I think he is really good since you get most of class time doing homework and he even gives you like 4-5 days for it. His test are based on memorization, he does the problem he puts on the test on the board so all you have to do is memorize it. and plus he is hella HILARIOUS!But if you're not good at self teaching yourself, this class wouldn't be good for you since he does't really teach. But overall, he's pretty chill! :)","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"don't take him if you haven't taken algebra the year before...take him only if you can learn from the book and can stand his attitude...heh.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His geometry class is ok. He doesn't teach well. Grading is mostly based on tests but you can get an extra 10% by doing the homework. He is really picky about how you do your work.U aren't allowed to use graph paper.Not sure how easy he is. I got an A the first semester but a C another time.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very easy teacher if you have learn alegbra in the 8th grade if not do not take him !","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Well my first grading period with him gave me a terrible first impression of him. I got a C in that class, because he didn't teach us anything about geometry. The second grading period, which just ended, I again got a C, but this time it was completely unfair. So when you take his exams, he adds a percent curve, such as 10% to the percent you got on the exam. Then you get what he calls a \"dime\" where if you turn in all your homework, you get 10%. When he collects homework, he collects it","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hella funny but doesnt teach well...he should be a comedian instead...","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He doesn't really teach, and it's true that his tests are strictly graded, but you get an extra 10% added to your grade if you turn in all the homework, and he tells you the EXACT questions that are on the tests. I got an A without really trying.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had the worst time with him. i loved math, until he came around.. hes impossible to work.. if you complete an answer a different method then how he taught you, you get knocked off points..","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice teaher but horrible and louzy.makes math so hard.need to explain every SINGLE step, if you dont put it the way he wants it YOU FAIL. its SAD when u KNOW the stuff but get a F","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His tests are super easy and he grades entirely on them. Homework is extra credit and he give you a few nights to do it. He also doesnt care if its right or wrong as long as you tried every problem. He is very unclear, so if youre bad at math he isnt a good teacher for you, but he tries to help y","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great guy to have a conversation with. can be a good teacher if he isnt distracted by other classroom happenings.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he tells more jokes than teaches. he tells you what is going to be on the tests and he adds 10% to your final grade of each report period if you do all of your homwork","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"if you pay attention in class, and follow the way he solves the problems you will actually understand the material. his 5 question tests can be hard, but if you take notes and do your homework youll turn out with a A or a B","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ugh... this dude is very questionable... Take him if you want an easy class. His tests are based off problems from the hw, but it's your job to study the hw. He gives a 13% curve usually but it VERY particular about the way you answer the test problems. Only take him if you HAVE TO.Submitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ok teacher as long as youu do the hwk and study problems on the hwk for the test, youll do fine in that class.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very cool guy, you can get an A if you study and learn on your own, test based on homework questions, but he doesnt explain them..","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"you get easy A once you truly understand what he wants to see on your test. most people don't get it, so they think it's hard, but it really isn't- just write EVERYTHING out on the test. don't be lazy","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Yes take him","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great guy. horrible teacher. outside of math he's pretty cool. but in class he wont explain anything, and if he does he just gets distracted and starts talking about the discovery channel. He tried to explain logarithms using cats. your whole grade is your tests. again, nice guy, bad teacher.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"eh, he's ok i guess. just learn the material ahead of time and you'll be fine. and be ahead of the class homewokr-wise. it helps loads","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Does not really teach, just gives you homework and tests. He also never really answers your questions. His main answer is I'M LOST","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His classes are very entertaining, but at the same time, he doesn't seem to take his job very seriously. You'll really need to work by yourself on this one.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You have to learn how to work with him. He will tell you exactly what's on his tests, but he grades very strictly. If you do all the homework, you get a 10% bonus on his tests.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Funny, but laughs won't get you a diploma. He teaches very little and leaves the rest up to the students.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Only take Rosales if you are willing to teach yourself the material. You can ask him for help individually, but the majority of class time is spent doing classwork/homework in table groups. The tests are EXACTLY like the homework. Keep in mind you'll only have 3-5 tests per semester (with the addition of homework as \"extra credit\") so you have to be very mindful of your grade. Overall, Rosales is a pretty chill guy so if you're looking for a low-stress class, consider taking Rosales.Submitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is so cool but he always play and don't really teach but let ppl out erly","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"wow... mr rosalesss has alot of comments.. hes actually a very nice guy. too bad he cant teach.. but alot of people said hes easy. some got Bs..i got a b.. just got to do all the homework and go over it because he uses homework problem for all his tests","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"way too much useless proving, he makes you prove every single step you do in you problems, but i did learn alot in his class. all problems on the test is from hw/examples, but i always do bad cuz i cant prove some of the stuff.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think that he is a cool person and everything, but his tests are simply ridiculous. His tests have a certain format that you must follow in order to get an A. The format itself is harder than the math on the test. He may or may not give you guys a retake test. (It really depends on how badly your class does.) I guess that is a good thing, but the test should not be so hard in the first place.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Rosales is actually one of the best teachers at Lowell High, and most kids don't take that for granted. He is a very smart and intelligent man if you actually talk to him, rather than complain about him. He will make sure that you understand the material, if you talk to him","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HElla EASYYY!!! and hella entertainging. Little workload, and hes not bad a of a teacher.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took Rosales for Precalc 2nd semester and had a good teacher first semester... not a good idea. You dont learn anything. He is a nice guy most of the time and his class can be funny and entertaining but the work, though it seems \"easy\", really isnt. While everything is memorization, he wants you to do everything EXACTLY the way he wants it, even when a lot of the time he doesnt explain what he wants. So youre bound to get a bad grade a lot of the time.Avoid his class at all costs!","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"well, he is entertaining but very unreasonable. doesnt quite teach you as well as the other teachers. His class is fun when u dont have to work (which is most of the time) Tests are literally your grade, but they are based on homework. (IMPORTANT)He doesn't get you ready for your next year of math.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's cool and funny, but doesn't teach so u pretty much hav to learn it yourself. He doesn't give much hw, usually only 2 assignments each week. The times he \"tries to teach\", TAKE NOTES and dont disturb him since he gets DISTRACTED very easily. The tests usually consist of 4 or 5 problems and are worth 5 pts. each. *Always write neatly and show every step on his tests or he will take off points* Ur grade is basically the two tests you did in the quarter and 10 pts ex. credit if u did all ur hw.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"truthfully, i didn't learn anything from him. luckily i already had algebra 1 (and partially algebra 2) in middle school. even though i was able to get an easy A, i walked into algebra 2 knowing nothing except what i learned back in middle school. however, he is open to making \"deals\" so you can usually pull off a good grade. for example if you fail one test, you can deal with him that if you get a grade higher than persay 80% he has to count the higher one twice and drop the F. only good part.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really on your neck type of guy. He's always fussy about the work and how he wants it to be done. His \"lectures\" are just him copying the book and rewriting it. But he lets you sleep in class, probably the most productive thing I have done in his class.Submitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy.... i dont know what people are talking about.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's SO funny and I don't care what people say, if you WANT to learn in Rosales and show that you put in effort, he will teach you, and teach you WELL. Plus, all his test questions are from the freaking homework!","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is a cool teacher i don't no how some of u ppl got b n c becasue he is the esayest etacher u would ever have","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Geometry - Rosales' class is mainly self-teach. He tells you to copy examples from the book, does not teach/lecture, and assigns homework while expecting you to fully understand the material. He goes over certain problems afterwards, though, it's really not much help. Gives extra credit/homework points for tests. Tests worth 100% of your grade, and the way he grades them is RIDICULOUS. Still possible to maintain a decent grade if you follow his \"EXZAKT\" directions. He's a good man. Bad teacher.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i wouldn't take him again but hes a great guy","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I graduated from lowell years ago. When I think back about my high school years, Mr. Rosales was the only math teacher I had that knew how to teach. Unfortunately he didn't teach geometry and precalculus. After taking other teacher I began to hate math. I miss Mr. Rosales!","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's actually a nice dude and sorta funny sometimes. However if you don't get the material, you really suggest that you should NOT take him. He usually makes everything really confusing.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice person but like everyone else said, cant teach at all. AT ALL!","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his tests are pretty hard, but that's fine, because HW IS A 20% BUMP!! do ALL your homework, fail your tests, and you will still get a B. his explainations are a little weird, but you can usually figure them out pretty easy. really fun guy, even though you don't always know what he's talking about.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't see why rosales has such a bad rep. His class is literally based off of memorizing examples, so the only excuse for people to not do well is to not spend time memorizing them. But if you're a person who only learns from lectures, this class is not the one for you. He's really helpful when you ask him questions, but otherwise you're on your own, and that's not necessarily a bad thing.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"So bad, I don't know how he became a teacher. Sure, his class SOUNDS easy but he's the Ms. Johnson for math. So picky about everything and takes off points for the littlest things. He doesn't even accept homework if it's not labeled exactly the way he wants and is always pulling kids out of class to talk. To pass you have to memorize, not learn. I've tried to purposefully injure myself just so I don't have to go to his class before. I doubt he'll accept that excuse though.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"everything ud want in a friend, none in a teacher.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"All he does during his class is talk about the next video game he is going to buy. Its fun to listen to his conversations. he doesn't teach though. If you already know algebra then I recommend you take him, because he never teaches so he's surprised when you actually know the subject.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i like him easy A funny guy but can't teach gotta teach urself","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't learn anything in his class because he's SUCH a good teacher. You should TOTALLY take Rosales because he's the BEST math teacher ever. He so good that he deserves the Best Teacher In the Nation Award. That's why I gave mostly one star because he's so good at teaching and this is totally not a negative review at all. But seriously though, write down and memorize the hw and lectures because his exams are based off of everything you've had for hw [guaranteed 100% if you do].","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"omfg guys. why are you complaining. he is such an easy teacher LOL. I got an A all three times in his class. Tests are based on homework. just redo the problems and you're set. The only thing i can see if you're not getting an A in his class is that you're not studying.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"dude this guy is awesome. the tests are the hw. if you understand your hw, you ace the tests. rosales is the best teacher ever. very nice guy. he'll be your friend.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A funny teacher, likes to joke around, but plays favorites, grades tests strictly, and has odd teaching methods. I remember in Geometry 1 that he attempted to explain a proof entirely in Spanish. That was completely pointless. His grade is based entirely on tests, with homework being try for EC.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He thinks he is a funny guy, and can sometimes be funny. Easy A in his class...all of his questions are from the homework. So if you understand the homework, you will get an A. He doesn't really teach and isn't very clear.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"what the hell are you people thinking. this man teaches well and you can get good grades easily unlike mr.costa's T chart proofs","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Probably the most frustrating thing is when you THINK you know all the stuff on the test, but you get something like 65%. The tests always use questions from the book, but are scored according to his opinion (or something.) Even though HW gives 10% extra grade on a test, he sometimes annulls it because it \"doesn't show enough effort.\" Meaning, you don't have to do it right, but to do it \"with effort.\" I think it's just easier to do it right. Sometimes, he gives retake tests, which helped me.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes funny but when it comes to teaching, he's not as clear as i'd like him to be.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is not a good teacher,he doesn't really explain to u.dropping a pencil on the floor would be considered disturbing him.hes not hard and kinda easy.dont take him if u wanna learn","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"frankly, you learn nothing in his class. he spends too much time cracking jokes and talking with the students than teaching. don't take him if you want to learn.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a great teacher! he always want u to learn..and he gives ppl chances to retake test if whole class fails...","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"this guy is so funny! study for the tests...study those tricky problems in the book he'll get u on those","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Well basically, if you're great in math, he should be really easy. If you're not, DON'T GET THIS TEACHER. He's kinda funny,but he's confusing.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Rosales is hella cool. All you got to do is memorize the problems he puts on the board and some of your homework.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"First semester Geo, I got a D, but I moved on anyway to Geo 2, in which I got an A. Take Rosales if: you will do all your homework, get to class on time everyday, get used to his test system, know when to speak [don't be interrupting], and smart. 80% of the problems on his tests he goes over in class; 95% of the problems on his tests are on the homework, which y'alls should do anyway [one letter grade up on tests if you do the hw]. And get him to like you. Duh. I did hella bad Geo1, and he still loved me.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Rosales is absurd. He grades based on four tests or so, each with about six questions on them. He takes points off for reasons like too much space between two numbers. Do not take.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's probably one of the funniest teachers i've ever met but he's not a real good teacher. you probably wil have to learn on your own a lot of times.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took him Pre-Calculus. One of the most unique learning experiences I've ever had.I failed to learn much from his class. One year later I realized the problem wasn't his teaching methods. The problem was my faulty approach to the tests and homework he assigned. Looking back, I can see the logic behind the mechanisms of his approach to teaching.With utmost sincerity, you are missing out if you have never been in one of his classes. Submitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't see why rosales is so hated. His tests is are based off examples, so you just have to spend time memorizing them. But if you're a person who only learns from lectures, this class is not the one for you. He's really helpful when you ask him questions, but otherwise you're on your own, and that's not necessarily a bad thing.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a cool person, but as a teacher, he's bleh. i had him for geo. if u can learn to do everything his way and learn by urself, u'll get an A. it's not impossible(i did it), but u have to be pretty bright in math. for the proofs, we had to show evry step, and since each ? is worth like 5pts, even 1 mistake will knock you down. i think 1/2 of my class got D's. b4 tests, he collects all hw, which is optional and adds 10pts to the test. he used to make long tests & we had to take them afterschool.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for a year in geo. He's really funny, and his class is really laid back. The grade is based entirely off of tests, but all the problems on the test are from homework. When Rosales lectures, he's a decent teacher. He's just picky about the tests. But as long as you do homework, it's an easy A","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his tests are extremely hard, but he's a cool guy. he once cut class for a day to line up for the ps3, then came back the next day complaining about how he didn't get one, so the test scheduled for that day was cancelled.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a good person. But not a good teacher. He just gives you homework, and tests you. And if the majority of the class fails the test(because he never lectures), he will feel guilty and lecture the class a little bit.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's easy if you've had him b4 and KNOW his grading system REALLY well. other than that, he sucks as a teacher cuz he really can't teach. he's especially horrible teaching GEOMETRY. You can know how to solve every single one of the problems on his tests, and still fail them simply cuz of little tiny unneccessary steps you forgot to write.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice but teaching-wise, he sucks. Always kicks people out of class for stupid reasons ( don't noe 1 person who didn't get kicked out atleast once), cant teach, tells corny jokes.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"you don't learn anything, but i got an easy A. also, funny.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I guess Lowell is where most of the BAD teachers go because this guy is just awful. I think he immigrated over here and slept with Ms. Hanson to get the job.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cannot teach, but very nice guy.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a friendly teacher but can't teach too well. i think i'm gonna fail geo.1 cuz of him!","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i think that this teacher is really cool he give u credit even when u do all the problem wrong as long as u do them.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"rosales is cool. it's best to do the homework because your test grade goes up 10%, but you dont even have to do the questions right, just show that you tried. when you ask him questions, make sure you are very specific. usually 5 questions on the test and most are on hw or he goes over it in class","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he cant teach","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes really goood","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hard, because he averages the tests, so its just straight up tests. The average of the quarters is a not very good representation of the grade you are going to get on the semester. I guess he tries to teach, like he stays after school and is open to questions.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a cool guy, not so great of a teacher. His stories are pretty amusing. I have him for Algebra, so it's not like I have to worry about him not teaching the material. Has a.....unique grading system. You get an extra 10 % on the tests if you do the homework. Overall he's alright. I guess it depends on which class you have him for.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Rosales no doubt has an unique personality. He's a cool person, but when it comes to teaching he's okay... his dime (10pt added to exam) is very helpful, because even though his exams are exactly from the book, it's not an absolute A/ good grade. Overall he's not so bad, he's a very cool person to t","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cool guy, really nice ... he just can't teach, which is exactly WHY so many people transfer out of his classes -_____-;;","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"this guy is the worst teacher ever... he messed up my gpa with his stupid grading system... each quarter theres 2 test.. test1+test2= ur grade.. and there so hard...he never has time to talk to you if u need help.. never explains how to do problems.. he just gives answers. i have him for algebra 1 right now and never take him!!! NEVER! no joke... about more then half my algebra 1 class is failing right now..","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Rosales has lots of rules about homework that have nothing to do with the content. If you can follow these rules, his class actually isn't that bad, but he tends to introduce these rules after you've lost points for not following them. Also, he wants students to call him either \"Master Chief Petty Officer Of The Universe Including Pluto\" or \"Rosales\", because he thinks \"Mr. Rosales\" is communist...Submitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really nice, next level comedian. Get use to his style and you'll breeze through his class.Submitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Rosales is a hard teacher to learn from. It's a fun class, and an easy A if you ask him questions about the stuff you don't understand and do well on the tests.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"certain animosity towards this guy..","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a very easy teacher if you just do the homework. He is a really nice guy, although he isn't a good teacher. I don't if it's just me but I find him very hard to understand, and I usually just try to teach myself the lessons and remember the answers to my homework to help myself during the test","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He doesn't really teach and he takes off so many points on random mistakes. However, if you learn to do things his way and if you can learn out of the book, he is pretty easy.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awful Pre-Calc teacher. Took him for two semesters. However, his tests are easy if you take the time to memorize examples. I got 100s a couple of times on tests and ended up with As both semesters. So, just put in the effort to study.","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he doesnt teach much, but hes funny. avoid being late to his class, and you might want to get a tutor if you want to learn anything.","rating":2.5,"version":1}],"rating":2.5}},"__N_SSG":true}