{"pageProps":{"teacher":{"name":"Geoffrey Gould","departments":["Science"],"semesters":["Spring2018"],"classes":[{"name":"Chemistry","block":"4","semester":"Spring2018"},{"name":"Chemistry","block":"5","semester":"Spring2018"},{"name":"Chemistry","block":"6","semester":"Spring2018"},{"name":"Physics","block":"1","semester":"Spring2018"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you know your group will be smart then take him because you have hella group quizzes. He purposely makes the test hard so he can curve it, but so many people cheat in his class (they even use their phones) so you probably won't get the curve. Mainly self-teach and he says some important stuff in his class but ugh the class atmosphere is depressing and self degradingSubmitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took Mr. Gould for Spring 2017 for Chemistry. His class is not that difficult - do the work and pay attention and you'll easily get an A. He was willing to help and gladly answered questions when I had them. For all the people who complained and whined about his class constantly yet cheating on quizzes and tests : Lowell is a college prep high school. If you expect to pass classes with A's without putting any effort, I honestly think you won't make it through college.Submitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Gould isn't a bad teacher, He just literally has nothing planned everyday. First you go home and learn everything in the textbook yourself, then you come to class and he doesn't teach from the first step. He skips somewhere in the middle of the problem and you have no clue what he's doing for the whole class. He does try to make class fun on days where he's not \"TEACHING\" but I can't have fun when I am borderline failing basic Chem. TL;DR Everything is self taught. Super hard to learnSubmitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took a risk with Staff when choosing my classes. I was optimistic about him in the beginning, but it slowly declined afterward. He doesn't have anything planned for the day, and when we don't have any questions about the homework, he thinks that he should give more the next day. We don't learn in class, we just self teach from the textbook. He does't explain anything, and he gives you barely anything to study with, especially when the tests are really hard. Be careful when choosing teachers.Submitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I used to like chem but Mr Gould makes it so much more painful than it has to be by literally teaching NOTHING everyday. You basically have to learn everything on your own which is hard enough if they didn't try to shove physics and algebra into chem. MR. GOULD PLEASE JUST TEACH SO WE DON'T HAVE TO SUFFERSubmitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"painful and boring. Mr.Gould is petty, irresponsible, lazy, generic, and messy. He became angry over a missing magnet and accused students. His demonstrations are scripted and repeated one the next day verbatim. He got the lectures online and didn't bother explaining the slides. He made us clean up after his previous classes' mess. All text book and no explaining. This teaching style might've cute it at your previous school but it doesn't work here. Social Darwinism, adapt quickly or get out.Submitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Doesn't teach in class, literally doesn't have a lesson plan prepared. Just assigns you to do work and then you just do it. We don't take notes in class and everything is based off the textbook but then shuns you when you don't understand something. You just self teach everything!Submitted by a student","rating":2.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a really funny teacher you don't learn much but its a chill class get on his good side first also his jokes are amazing don't forget \"Bob's your uncle\"Submitted by a student","rating":2.5,"version":1}],"rating":2.5}},"__N_SSG":true}