{"pageProps":{"teacher":{"name":"Gregory Collins","departments":["Foreign Language"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017"],"classes":[{"name":"Spanish 1","block":"1","semester":"Fall2014"},{"name":"Spanish 1","block":"2","semester":"Fall2014"},{"name":"Spanish 1","block":"4","semester":"Fall2014"},{"name":"Spanish 1","block":"6","semester":"Fall2014"},{"name":"Spanish 1","block":"7","semester":"Fall2014"},{"name":"Spanish 1","block":"1","semester":"Spring2015"},{"name":"Spanish 1","block":"2","semester":"Spring2015"},{"name":"Spanish 1","block":"4","semester":"Spring2015"},{"name":"Spanish 1","block":"6","semester":"Spring2015"},{"name":"Spanish 1","block":"7","semester":"Spring2015"},{"name":"Spanish 1","block":"1","semester":"Fall2015"},{"name":"Spanish 1","block":"2","semester":"Fall2015"},{"name":"Spanish 1","block":"4","semester":"Fall2015"},{"name":"Spanish 1","block":"6","semester":"Fall2015"},{"name":"Spanish 1","block":"7","semester":"Fall2015"},{"name":"Spanish 1","block":"1","semester":"Spring2016"},{"name":"Spanish 1","block":"2","semester":"Spring2016"},{"name":"Spanish 1","block":"4","semester":"Spring2016"},{"name":"Spanish 1","block":"6","semester":"Spring2016"},{"name":"Spanish 1","block":"7","semester":"Spring2016"},{"name":"Spanish 1","block":"1","semester":"Fall2016"},{"name":"Spanish 1","block":"2","semester":"Fall2016"},{"name":"Spanish 1","block":"4","semester":"Fall2016"},{"name":"Spanish 1","block":"5","semester":"Fall2016"},{"name":"Spanish 1","block":"7","semester":"Fall2016"},{"name":"Spanish 1","block":"1","semester":"Spring2017"},{"name":"Spanish 1","block":"2","semester":"Spring2017"},{"name":"Spanish 1","block":"4","semester":"Spring2017"},{"name":"Spanish 1","block":"5","semester":"Spring2017"},{"name":"Spanish 1","block":"7","semester":"Spring2017"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a very good teacher no doubt! He is very knowledgeable and explains Spanish soo thoroughly! He has a lot of patience and gives explanations of homework, etc.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great, easy going teacher for Spanish 1. Very welcoming classroom atmosphere. I learned enough to prepare for Spanish 2 and barely had any homework. Tests were based off the classwork/homework. Sucks that Mr. Collins has retired :(Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"too bad he's retiring... :(Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He treats you like kids sometimes, but he's a good teacher. He does not like people talking over him or being a distraction. He will get annoyed and it is very annoying. But, he's a good teacher overall.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You can learn from him. he explains topics well and if you're confused about something, ask him. his class does get out of control and he makes us do annoying things like using a sock puppet while reading dialogue. for first year spanish collins is definitely the best option","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Collins's activities are really helpful. He's super funny and makes wicked comebacks. Good teacher but shows a lot of random dancing videos that create awkwardness. I wish he taught Spanish 2!Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's okay. I had him for Spanish 1 and if you're a good test taker you're pretty much guaranteed an A in his class. He's really nice unless you do something dumb. You just have to become friends with him and figure out how to talk to him. If he knows and likes you he'll give you opportunities to bring your grade up. He's not the best teacher and you kinda have to figure stuff out yourself but he's easy if you understand how to work up your grades and get on his good side.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I just got Collins and he's a pretty chill teacher but the thing is, he doesn't teach. It's not that he cant teach, but he prefers for us to learn on our own. He gives us homework and expects us to learn how to do it by ourselves. It's so frustrating!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i wouldn't say he's the best teacher but he really helps you if you ask him questions","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Nice guy. Doesn't enjoy people talking over him, but won't get too mad. He's had a lot of experience teaching (at Burton) so he's pretty much ready for most challenges. Sometimes goes overboard teaching (acting out dialogues). Goes by mainly the book. Sometimes doesn't explain concepts that thorough","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Collins is a relatively nice person with some interesting techniques ranging from flyswatting and using sock puppets. His teaching techniques range from ineffective to very effective. He has been around so he has some \"interesting\" stories. His class is an easy B and after the second grading period, your grade isn't going to change.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a nice guy, it's just that the way he teaches isn't effective. You are given a textbook and told to look over it, to be tested the next day based on everything. You \"learn\" using a flyswatter and puppets. His exams should be easy if you are taking Spanish with another teacher, but it is hard to learn the language with his techniques. My daughter is new to the language and studies hard but still gets C's and D's.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you get him, expect to learn everything by yourself. He doesn't go over Spanish very much, he only corrects hw, makes you watch movies on Spanish culture, and makes you say Spanish dialogue in front of the class ( which most students dont even understand...)","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's had a lot of experience teaching and he's not bad of a teacher. i would love to take him again! And he seems to be the type of teacher that cares a lot about his students. That's a rare quality to find nowadays in most teachers.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a really nice teacher! He tries to help you whenever you need it, but because all the work he assigns is really easy, you probably wont need the help. His tests are all extremely easy, usually being multiple choice or fill in the blank type tests. Take him for spanish whenever you have the opt","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good teacher ok uh hes retiring now so i guess u cant choose him anoreSubmitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is the nicest teacher ever, the work is pretty easy and so are the test! take him he is the easites ever!! Watch movies mostly and a very nice person","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome teacher! I like how he is there to help and cares about his students, you don't find that much in Lowell teachers these days :p Takke emmm","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pretty good teacher.Submitted by a student","rating":3.8,"version":1}],"rating":3.7999999999999985}},"__N_SSG":true}