{"pageProps":{"teacher":{"name":"Heather Wade","departments":["English"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016"],"classes":[{"name":"English 1","block":"3","semester":"Fall2014"},{"name":"English 1","block":"4","semester":"Fall2014"},{"name":"English 1","block":"5","semester":"Fall2014"},{"name":"English 1","block":"4","semester":"Spring2015"},{"name":"English 1","block":"5","semester":"Spring2015"},{"name":"English 2","block":"4","semester":"Spring2015"},{"name":"English 1","block":"3","semester":"Fall2015"},{"name":"English 2","block":"4","semester":"Fall2015"},{"name":"English 2","block":"6","semester":"Fall2015"},{"name":"English 1","block":"4","semester":"Spring2016"},{"name":"English 2","block":"3","semester":"Spring2016"},{"name":"English 2","block":"5","semester":"Spring2016"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Wade's stories will move you to tears. Sadly she doesn't give enough time for her group projects but often gets lazy and cancels a lot of work which is good. A lot of reading and reading reflection though, which is a pain in the butt. Her tests are extremely easy though and she's nice if you're one of her favorites.Submitted by a student","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"horrible. Don't take her. Transfer out ASAP. Hard grader for stupid tasks and plays huge favoritism. All we have been doing are RRJS, discussion, And so forth. ALWAYS off topic. And her quizzes are always hard because she doesn't prepare u for it.Submitted by a student","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Wade is a great teacher, but she never makes the homework clear which was a big problem in my class for english 2. There aren't many tests, you mostly do book readings and summaries and stuff like that. We do have lots of parties though!!!","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Wade's \"class\" is completely irrelevant and I've never had so much fun learning about absolutely nothing. She is also obsessed with reading quasi religious and spiritual books and feels that she needs to talk about her contrived, pretentious, and juvenile ideology with her students and make those books the required reading (just search up \"the hero's journey\" and you'll see what I mean). Oh, and also if you take her class have fun reading \"literature\".Submitted by a student","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very lazy teacher, spends a lot of time bragging about herself. There were like 3 people in the class, including me, who raised their hands so she liked us and pretty much hated everyone else. A ton of favoritism and bias occurs but I was a beneficiary so I honestly didn't really care. You won't learn anything, but if she likes you then it doesn't really matter.Submitted by a student","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST TEACHER EVER!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"bad teacher, she plays favorates and the favs. get liked more, dont dissagree either.... she also is moody","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"This teacher is usually unclear about her grading procedures in class. Ms. Wade has an unorthodox method of grading papers. She tends to be in either a good mood or a bad mood, and does not just justify her actions with good reason. Also, she does not have a professional attitude toward her students","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She IS pretty biased with favorite students and whatnot. But if you're on her good side and stay cool it's not such a hard class. She often ends up postponing hw due dates and her tests and quizzes are pretty straightforward.","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She very moody. For some reason, she was mad at my class today, and gave us three consecutive pop quizzes. Get on her good side, participate A LOT and you'll be fine.","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Wade is super awesome! I don't know whatt u guys are talking about, but i have A's in her class! Just participate a lot and your good. xD I would definitely take her again if I could. :s","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is very nice and chill. She tells amazing stories and she is willing to lend out a helping hand whenever possible. She isn't a super easy teacher, but actually challenges her students, just remember your figurative language, keep up with your work, and just try your best and you'll do fine. Take her class, she is awesome!!!","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"First of all, she is a very nice teacher, as long as you do all your work and DO NOT argue with her. Her exams aren't extremely hard, but do require in-depth understanding. Miss. Wade is extremely helpful. If you ask her questions, she can bring many examples and outside references. Miss. Wade definitely knows her materials. In her class, expect to learn beyond what an ordinary English class will teach(vocab, essay, etc). It's the experiences and lifelong lessons that counts. :)","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy B, lots of participation will get you an A. she can be moody and isn't really clear about homework assignments. put forth some creative ideas and she'll like you.","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good English teacher compared to the others","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good luck with her mood swings. She gets off topic about her life and assigns RRJ (Reading Response Journals) that are pointless. She plays favorites and gives special attention to them. If you're quiet, she probably won't pay that much attention to you. So glad I don't have to take her again.","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"NOBODY gets As in her classes, do yourself a favor and take someone else. Mood swings. Doesn't teach book that well, expects students to know it without discussing. Just don't take her -.-","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Wade is super chill for Expo. If you can't get Lo, take her. She's not as easy as Lo, but she's super nice and caring and will help you improve your writing skills a ton!","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ughhh tooo much homework in first dayawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawaw","rating":3.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy B/A if you participate a lot amd do the hw","rating":3.1,"version":1}],"rating":3.100000000000001}},"__N_SSG":true}