{"pageProps":{"teacher":{"name":"Ian Knight","departments":["Math"],"semesters":["Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Algebra 1","block":"5","semester":"Spring2019"},{"name":"Algebra 1","block":"7","semester":"Spring2019"},{"name":"Algebra 2","block":"2","semester":"Spring2019"},{"name":"Algebra 2","block":"6","semester":"Spring2019"},{"name":"Algebra 2","block":"8","semester":"Spring2019"},{"name":"Algebra 1","block":"2","semester":"Fall2019"},{"name":"Algebra 1","block":"5","semester":"Fall2019"},{"name":"Algebra 2","block":"7","semester":"Fall2019"},{"name":"Algebra 2","block":"8","semester":"Fall2019"},{"name":"Algebra 2","block":"2","semester":"Spring2020"},{"name":"AVID 1","block":"3","semester":"Spring2020"},{"name":"Algebra 1","block":"5","semester":"Spring2020"},{"name":"Algebra 2","block":"7","semester":"Spring2020"},{"name":"Algebra 2","block":"8","semester":"Spring2020"},{"name":"Algebra 2","block":"2","semester":"Fall2020"},{"name":"Algebra 2","block":"4","semester":"Fall2020"},{"name":"AVID 2","block":"3","semester":"Fall2020"},{"name":"Algebra 2","block":"2","semester":"Spring2021"},{"name":"Algebra 2","block":"4","semester":"Spring2021"},{"name":"AVID 2","block":"3","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-07T00:32:49.363Z","text":"I love this class!! He has you try to figure out the concepts at the beginning, then he tells you how to do it step by step. He then spends a couple days giving you more practice. His grades are very much based on tests.","rating":5,"version":0},{"timestamp":"2020-05-06T23:32:32.420Z","text":"Someone should seriously forward this man's paycheck to Khan Academy. ","rating":1,"version":0},{"timestamp":"2020-05-06T17:20:20.384Z","text":"The daily routine in his class is to basically try to teach yourself (or rely on other students) while doing common core problems. If you aren’t familiar with the material or aren’t sitting with someone who is willing to teach you, then you’re probably screwed. He will sometimes hurriedly go through an explanation in the last 5 minutes, however I don’t feel that I learned anything from him. I will say he’s a really nice guy but if you aren’t good a math or aren’t already familiar with the material, don’t take him. ","rating":2,"version":0},{"timestamp":"2020-05-06T17:16:10.225Z","text":"This class was very unpleasant for me. There is a lot of common core technique where you are supposed to try and figure out how to do problems before they are taught to you. I didn't feel like I was getting any actual instruction, the entire class was exclusively peer conversation. If you happened to end up at a not-talkative table, you would not do well in that section. This is one of the many math classes at Lowell that teaches to the students who are already familiar with the material and relies on students to teach other students. Not only that but any instruction that we did receive was from Khan academy. I spent many hours studying and in office hours but I realized that there is no getting an A unless you already know enough to teach the class. For what it's worth he is a pretty nice guy and he is really good at math, he just isn't as good at teaching it to other people. ","rating":2,"version":0},{"timestamp":"2020-05-06T06:42:00.448Z","text":"his class is super chill tbh. he's a really nice teacher but tests can horribles since they determine your grade. he basically doesn't teach and you learn from the common core book. afterwards, he reviews and calls on a table to go over what they learned. homework is on khan academy.  if you're good at math, take him. if not, it is an easy B, hard A","rating":3,"version":0},{"timestamp":"2020-05-05T18:57:04.966Z","text":"if you focus classwork and his lessons then you'd be fine. his teaching style isn't the best, and he teaches from the common core book. if you do well on the tests then you're fine. the tests are fairly difficult though. he's a chill and nice teacher","rating":4,"version":0},{"timestamp":"2020-05-04T20:54:40.998Z","text":"he alright he give homework on khan academy impossible to get a C or lower in his class he is hella chill but pretty hard","rating":4,"version":0},{"timestamp":"2020-05-04T00:24:00.545Z","text":"He’s REALLY nice, but he doesn’t teach that well... most times I look to khan academy to teach me.","rating":3,"version":0},{"timestamp":"2019-12-10T18:53:35.476Z","text":"Hes ok but the problem is he prepares you for precalc and it's hard asf nice guy tho","rating":2,"version":0},{"timestamp":"2019-12-09T07:45:32.566Z","text":"Hard really hard but hes nice he teaches alg 2 like its pre calc basicially but he rlly prepares u ","rating":3,"version":0},{"timestamp":"2019-12-09T07:44:51.228Z","text":"Horrible so much hw\nI rlly just cant hes so hard and the tests are impossible easy B hard A","rating":1,"version":0}],"rating":2.727272727272727}},"__N_SSG":true}