{"pageProps":{"teacher":{"name":"Jason Tuason","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP United States History","block":"6","semester":"Fall2014"},{"name":"AP United States History","block":"8","semester":"Fall2014"},{"name":"World History","block":"2","semester":"Fall2014"},{"name":"World History","block":"4","semester":"Fall2014"},{"name":"AP United States History","block":"6","semester":"Spring2015"},{"name":"AP United States History","block":"8","semester":"Spring2015"},{"name":"World History","block":"2","semester":"Spring2015"},{"name":"World History","block":"4","semester":"Spring2015"},{"name":"World History","block":"2","semester":"Fall2015"},{"name":"World History","block":"4","semester":"Fall2015"},{"name":"AP United States History","block":"6","semester":"Fall2015"},{"name":"AP United States History","block":"8","semester":"Fall2015"},{"name":"World History","block":"2","semester":"Spring2016"},{"name":"World History","block":"4","semester":"Spring2016"},{"name":"AP United States History","block":"6","semester":"Spring2016"},{"name":"AP United States History","block":"8","semester":"Spring2016"},{"name":"World History","block":"2","semester":"Fall2016"},{"name":"World History","block":"4","semester":"Fall2016"},{"name":"AP United States History","block":"6","semester":"Fall2016"},{"name":"AP United States History","block":"8","semester":"Fall2016"},{"name":"World History","block":"2","semester":"Spring2017"},{"name":"World History","block":"4","semester":"Spring2017"},{"name":"World History","block":"8","semester":"Spring2017"},{"name":"AP United States History","block":"6","semester":"Spring2017"},{"name":"AP United States History","block":"2","semester":"Fall2017"},{"name":"AP United States History","block":"4","semester":"Fall2017"},{"name":"AP United States History","block":"6","semester":"Fall2017"},{"name":"AP United States History","block":"8","semester":"Fall2017"},{"name":"AP United States History","block":"2","semester":"Spring2018"},{"name":"AP United States History","block":"4","semester":"Spring2018"},{"name":"AP United States History","block":"6","semester":"Spring2018"},{"name":"AP United States History","block":"8","semester":"Spring2018"},{"name":"AP United States History","block":"2","semester":"Fall2018"},{"name":"AP United States History","block":"4","semester":"Fall2018"},{"name":"World History","block":"6","semester":"Fall2018"},{"name":"World History","block":"8","semester":"Fall2018"},{"name":"World History","block":"6","semester":"Spring2019"},{"name":"World History","block":"8","semester":"Spring2019"},{"name":"AP United States History","block":"2","semester":"Spring2019"},{"name":"AP United States History","block":"4","semester":"Spring2019"},{"name":"AP United States History","block":"2","semester":"Fall2019"},{"name":"AP United States History","block":"4","semester":"Fall2019"},{"name":"World History","block":"6","semester":"Fall2019"},{"name":"World History","block":"8","semester":"Fall2019"},{"name":"AP United States History","block":"2","semester":"Spring2020"},{"name":"AP United States History","block":"4","semester":"Spring2020"},{"name":"World History","block":"6","semester":"Spring2020"},{"name":"World History","block":"8","semester":"Spring2020"},{"name":"AP United States History","block":"5","semester":"Fall2020"},{"name":"AP United States History","block":"6","semester":"Fall2020"},{"name":"World History","block":"2","semester":"Fall2020"},{"name":"World History","block":"8","semester":"Fall2020"},{"name":"AP United States History","block":"5","semester":"Spring2021"},{"name":"AP United States History","block":"6","semester":"Spring2021"},{"name":"World History","block":"2","semester":"Spring2021"},{"name":"World History","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-18T04:40:42.520Z","text":"love love his class.  I have him for apush, and i've learned so much from him. you can tell he truly cares about his students even though he does sometimes roasts his students. \nhomework is usually just reading, and studying for saqs or test.\ndbqs make me cry but it is so worth taking his class. please take him if you can, you will not regret it. i already miss his class so much. ","rating":5,"version":0},{"timestamp":"2020-05-09T20:54:55.546Z","text":"BEST HISTORY TEACHER EVER!!! His class is an easy A, and he actually teaches. His lectures are interesting and engaging. He swears a lot and roasts kids which is really nice. Before a test, he gives you a study guide and gives you A WEEK IN CLASS to finish it. He even let us study 15 minutes right before the final. Highly recommend, teachers like these are hard to come by.","rating":5,"version":0},{"timestamp":"2020-05-07T06:58:08.300Z","text":"Had Tuason for modern world and taking apush with him fall 2020. Tuason has very straightforward lectures, he gives you SFI on his slides ,and causes and effects which is very helpful for note-taking. He can take a joke and occasionally throws shade at students playfully. Also he likes saying READING QUIZ when he walks in the room. Take Tuason for APUSH, he’s always the first apush teacher gone in arena.","rating":5,"version":0},{"timestamp":"2020-05-04T01:30:10.923Z","text":"I love Mr. Tuason. Didn't have him for Modern World but took APUSH this year with him. He's pretty chill as long as you actually take everything seriously as in notetaking and Homework. Even though I procrastinated all year and did poorly on a lot of tests, I still appreciated how he was always willing to help anyone out who had done poorly. Hope he's enjoying his corona break playing Animal Farm on Twitch. ","rating":5,"version":0},{"timestamp":"2020-05-02T21:53:59.902Z","text":"Hi Mr.Tuason if you're reading this I'm your biggest fan. Your class has taught me so much and i hope that in my Junior Year I can take APUSH with you:O. If you're an incoming 9th grader, Mr.Tuason is one of the best history teachers in Lowell, and the best I've ever had. He's a very cool guy, you can make jokes and talk trash with him, but be aware that he can get very, very mean if you're on his bad side. Overall I wish I can take MWH with you again, but there's always Junior year and APUSH ayeee!\n","rating":5,"version":0},{"timestamp":"2020-05-02T20:41:38.730Z","text":"Probably the most fun ive ever had in a class. He also made the class a ton easier because he thinks the new generations are all stupid, which he is not necessarily wrong about. The entire class had an A. I still learned a lot.  ","rating":5,"version":0},{"timestamp":"2020-04-16T23:37:17.150Z","text":"Don't listen to the person who said he assigns 2 hours of homework, they must be pretty stupid. I had his class last year and it was based around lectures and visual projects. His lectures were straight-forward, he even provides you with SFI. For homework, you just take notes on a chapter and have an open-note reading quiz on it. Will definitely be taking him for APUSH next year.","rating":5,"version":0},{"timestamp":"2020-03-04T08:04:08.950Z","text":"do NOT take him. His students cry and he assigns 2 hours of homework a day. Do yourself a favor and do NOT take his class. ","rating":5,"version":0},{"timestamp":"2019-12-07T05:58:41.239Z","text":"he is literally the best. he does not waster time, is very clear, and funny.\n","rating":5,"version":0},{"timestamp":"2019-12-03T21:15:10.943Z","text":"Best teacher. Doesn't waste time. Take at all costs","rating":5,"version":0},{"timestamp":"2019-11-14T03:04:10.382Z","text":"Have him for APUSH. This year you don't need to take notes on the text book, but every week these things called KBATs are due, which are basically summaries of the chapter. There's SAQs every Monday (Wednesdays after a Unit test). His lectures are very informative, and are easy to follow even though there's no bullets on his slides. He'll definitely help you after school if you need it too. The class is only hard if you procrastinate all the time (aka me), but if you have good time management you should be fine. Unrelated to the class itself but he's very sassy and everyone loves it.\nOverall a really smart guy and I recommend him!","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class is pretty hard but you'll get used to it eventually so you'll be fine as long as you don't procrastinate. Love his personality!! he likes to tease and roast his students a lot, he is really relatable, and has a great sense of humor and knowledge of memes (he also gives A LOT of extra credit opportunities so it's hard to actually fail his class tbh) I don't get why people hate his guts like damn he's human too but overall difficult class but great teacherSubmitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I hope Mr. Tuason stays at Lowell. He makes class fun and light, yet still challenging. He usually has competitions for each topic we learn that are super fun, like when we frosted cupcakes and he was able to relate it to the Civil War. Or when we played pictionary, made paper airplanes and footballs and related that to the Cold War. It was so epic! lol.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Likely one of the worst experiences I have had as a student. Extremely rude, does not care for his students success and is extremely unhelpful when it comes to exams and projects.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"All juniors, TAKE HIM FOR APUSH!!! He helps a lot with your questions and teaches very well. He can also talk with you one on one with any questions about tests or essays that you have. Not much homework. Around 10 minutes of trading every night. I got a 5 on the apush test because of him. Amazing teacher!Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tuason is the best combo for a teacher. He is challenging and will make you work and learn a lot. At the same time, it's easy to get a good grade because there are a lot of small reading quizzes and tons of extra credit opportunities. The one thing I struggle with is the unit exams. They are multiple choice, but get very specific and are tough to study for. Other than that, he is a great teacher. He is knowledgeable, strict, funny, and friendly.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tuason seemed really intimidating on the first day of school, but he's actually really funny. He makes you work and gives many extra credit opportunities, which means he doesn't round up for your final grade. If you get a 89.9% it's your loss for not doing the extra credit. He also does reading quizzes, which I suggest you take notes on the section assigned to you that night, since it's a pretty big chunk of your grade. Mr Tuason's class isn't a walk in the park, but it's definitely worth itSubmitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"take him if you dont like to fall asleep in class, very funny and entertaining, not your easy a but if u do the extra credit and study you should be fine. he is very good at explaining and you feel comfortable asking him questions","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Sorry but Mr. T belongs at Lowell High School now. He's awesome and knows what he's doing. Good thing Ms. Slavacek was and still away (not saying she's a bad teacher).","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tuason is probably one of the best history teachers at Lowell. He will get you a 5 on the APUSH AP exam. As a student who had him for Modern World and APUSH, I highly recommend him. Tests are harder than other teachers but they will prepare you for the AP exam. Homework is just reading notes, and he assigns a ton of extra credit. You aren't guaranteed an A though, that is solely dependent on how seriously you take his class.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tuason's class is definitely intense- there's a lot of work and the tests are fairly challenging. However, he prepares you really well for the AP test, probably even more than you need to know for a 5. Beneath his \"tough guy\" exterior, Mr. Tuason is super dedicated and cares about the success of his students. He put a lot of his own money and time into helping us learn and score well on the test.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tuason is such a cool Modern World teacher. The first couple months were really hard because he was preparing us for future AP classes we might take but then he cooled off. He doesnt assign too much homework and its often to finish what you didnt finish in class. His lectures are intense, but you le","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's pretty chill. Doesn't really assign homework but you still learn a lot from the things he does in class. Grades fair. Rubrics make it hard to get an A on papers and group projects, easy B tho.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His teaching techniques include: ppt lectures, videos, class games/activities, group/research/art projects, written tests (usually open notes), and now, unfortunately, textbook readings and a multi-choice final exam (some ppl complained). He is very open minded and teaches his students in many different perspectives that the textbook fails to do. His lectures are thorough, interesting, and memorable. Cool, fun guy until you get him pissed. Once you do, prepare for a Tuason Typhoon of HELL and HW","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Smart man. Got me a 5 on the APUSH exam. Barely any homework. A lot of extra credit. Easy A. If out get a lower grade, you have brain issuesSubmitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a great history teacher. I like how his teaching isn't mostly depended on lectures, but instead on activities. He's a very cool person to talk to. He rarely gives hw, and u barely read from the textbook. the only flaw i think was having students teach/ give lectures in class and then testing us","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tuason is an overall good teacher. Sometimes he can be intimidating and you don't know what will tick him off. He is pretty chill but there a A LOT of projects espesically pecha kucha presentations. Overall Good.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tuason is great! He has fun competitions and activities. His lectures can be a bit long and require tons of writing. He's huge on doing group projects and giving essays. Seems hard, but it's managable. Not an easy A. I'm so sad I can't take him next semester.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tuason seems quite strict at first but is actually really nice and funny. He incorporates a lot of fun elements into his class such as kickball, dressing up, debates, posters, timelines, interesting films, potlucks, newspapers etc. Basically, if you don't like projects, you wouldn't like his class. The reading every night and quizzes everyday may seem discouraging but since there are so many grades in your grade book, the little quizzes don't count as much and there is room for error.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"this teacher will prepare you for harder classes and you may have a bit of work but it is definately benefitial","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"FOLLOW HIS DIRECTIONS AND READ THE BOARD!!!He normally gives out open note quizzes but if the board says closed notes don't use your notes!!!!! You will be forced to write a four page, handwritten, single-spaced essay. He is HUGE on essays as punishment.He is mostly art projects but don't worry if","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tuason is an amazing teacher. I had him for wo rld history, I have learned so much. His projects are very creative and fun. You can get an A in his class if you absorb lectures well and read the textbook. His reading quizzes are also pretty easy if you study a little bit. His personality is very sassy, and he likes roasting students. His lectures are actually very interesting, and he is very knowledgeable of everything he teaches us. I would recommend him if you want to learnSubmitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. T is the best! the first month or 2 are really hard, but if you survive all the notetaking, DBQs, thesis, and essays then the rest of the semester seems easy. he grades pretty hard on essay tests, but i guess that's a good thing since he wants us to do better and not just pass us along.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tuason is an excellent teacher! I learned so much in his class. If you don't study or work hard, this class can be extremely difficult. However, Tuason is very helpful and there are a lot of opportunities for extra credit.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had for modern world. He explains everything pretty well in his lectures, but you have to take a lot of notes. Doesn't give many tests or homework. Most of your grade is group projects and essays. Offers extra credit if you teach the class for a day. He can get pretty mad sometimes, our class had to write an essay on academic honesty and integrity after he found out someone was giving away answers to quizzes. Highly recommend. It takes quite a bit of effort to get an A, but it is worth it.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His teaching style is very intense, but Mr. Tuason is very intelligent and can usually answer any questions you have about history off the top of his head. He claims he doesn't like kids, but he will provide support if you need it. All the memorization adds a lot of stress to students' lives though. I will say that when you're in his class you will learn no matter what and gain a solid understanding of whatever subject you are learning.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr. T last semester and it was an great experience. Yes, he is really hard on grading papers (his rubrics are very detailed and specific, just like he expects from your paper) and his lectures are pretty hardcore. But you do learn tons of info in his class that is not in the book. He gives a","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. T is alright. His lectures get pretty long sometimes, but its not too bad. He does give a lot of projects tho. I'm pretty sure that the person below was commenting on the timeline project (we did one for MoWo to). But the review below is wrong, Mr. T doesn't grade on the quality of the artwork, but he does grade on required number of images that have to be drawn. Jeopardy is actually based on his previous lectures so its only review of stuff we already covered.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My child has Mr. Tuason as an APUSH teacher and he got a 5 on the AP exam. Amazing teacher overall. Pick him if you have good picks.Submitted by a Parent","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. t!!! we found you! you need to come back to westmoor. this guy's awesome, best teacher ever. don't slack off tho or you'll be put on tsl","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"( For World History) He is a great lecture and i learned so much. But, his class is really hard. His test you need to study for really hard. He will help you with projects but it is still hard. But, you will learn a lot in his class. It was really cool at the end of the semester we talk about things going on in our world like global warmingSubmitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Mr. Tuason! He is amazing at teaching. I used to hate history but he made me start loving it lol. This is my second semester taking him and im really lucky to have been able to do so. He assings quite a few posters but theyre easyt to do and usually only worth like 5-10 points. Hes a really cool person to talk to. Take his class. Trust me, you wont regret it.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Most people think Mr. Tuason is easy because he doesn't give homework and their aren't many quizes or test but that doesn't mean his class is an easy A. He gives research projects and presentations. His extra credit isn't taht easy either, you actually have to do lots of work to get extra credit. He's really cool to talk to. If you ask him about his view on teaching, youll understand why his classes do lots of projects.Not an easy A because he grades tough but you should take him!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He seems very scary and mean at first but he's really not. Jokes around a lot and can be pretty funny. He's also really organized but takes forever to grade stuff. Reading notes suck bu his lectures are interesting. He's really good at making powerpoints and explaining things.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. T is one of the best teachers at Lowell. I learned a LOT, but he made me want to learn. Always a fun class. He is also very understanding and a really cool guy overall. With a bit of effort, you can easily get an A. Awesome class. Take him!!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"It's been three years since I've had Mr. Tuason as a history teacher, but he was one of the most inspiring teachers that I had. His lesson on the civil rights movement and peoples movements were the most memorable and I find myself seeing the connections that he introduced now that I'm more involved in the community. I hope he's still inspiring students with his explanation of the fist of solidarity. Keep fighting the good fight, Mr. Tuason!Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tuason is such a cool and awesome teacher. I learned so much in his class and rarely found myself bored. He can be pretty strict at times, but as long as you don't do anything that pisses him off, he is really awesome. Very low homework, many projects, and lots of fun.Also, he swears in class","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr.Tuason for modern world, which most ppl don't really get a choice on but if you have hi, just know you are one of the most lucky kids at the school. He is one of the most funny, kind and caring teachers I have had in my entire life.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"thanks for teaching me so much tuason. I learned so much that I bombed the AP test.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. T is a good history teacher. He makes us understand why things happened in history instead of just telling us what happened. He also gives us perspectives that arnt found in the book. There are a lot of projects (usually 1 for each topic) and have to do tons or research for those. He also has lots of activities that help us understand history. If you dont like doing creative projects, working in groups, or having fun in class, then dont sign up for Mr. T. Cool guy, grades hard.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is an amazing teacher. I mean, yes, he makes you do a million notes, and yes, he gives out a lot of pop quizzes, but he's really funny and he actually makes learning fun! He also uses PowerPoint very well, and prepares his ModWorld students for AP (gasp) classes even though he doesnt teach them.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good teacher. the lectures can get a bit boring at times, but he keeps things interesting with games here and there. the majority of your grade are based on group projects. quizes were easy but the final multiple choice tests were kind of hard. extra credit if you teach the class or do study guides.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. T is cool and nice but grades hard. He also gets VERY angry occasionaly. One time he heard that a few students had their notes out during a quiz while a sub was there (they thought it was open notes). He gave everyone 0/20 on the quiz, gave us a 4 page essay on honesty, forced us to outline ever","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"By far the best Modern World teacher out there. He is funny, teaches really well, and never makes a class boring. If you respect him, he respects you and your right to have a good time in his class. However, if you do not respect him, you are not going to have a good time in his class, and you are p","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hardest teacher I have ever had. I have had literal breakdowns because of the workload. Reading quizzes everyday he assigns you a section from the textbook, you better know ever damn date, name, and statistic in that section. Nonstop projects, a lot of them are in partners. When he's moody, he is not afraid to cuss you out so you really have no idea what will tick him off. However he does know his stuff very well and you really do learn a lot. Not an easy A but very possible. Lot of extra cred","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"has a lot of extra creditchangeable daily schedule, has a updating google doc on daily schedulekind of hard testsdo lecturesdo textbook note takingkind of chillPecha Kucha presentations","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great class, you learn a ton. It definitely takes some work but you will be rewarded, and we do cool projects and stuff. Watch out though because if he gets angry with one kid or a few he might take it out on the whole class, but he usually is really chill and funny.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tuason's class is definitely NOT easy! You don't have to read the textbook but his research projects are no joke. OMG they're so time consuming! DO NOT PROCRASTINATE in his class if you take him. Tuason also gets really angry sometimes and doesn't like people who come late to class. Not the easiest teacher, but you'll learn a lot in the lectures and projects. Avoid him if you want an easy A or don't want to do work.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tuason may be quite difficult with his exams, but he gives out a ton of extra-credit. I recommend him, unlike some of the people below.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"excellent, this guys awesome","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He was a great American Democracy teacher! After the first month of adjusting to Lowell, Mr. Tuason really picked it up. He showed interesting videos that connected with what we learned and gave projects. The presidential campaign project was my favorite! He had us create campaign posters, plan a fundraiser, and make tv commericals to either promote our candidate or do some mudslinging against an opponent. I loved how his projects let us use what we learned in such a creative outlet! Take him!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tuason is hard but it's all worth it for his sass. :)Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A very intimidating serious guy. Deep in the inside he's funny but his class is honestly challenging. Chill lectures but a fair amount of daily reading for homework and daily quizzes in modern world. His class is a great prep for AP World! If you have a chance, take him, he really prepares you for time management! Not an easy A but with all those extra credit, I brought up my C to an A within a grading period. A very awesome intellectual person!!!Submitted by a student","rating":4.4,"version":1}],"rating":4.504761904761906}},"__N_SSG":true}