{"pageProps":{"teacher":{"name":"Jennifer Moffitt","departments":["English"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP English Language and Composition","block":"2","semester":"Fall2014"},{"name":"AP English Language and Composition","block":"6","semester":"Fall2014"},{"name":"Expository Writing","block":"4","semester":"Fall2014"},{"name":"Expository Writing","block":"8","semester":"Fall2014"},{"name":"Journalism 1","block":"4","semester":"Fall2014"},{"name":"Journalism 1","block":"8","semester":"Fall2014"},{"name":"AP English Language and Composition","block":"2","semester":"Spring2015"},{"name":"AP English Language and Composition","block":"6","semester":"Spring2015"},{"name":"Literature and Philosophy: Ethics of Eating","block":"4","semester":"Spring2015"},{"name":"Literature and Philosophy: Ethics of Eating","block":"8","semester":"Spring2015"},{"name":"AP English Language and Composition","block":"2","semester":"Fall2015"},{"name":"AP English Language and Composition","block":"6","semester":"Fall2015"},{"name":"English 1","block":"3","semester":"Fall2015"},{"name":"English 1","block":"7","semester":"Fall2015"},{"name":"AP English Language and Composition","block":"2","semester":"Spring2016"},{"name":"AP English Language and Composition","block":"6","semester":"Spring2016"},{"name":"Literature and Philosophy: Ethics of Eating","block":"3","semester":"Spring2016"},{"name":"Literature and Philosophy: Ethics of Eating","block":"5","semester":"Spring2016"},{"name":"AP English Language and Composition","block":"5","semester":"Fall2017"},{"name":"AP English Language and Composition","block":"7","semester":"Fall2017"},{"name":"Literature and Psychology","block":"2","semester":"Fall2017"},{"name":"Literature and Psychology","block":"8","semester":"Fall2017"},{"name":"AP English Language and Composition","block":"5","semester":"Spring2018"},{"name":"AP English Language and Composition","block":"7","semester":"Spring2018"},{"name":"Literature and Philosophy: Ethics of Eating","block":"2","semester":"Spring2018"},{"name":"Literature and Philosophy: Ethics of Eating","block":"8","semester":"Spring2018"},{"name":"AP English Language and Composition","block":"2","semester":"Fall2018"},{"name":"AP English Language and Composition","block":"4","semester":"Fall2018"},{"name":"English 1","block":"6","semester":"Fall2018"},{"name":"English 1","block":"8","semester":"Fall2018"},{"name":"AP English Language and Composition","block":"2","semester":"Spring2019"},{"name":"AP English Language and Composition","block":"4","semester":"Spring2019"},{"name":"English 1","block":"6","semester":"Spring2019"},{"name":"English 1","block":"8","semester":"Spring2019"},{"name":"AP English Language and Composition","block":"4","semester":"Fall2019"},{"name":"AP English Language and Composition","block":"6","semester":"Fall2019"},{"name":"Literature and Psychology","block":"2","semester":"Fall2019"},{"name":"Literature and Psychology","block":"8","semester":"Fall2019"},{"name":"AP English Language and Composition","block":"3","semester":"Spring2020"},{"name":"AP English Language and Composition","block":"5","semester":"Spring2020"},{"name":"American Literature","block":"6","semester":"Spring2020"},{"name":"American Literature","block":"8","semester":"Spring2020"},{"name":"AP English Language and Composition","block":"3","semester":"Fall2020"},{"name":"AP English Language and Composition","block":"6","semester":"Fall2020"},{"name":"American Literature","block":"2","semester":"Fall2020"},{"name":"American Literature","block":"8","semester":"Fall2020"},{"name":"AP English Language and Composition","block":"3","semester":"Spring2021"},{"name":"AP English Language and Composition","block":"6","semester":"Spring2021"},{"name":"Literature and Philosophy: Ethics of Eating","block":"2","semester":"Spring2021"},{"name":"Literature and Philosophy: Ethics of Eating","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-05T16:26:37.643Z","text":"Ms. Moffitt is the absolute best! Have her for AP Eng/Lang Comp and she's taught me so much! Please for the love of god pay attention to your reading; you will be tested on that. I think it makes writing the essays easier. It's very very rare that she will give out a 100% on essay, the highest grade usually is a 95%.  Her class is mostly discussion based. Please don't slack on her essays, she grades pretty harshly. She's super nice if you go talk to her during office hours for essay suggestions, though. An \"A\" is attainable though, just be ready to put in work!","rating":5,"version":0},{"timestamp":"2020-05-05T08:30:05.062Z","text":"had her for english freshman year. i didn’t particularly like her class because it was difficult for me. she’s pretty strict with cellphones and homework. i did learn a lot of stuff from her, and her class definitely helped my writing skills. in the beginning of the year i was struggling but towards the end, i did pretty well in her class. she is a very harsh grader though. never gives out 100% for essays. the highest she’ll give you is like a 95%, and that’s if your essay is really good. once, she said that she will “obliterate” our essays... ","rating":4,"version":0},{"timestamp":"2020-05-05T07:56:33.726Z","text":"Ms. Moffitt is amazing. Yes, she is kinda hard. Do the reading every night, maybe take some notes, ask her advice on your essays and you'll do fine. She's also just a really cool person in general and her class is super fun. Highly recommend for AP Lang.","rating":5,"version":0},{"timestamp":"2019-12-01T04:54:00.108Z","text":"Had her for English 1 and she completely changed my opinion on English class. She made it super fun and interesting and even tho it isn't an \"easy A\" you learn a lot of valuable things. Take her!","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. moffitt tells it like it is, especially with essays. sure you may get Cs ( i don't), but keep on trying!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Moffitt is one of my favorite English teachers of all time. She's nice and understanding. Very cool. Lotsa variety in lectures and assignments.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"teacher who cares about her students and wants her students to succeed","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Moffitt! She's such an a amazing woman. Although she does grade essays really toughly, the class itself isn't a whole lot of work if you like to read. She's super understanding and chill, so I would definitely recommend taking her.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's a really good teacher. grading is kinda hard on essays, but she doesn't give too many bad grades in her AP classes. she teaches you how to write, and she expects a lot of effort, but rewards it well by teaching you writing skills you'll use for life and of course, the A","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Moffitt is the English department god. She is so knowledgeable, intelligent, helpful, and cool. She is my all time favorite teacher at Lowell throughout all four years. She will make your writing improve thousand folds or more.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Never had an English teacher that graded as hard as she does. That said, she also seems to listen the most to what you say and is very approachable. She returns essays within a reasonable amount of time and writes plenty of comments.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Moffit! I took her for Comedy and Satire, what a fun class! Participate a lot and she really listens to you. I respect her in grading essays because she really knows what she's taking about. She is always smiling and upbeat. We were seated in groups and it makes the class very fun.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Among the ranks of Hathwell, Canepa, Rogers, and Arber, Ms. Moffitt is one of the better english teachers at this school. It's possible to get an A in her class, if you work hard enough. There's regular work, which is a change for many of us in English H, but it really helps you stay on top of it. You learn a lot, and she helps you with everything. She had our junior class write out some of our college essays as an assignment (most useful assignment ever!)","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for journ2/adv, so ignore the easiness rating. She's awesome and has always been there when I needed help. She's also really good to talk to if you just have a problem you need advice for.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really fun and interesting class. Most of the time its a discussion. Really good teacher. She doesnt grade hard, easy B, But you have to work for the A. I have her for AP english and the class is bearable. i recomend her over Yuan. The best","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Moffitt is amazing. I had her for AP Lang, and she was a wonderful teacher. Discussions were lively, class was exciting. She made The Sound and the Fury bearable and understandable (which is a hard task if you've ever read it). The books we read were interesting, and the research paper we did at the end of the year on gender issues was super cool.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"fair grader, funny and easy-going!! class is not boring, she laughs along with you and seems to truly care","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"my friend thought she was hard but i found her easy. got mostly Bs on essays n hardly ever participated in class discussions (lots of those) but still got an A. nice, laid back, great AP english teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a very hard essay grader. however, she does point out one's mistakes and tries her best to help you learn. she's a really down to Earth person.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's an awesome person and her class is pretty laid back. she grades really hard though. i guess it depends on how you think. the essays i thought were my best, i got C+s and the ones i thought were my worst, i got Bs, so try your luck. she tries to help, but her reasoning isn't always there.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really really cool journalism teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love mrs.moffitt! i started honors english really badly with canepa and mitchell and it just sucked. like i hated english. i took her this year for ap english and shes turned my whole view around. she made me remember why i liked english and i actually got As on her essays, something i havent gotten since first semester freshman year, take her if you can, shes amazing.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"amazing, nice, laid-back, teacher who really helps you in your understanding of a book. i think she prepared us well for the APs, and she's such an amazing person to talk to. she's such a relief from all the other crap teaching in the english department","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have her for freshman English and she's still very difficult. At least it's just freshman year so settling with a B isn't too bad.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's an amazing person and the class itself is not that bad but I have her for ap eng and I would love it if she wasn't such a hard essay grader. Which isn't great since basically all of the grade is based on essays. I thought I was okay at eng but remember that AP Eng is for the intellectuals... I regret taking the class but I love Ms. MoffittSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Moffit is the coolest teacher at lowell, even tho she grades hard, she teaches and the easy hw points even everything out. she also makes class fun esp gothic lit","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome and really good teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"DO NOT SLACK OFF because that will kill you grade. She's reasonable, and she gives people what they deserve (so don't try to play games with your grade)","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"totally cool teacher, for both journ and english. not only does she teach, but shes an extremely nice person too, and can relate to you.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Com&Sat. I've been having 89. something for the past 2 quarters. I hope i can get an A-. She's not that hard. She grades essays hard though, but I may just be bad at english. She's nice and helpful. Gives reading quizzes almost everyday. Explains material well and is a fun class. Take her!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is the best. I took her for expo/ journ1 and she is super helpful by leaving a ton of comments and she grades pretty fairly mostly everyone gets a B on the essays.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good teacher, just remeber to do your homework","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My favorite and best teacher. Hard A, but I had so much fun - really got into the material. My writing improved so much. She's the reason why I wanna teach in the future - she challenges (tough essay-grader) and inspires you and is so knowledgeable.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"okay Ms. Moffitt definitely doesn't play favorites (to whoever said that down there). she's an amazing teacher; she really improved my writing and you also learn A TON. i love her!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a tough grader sometimes but she's really good. Wants people to do their best, always willing to proofread essays and things for other classes; class is laid back and she is nice.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's really cool. I didn't try as hard as I could have so I got a B, but if you put in the effort you could get an A. Try to participate! And if you go ask how to improve your writing, she will be very helpful and understanding.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mrs. Moffitt is an awesome teacher and awesome person. I really learned a ton under her, and my writing improved loads. Was also the most fun i've ever had in an english class. Everyone should take her once before they graduate.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP. I love Ms. Moffitt. Her classes were fun and you learn a lot. Lets you eat in class. Actually pays attention to what students say, even when its a bit of a reach. One of the coolest English teachers Lowell.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Moffit is really nice and cool, but she is also extremely hard","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's laid back, and she's nice. but that's about all she is. she's not even easy. you have to work for you B, and there's so much homework. you reflect (write) on your nightly reading assignments, and you are NOT prepared for the AP. take her if you're an english genius, but not if you need to improve your skills before the AP exam","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"So Ms. Moffitt is recomended over Dr. Yuan . The class is barable , however i dont recomend that you take her if you have alot of other AP's or honor classes. Easy B , but have to work hard for the A.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I've had her for journ and AP English. She's easily one of the best (and nicest) teachers — and is not biased. She'll listen to you and always has explanations about yr. grade. She's not an easy A, but the class is well worth your time and actually prepares you for the AP test.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Moff is so cool. She's really honest and down-to-earth. Really nice and understands students","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's overall a really good teacher. She really helps you improve your essays, and is mainly focused on essays. she is never really mean and is super nice and laid back","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP 75. Pretty relaxed and interesting class. She's one of those teachers that knows a fair bit about life without imposing it on you. Kind of like a university student, down-to-earth and direct. Reasonable essay grader, but not easy. Fun to talk to.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great and energetic but super hard!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's a very cool teacher and does a lot to help us! but i dunno...she's a pretty hard grader...especially on essays...prolly coz of the whole journalism thing.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Moffitt has been, and probably will be, one of my favorite english teachers of all time. She's so smart, so it really pays off to listen to class discussions. for AP 75 (the heroine class) we wrote one or two essays for each book that we read, didn't spend much time on summer reading, and learned about rhetorical essays. The workload is extremely reasonable for an AP class, and there were some weeks when we had no homework. She does grade essays difficultly, so you have to work hard on them!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's really nice and her AP class is super chill. She's a pretty hard grader on essays, but she'll help you out if you want her to edit it and add suggestions beforehand. It's an easy B, but you have to work for the A.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Moffitt is awesome, but you do have to work hard. She grades pretty fairly, but her class is so interesting and you never wonder like when is it going to end. It doesn't really feel like a class, you're just talking about the book. But you definitely can't slack off, cuz that's.. bad, and then you'll get in trouble, haha","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Smart, irreverant, skilled. Her english classes are good fun, and she expects relatively solid writing. She writes good comments, grades fairly and trys to help. If you are interested in Journalism - she will be your friend, but again, wants things done well.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a really really hard grader, she gives tons of homework and plays favorites.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Moff is the best. she tries hard to get you to improve your writing, and she's very helpful as a teacher. she's really cool and laid back, and she's very laid back. she's also brilliant, and knows a lot about english. she has helpful lectures, but she's kinda hard in her grading","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Moffitt is an amazing English teacher and an awesome person. I had her for AP 75/77, and she was really helpful and supportive. You can talk to her about anything, and she'll work with you. She's one of those rare Lowell teachers that treats students like real people. It's difficult to get an A, but participating in class helps, as does seeing her individually for help on essays. I LOVE MS. MOFFITT!!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She wants you to succeed, and will help you any way she can. She can grade tough, but that's because she wants you to know how to write well. Take her!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is hella hard. If u want an easy class to take for english don't take her.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Having her for a year in AP Eng was a joy. She is chill, ENTHUSIASTIC, and understanding. Class is fun and beneficial; pay attention to rhetorical analysis and you'll do well on the AP. she gives reading assignments and essays for hw. expects effort but ask her for help on essays. she grades fairly.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms.moffits pretty cool. Shes easy going and very nice, but shes kind of a hard grader, so you cant really slack off in her class unless your a really good writer or something. But shes a really cool person to talk to - i would reccomnd her because she teaches well too.","rating":4.7,"version":1}],"rating":4.703448275862065}},"__N_SSG":true}