{"pageProps":{"teacher":{"name":"Jeremy Gribler","departments":["Math"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Calculus AB","block":"4","semester":"Fall2014"},{"name":"AP Calculus AB","block":"6","semester":"Fall2014"},{"name":"AP Calculus AB","block":"8","semester":"Fall2014"},{"name":"Pre-Calculus Honors","block":"2","semester":"Fall2014"},{"name":"AP Calculus AB","block":"4","semester":"Spring2015"},{"name":"AP Calculus AB","block":"6","semester":"Spring2015"},{"name":"AP Calculus AB","block":"8","semester":"Spring2015"},{"name":"Pre-Calculus Honors","block":"2","semester":"Spring2015"},{"name":"AP Calculus AB","block":"4","semester":"Fall2015"},{"name":"AP Calculus AB","block":"6","semester":"Fall2015"},{"name":"AP Calculus AB","block":"8","semester":"Fall2015"},{"name":"Pre-Calculus Honors","block":"3","semester":"Fall2015"},{"name":"AP Calculus AB","block":"4","semester":"Spring2016"},{"name":"AP Calculus AB","block":"6","semester":"Spring2016"},{"name":"Pre-Calculus Honors","block":"3","semester":"Spring2016"},{"name":"Pre-Calculus Honors","block":"7","semester":"Spring2016"},{"name":"AP Calculus AB","block":"4","semester":"Fall2016"},{"name":"AP Calculus AB","block":"6","semester":"Fall2016"},{"name":"AP Calculus AB","block":"8","semester":"Fall2016"},{"name":"Pre-Calculus Honors","block":"3","semester":"Fall2016"},{"name":"AP Calculus AB","block":"4","semester":"Spring2017"},{"name":"AP Calculus AB","block":"6","semester":"Spring2017"},{"name":"Pre-Calculus","block":"8","semester":"Spring2017"},{"name":"Pre-Calculus Honors","block":"3","semester":"Spring2017"},{"name":"AP Calculus AB","block":"4","semester":"Fall2017"},{"name":"AP Calculus AB","block":"6","semester":"Fall2017"},{"name":"AP Calculus AB","block":"8","semester":"Fall2017"},{"name":"Pre-Calculus Honors","block":"3","semester":"Fall2017"},{"name":"Algebra 1","block":"2","semester":"Spring2018"},{"name":"Algebra 1","block":"4","semester":"Spring2018"},{"name":"Algebra 2","block":"1","semester":"Spring2018"},{"name":"Algebra 2","block":"3","semester":"Spring2018"},{"name":"Algebra 2","block":"7","semester":"Spring2018"},{"name":"AP Calculus AB","block":"4","semester":"Fall2018"},{"name":"AP Calculus AB","block":"6","semester":"Fall2018"},{"name":"Pre-Calculus Honors","block":"3","semester":"Fall2018"},{"name":"Pre-Calculus Honors","block":"7","semester":"Fall2018"},{"name":"AP Calculus AB","block":"4","semester":"Spring2019"},{"name":"AP Calculus AB","block":"6","semester":"Spring2019"},{"name":"Pre-Calculus Honors","block":"3","semester":"Spring2019"},{"name":"Pre-Calculus Honors","block":"7","semester":"Spring2019"},{"name":"AP Calculus AB","block":"4","semester":"Fall2019"},{"name":"AP Calculus AB","block":"5","semester":"Fall2019"},{"name":"AP Calculus AB","block":"6","semester":"Fall2019"},{"name":"AP Calculus AB","block":"7","semester":"Fall2019"},{"name":"AP Calculus AB","block":"4","semester":"Spring2020"},{"name":"AP Calculus AB","block":"5","semester":"Spring2020"},{"name":"AP Calculus AB","block":"6","semester":"Spring2020"},{"name":"AP Calculus AB","block":"7","semester":"Spring2020"},{"name":"AP Calculus AB","block":"4","semester":"Fall2020"},{"name":"AP Calculus AB","block":"5","semester":"Fall2020"},{"name":"Pre-Calculus Honors","block":"7","semester":"Fall2020"},{"name":"Pre-Calculus Honors","block":"8","semester":"Fall2020"},{"name":"AP Calculus AB","block":"4","semester":"Spring2021"},{"name":"AP Calculus AB","block":"5","semester":"Spring2021"},{"name":"Pre-Calculus Honors","block":"7","semester":"Spring2021"},{"name":"Pre-Calculus Honors","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-01T23:19:34.046Z","text":"Gribler also likes to randomly call on people to answer questions he writes on the board/in his notes. Try to save yourself by avoiding eye contact, don't sit in the front, or print out the notes he posts on synergy so you'll know the answers. \n-- Sincerely, a spooked senior","rating":3,"version":0},{"timestamp":"2020-05-01T23:16:40.114Z","text":"AP Calc AB was okay. I don't think you'll get much out of asking him questions. Rely on your self-study skills and friends to learn. Your class grade is basically 100% based on how well you'll do on the tests. You'll have around 6 tests per semester, but he drops your lowest one. It really depends on the difficulty of the tests though. Sometimes the test is way harder than what he assigns for homework, so you just hope the curve will save you. Other times, you'll do great if you understand how to do the homework. This is @ the seniors that don't feel like doing anything at all. I feel you, but you'll definitely have to work for the A in this class.","rating":3,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The reason why I survived his morning math class was because I had fun/interesting classmates. Otherwise, I would've passed out. He doesn't exactly teach; he's basically dictating the book to you and rewriting the lesson onto a transparency. He seems like a very dazed person, sometimes doesn't know what he's doing.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Gribler is great! He has a great personality, really tries to help and has great goodies for holidays! XD I think most people take him because his tests are actually quite tricky...you really do need to study to ace them.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr g is a great teacher. he will always help u to understand if u need help. hes understanding and relaxed. hw is everyday but its never too much just enough to help understand. he really cares and always is willing to help. hard A cuz the class in general is hard but easy B cuz of board credit. gr8!","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes okay. he makes u copy lots of stuff from the overhead and doesnt really go over it. as long as u do lots of class participation and study for tests u can prolli get an A","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I know, I know he can be boring at times, but if you know how to joke around with him he's got a pretty good sense of humor. I don't like his grading system to much, but I'll live with it. He's also nice and gives out candy and extra points pretty easily.However, too much with the book and too little with the explanation. He should go back to hiking or whatever he does or something.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Mr Gribler! I got an A easily. You need to pay attention in class and do your hw as best as you can, and if you dont get some, ask him. His tests are not hard if you study a little and understand the concepts.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If your not very good at math you shouldent take him because like everyone else said he doesent explain well and teaches out of the book. Watch out if u do have him because that 90% test grade is all that counts so ur grade is basically ur tests but he is a nice guy and is easy to get along with (sure loves that coffie) even if he does look like he just got out of bed.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he seems kind of nervous, and is not always clear. he never gets around to helping those who need it and he does not give out candy nemore!!","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"can't teach, falls asleep easy, i swear you can pull off listening to your ipod while he's talking. he tries tog et the quiet people to do baord work. never worked. yenoe what unless you can self teach get a tutor. grr be careful though he's a wayyy to ahrd of a grader","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Gribler is \"okay\" in teaching, but you may need to know the material to get an A in his class. It's hard to understand him sometimes though. But an easy grader, after all.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Goes by the book and if you don't understand, just ask. good teacher; assigns homework most nights. i had him for both semesters of geo","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hes the coolest teacher but the hardest and pretty easy read the book to get the a.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy teacher but gets boring.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i feel bad for mr. gribler cuz everyone complains about his class. sure, he's not too good at explaining things and runs by the book too much. i've had to teach myself everything cuz all he does is make you copy notes and he doesn't explain them. but really, i think he needs to be cut some slack cuz he's a nice guy (just not a great teacher). i hate to say this, but if you're not good at math or teaching yourself new math lessons, don't take his class. he's a nice grader so show him some love.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"you basically have to teach yourself since he reads everything off the book.. he's okay but you have to study on your own to do good on his tests","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Sure he gives candy, but he's so annoying. He spends all period to talk about some stupid problem. He has no common sense. Plus he can't grade. I can't believe he grades 90% on test and 10% on homework/participation. I mean cut us some slack. Usually if we bomb one test we can make it up through homework and participation. I suggest gribler to be the last teacher on the list.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes ok he uses the same notes year after year, and sometimes he doesnt even know what hes talking about he's willing to help you if you need help and his tests are okay as long as you study. i'll say easy B, but you'll have to work harder for an A. tests: 80% class participation and homework: 20%","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MR GRIBLER! Sure, he gets confused sometimes and kind of mixed up, but he really does want you to learn. He'll be more than willing to stay just to tutor you! Great teacher. Super fun and the class is pretty easy too.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"boring...","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For second-to-last pick in Adv. Alg 2, I thought he would be much worse. He's got a great personality outside of class and an less-than-boring sense of humour and was always willing to explain hard concepts in and out of class. My advice: ALWAYS do your homework. And participate! Easy B, work for A.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"dont take mr gribler. hes impossible to get an A, barely a B. the tests count 80% so if u do bad its impossible to raise ur grade. board credits dont even help!!!hard to understand wat he talkin bout. even if u do the HW it really dont help ur grade! aargh.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very average. his accent is awesome though. just do your work and don't be noisy and it's an easy A.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. g is cool. he really actually wants u 2 learn. if u need help he'll explain stuff. tests are extremely hard n impossible 2 get A, but dere is partial cred. do HW and go up 2 da board a lot and u'll do good. seriously board credits :)","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great person and willing to help but he tends to go way fast so u need to keep up. u have to do homeworks. the tests are not that bad if u study from ur book, notes,hw and pay attention when students ask how to do a problem cause that problem may appear in test= strugglin with b+/a- borderline =)","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. gribler is an okay teacher. follows out of the book a little too much. gives me the feeling that im not really learning anything. if youre not too good in math already dont go to his class cause its a low chance that he'll help you out. =/","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a good teacher for adv alg 2. adv alg is pretty easy to begin with. in my opinion, it's easier than adv alg 1. he's really nice! and gives out food during holidays! even though there is hw every day, he doesn't give too many problems! and only gives odds! unfortunately, he's not always very clear. but the book can clarify everything since it's not hard to begin with.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The Kingdom of Gribler is currently under the protection of the valued Neighbourhood Watch. They have devised a constitution to abide by, which is regularly updated to reflect the needs of the subjects. Among decrees such as the Knocking Down Amendment and the Unbreakable Law, the minorities will always have priority.Submitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool teacher, but his lectures are very very very boring... and he takes notes off the book so u dunt really learn from him, juss the book","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Gribler's class is...fine. But everyday you pretty much do the same exact thing - go over homework on the dry erase board, copy the notes from the overhead, do classroom exercises, and then start on homework. He tends to pick favorites sometimes too, but overall he is a nice teacher.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"unorganized. sometimes it seems hes unsure of what hes talking about. the book is your best friend. memorize and study hard from the book on your tests. it will help you LOTS. its pretty hard to get an A..","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy class, but i fell asleep while he was talking. Not the most exciting fellow.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes a nice teacher. as long as you study for the testes, you'll get and A. not very good at teaching or explaining. always with the book. you get a D on your test, you get a D in your report card. i usually good with math...until now","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I can say that this class is... aight. He tries to not give too much HW, and it's not much of your grade, but his test would be eaiser if he explained more.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's easy. He's very nice and you can ask for help though quite boring and absentminded at times.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a real nice guy if you are respectful. Dont show up late...do not cut tests because he will go and ask your other teachers. Overall advice though...do not take him whatsoever. If you have...you'd better go to your counselor and beg to be switched out. You wont learn anything!!! I have yet to learn anything in that class and the final is tomorrow.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he really can't teach. you're kind of on your own to do good and he doesn't expalin well","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's cool with tests, give you credit even if you don't finish sometimes. He explains well and teaches out of book with his own notes.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Boring but he's new at it and always really try to be fair by listening to students.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is Nice guy but his tests are hard. He had to change his grading system because of me and now it seems much easier. His tests are extreemly hard but it is easy to get an A he trys to explain everything well","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a very nice person, and his tests are very reasonable--do the hw and you'll get an A on them. Boring, but hey what math teacher isn't..","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's hella cool even though it's an hard a pay attention in class u will do good. Study for his tests which means read the book, because he can explain stuff pretty well","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Gribler's a pretty good teacher... he makes some stupid mistakes sometimes, but his class isn't too hard. just study for the trests!","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's pretty funny but he really has a hard time teaching anyone anything and he does talk a lot and try to explain things if you ask questions but he takes everything out of the book so look at the next chapter your doing and ask him what you dont undertand and he looks like hes going to the cornerstore at 11 at night and doesnt look ready to teach and he sure loves his coffffffeee","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Gribler is a nice teacher. It's easy to get points back for test especially if you're on borderline grades. Easy B, hard A. He teaches pretty okay, if you don't get something, just ask him.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr gribler is ok. he makes us copy things tha we already have in the book. i guess hes pretty nice cuz he gives out candy sometimes.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy ok class. but gets really boring easily","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Gribler is one of the most reasonable teachers in the world -- generous, too. He does get confused sometimes, but he enjoys joking around (to an extent), and he's really understanding and helpful. Homework's not that bad, and tests are reasonably challenging. DEFINITELY pay attention in class.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Gribler is one of the nicest teachers I've had and has an awesome British accent. He really tries to help his students do well in his class. He's a humorous guy and often jokes in class. Towards the end of the semester, he bought us a lot cookies and treats. His wife would make cupcakes for all his students on Halloween (and they're delicious!). Gives birthday gifts to students. His tests does make you think but they aren't hard as long as you do and understand your hw.Submitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Uses homework problems for the test, so be sure to do it! Sometimes he also does random homework checks; make sure to have something that vaguely looks like calculus. At the beginning of the year, he offers to give you a copy of the solution manual PDF. I tuned out during his lectures, but he calls on people randomly to answer questions. Nice man, but I thought the textbook was more helpful.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Gribler is pretty good. Better than most of the teachers teaching. He's nice and he has a British accent. All my friends always make fun of his accent in front of his face. So yeah, he's pretty good, you learn if you try to pay attention, but if u get distracted easily, then u have to learn by yourself, but you get plenty of time to learn the material, so don't trip. Peace!","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he goes very slowly so you can understand everything,he's really nice!","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he gives out candy! teachers straight from the book. his tests are pretty easy, just make sure you learn the material even if it's not from him","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"precal H. always gives you time in class to do homework. he's a nice teacher but doesn't explain well.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really nice guy, pretty good teacher. no worse than any of the others, i can assure you! get board credits and do your homework, and you'll be just fine. tests are pretty hard, though; i never do very well. on the bright side, now participation in 10%, homework is 10%, and tests are 80%. so that's better than the old 90-10 deal, when it was 100% impossible to get an A. it's still pretty hard, though. and mr g. cares about teaching kids, so sure, take him!","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I really enjoyed his class. THe tests are sometimes hard but if you study it's no biggy. He's suuper nice and says funny things cuz of his accent","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I never thought this class would be n e good, but it turned out great! Compared to all the stories I hear from about the other teachers he was great","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's not that hard if you really study and understand what the test is on. He can be boring sometimes, but you better not sleep during class because he'll yell at you. He gives homework everyday besides test days though. And if you need help, he'll be willing to help you understand it.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Gribler's really nice...and kind of the oblivious type. Take him if you can self-study and would want to do homework in class, because honestly, I never understood what he was trying to teach on the board. If he suddenly calls on you to answer his question and you weren't paying attention, just start squinting and say you can't see. LOL, my friend did this every time.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool dude, teaches so-so, but if you ask him for help he's glad to explain until you do get it. i had him for geo, easy B, not so easy A. checks hw before every test. pretty chill. able to use a thats what she said joke on almost everything he says... funny guy","rating":3.4,"version":1}],"rating":3.386885245901643}},"__N_SSG":true}