{"pageProps":{"teacher":{"name":"John Worth","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Economics","block":"5","semester":"Fall2014"},{"name":"Economics","block":"7","semester":"Fall2014"},{"name":"United States History","block":"2","semester":"Fall2014"},{"name":"United States History","block":"3","semester":"Fall2014"},{"name":"Economics","block":"5","semester":"Spring2015"},{"name":"Economics","block":"7","semester":"Spring2015"},{"name":"United States History","block":"2","semester":"Spring2015"},{"name":"United States History","block":"3","semester":"Spring2015"},{"name":"American Democracy","block":"7","semester":"Fall2015"},{"name":"AP Government and Comparative Politics","block":"3","semester":"Fall2015"},{"name":"AP Government and Comparative Politics","block":"5","semester":"Fall2015"},{"name":"American Democracy","block":"7","semester":"Spring2016"},{"name":"AP Government and Comparative Politics","block":"3","semester":"Spring2016"},{"name":"AP Government and Comparative Politics","block":"5","semester":"Spring2016"},{"name":"United States History","block":"2","semester":"Fall2017"},{"name":"United States History","block":"4","semester":"Fall2017"},{"name":"American Democracy","block":"5","semester":"Fall2017"},{"name":"American Democracy","block":"7","semester":"Fall2017"},{"name":"United States History","block":"2","semester":"Spring2018"},{"name":"United States History","block":"4","semester":"Spring2018"},{"name":"American Democracy","block":"5","semester":"Spring2018"},{"name":"American Democracy","block":"7","semester":"Spring2018"},{"name":"American Democracy","block":"2","semester":"Fall2018"},{"name":"American Democracy","block":"4","semester":"Fall2018"},{"name":"United States History","block":"5","semester":"Fall2018"},{"name":"United States History","block":"7","semester":"Fall2018"},{"name":"American Democracy","block":"2","semester":"Spring2019"},{"name":"American Democracy","block":"4","semester":"Spring2019"},{"name":"United States History","block":"5","semester":"Spring2019"},{"name":"United States History","block":"7","semester":"Spring2019"},{"name":"American Democracy","block":"6","semester":"Fall2019"},{"name":"American Democracy","block":"7","semester":"Fall2019"},{"name":"Economics","block":"3","semester":"Fall2019"},{"name":"Economics","block":"5","semester":"Fall2019"},{"name":"Economics","block":"3","semester":"Spring2020"},{"name":"Economics","block":"5","semester":"Spring2020"},{"name":"American Democracy","block":"6","semester":"Spring2020"},{"name":"Economics","block":"7","semester":"Spring2020"},{"name":"AP Government and Comparative Politics","block":"2","semester":"Fall2020"},{"name":"AP Government and Comparative Politics","block":"3","semester":"Fall2020"},{"name":"AP Government and Comparative Politics","block":"8","semester":"Fall2020"},{"name":"Economics","block":"5","semester":"Fall2020"},{"name":"AP Government and Comparative Politics","block":"2","semester":"Spring2021"},{"name":"AP Government and Comparative Politics","block":"3","semester":"Spring2021"},{"name":"AP Government and Comparative Politics","block":"8","semester":"Spring2021"},{"name":"Economics","block":"5","semester":"Spring2021"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Worth is good teacher, but out of all my classes, this class took up the most time for homework. I feel that I could have had any other MW teacher and still learned the same amount without the heavy workload.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"my god, i cannot even begin to describe how great of a teacher he is. his class is awesome, but challenging. his homework is a tad tough to do, but that's because he wants you to REALLY think.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You should totally take him! Best history teacher ever!!!! His hw may be hard but if you make it detailed, peace of cake, you'll get the hang of it. Although his tests are fill in the blank it is not so hard since he gives you an outline to study from, and if you study from that you'll get an A on his tests no prob. You also really learn in his class since his lectures are engaging. TAKE HIM!!!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Do not take him for American Democracy unless you are planning to have an extreme workload for a non AP class. It has only been the first week and it has been completely miserable with a bunch of reading. There is a debate every friday, I don't know if he is serious but this is a High School senior class and not a Ivy League School class.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best teacher ever!!!!!!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I adore Mr.Worth for AP Euro. Great, interesting lectures, a compreshensive and convenient website, and just overall a very nice, helpful guy who wants you to succeed and understand. He DOES give work [it is an AP] but it is definitely a feasible amount. He tries to make things fun and innovative.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The best.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's an excellent teacher. His only flaw is giving too much hw.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Never had the pleasure of having him for a class. But he was the best reg teacher and club sponser . When he was new to Lowell, he gave us a home and fought for us no matter how small the issue.Thanku","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MOD HIST - Quite unfair with his grading because I was forced to do a report on Mexico that he mostly covered.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HE LETS US WATCH MOVIES!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ok, first, the \"everyone loves him\" statement is invalid, because I and most of students in his American Democracy class, absolutely do not love him. He does give a lot of work, and I think he's proud to be one of the those teachers gave students loads of work even though it's not an AP class. If you're a senior and wants to continue working hard, go take him. It still bewilders me why he assigns an economic project to a class that is suppose to learn about the US government and politics.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Isn't very open-minded about student opinions. This is important for a Social Studies course that is supposed to relate to the modern world.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of my favorite teachers. AP Euro was way cool.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Worth is a great teacher, his teaching are interesting. He will never make you fall in to sleep. But he gives quiz every Friday. That's why I give him a 4 for weasiness.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Glad he's back. Our kid (sophomore in college) adored him. Stimulating, gives lots of homework, energetic about his job and truly likes kids & enjoys teaching. Lowell is lucky to have him on faculty.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for American Democracy and though the workload was much like an AP class, I did learn a lot from him. Other than the book, he relies a lot on online sources, like videos and articles, which is really good because it relates to the current events. He gives outlines for tests, and as long as you pay attention and fill that out, then you're set. I'm glad I took him although it was because my arena got messed up and I got stuck with him haha.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for reg since freshman year. He's such a nice guy, and is truly interested in and cares about his students. He often asks his reg for advice on teaching methods, and wants feedback so that he can be a better teacher (although my friends have told me he already is a really good teacher). Most reg teachers just sit in the back of class on their phones, but Mr. Worth actually engages in conversations with students. Unlike what was said below, the entire reg definitely does not hate him.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"OMG I LOVE HIM SO MUCH!!! YOU HAVE TO TAKE HIM!!!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"not quite as good as granucci but pretty damn close. very energetic knows his material well. prepared us well for the AP","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome teacher!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. worth is really cool!! he's not a typical boring teacher. very liberal and open to new things. lectures are interesting. during class, take notes and participate. has long hw assignments, but it's an ap class after all. has essays, dbqs, and tests. extra credit boosts your grade. easy b if you do all your work, but an a requires a bit more effort. take his class anyway.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Difficult class, but worth it. His class is mainly lectures, but he makes them really entertaining. Mr Worth is really intelligent, and if you work hard, you will learn a lot.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Worth structures his class like a college class. He's hard, but if you put in the work, you'll be in good shape.Other teachers in the department don't like him because of his Ivy League background, since he thinks he's more educated and better refined than others; which in my honest opinion, may be true.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A good teacher, but you need to do your hw, tons of it","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"tons and tons of tedious hw which i never really tried to do well...tests are arrite...gets ya well prepared for the AP...fun class and a great teacher","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fun class and easy to follow fun lectures. Homework is a big part of your grade (40%), but he gives it in advance so you can plan when to do what. Easy tests (IMO), 1 project every marking period","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"super cool. makes LECTURES fun, too. always happy, smiling, etc. alot of work, but what do you expect? he teaches an AP class. you learn alot, but he doesnt put students to sleep. even his SYLLABUS is kinda funny if you like teacher-humor...","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His lectures are actually pretty interesting. He's not as good as Granucci, but he's good enough. You'd probably have to work pretty hard to get an A.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Sometimes lots of work, but a good teacher.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. worth was the best!Hard tests though, but if you listen to his lectures nd take notes, you'll do fine. really interesting in lectures!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best lectures. I did get a check for a grammar error.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His tests are NOT easy because most people kept getting C's. However, you can make up for it BIG time with doing well on homework. Make sure you detail your answers very well or else you can easily get a B on homework. Pay attention in class and take detailed notes and you'll be fine.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very nice, class is always fun, but theres a lot of hw and somewhat hard tests","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a cool teacher! he's a really pumped teacher so it's harder to fall asleep in his class. gives a lot of hw tho...","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher, i learned a lot. but his homework and projects are so annoying. bottom line procrastination=death. participation counts, if you're like talking you'll love him, if you don't avoid him.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Worth is in my opinion the best Mowo teacher. His homework is a bit detailed, but just put in the main ideas and you should be fine. He gives you an outline at around the start of every new section covered, and he goes over everything on the outline in class, and his weekly Friday quizzes are based on his outlines, so just pay attention in class and you''l do fine. Plus, he can be EXTREMELY funny, so if you thought history was boring (like i did at first), take him. You won't regret it. :D","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Worth gives lotsa work. 'Nuff said. He's an easy A, though. Incredibly easy tests.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is possibly the best history teacher i have ever had. he makes class fun and his lectures are clear and very helpful. he gives a lot of homework, but it really helps with the tests","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"modern world:love it! really fun class, always exciting and interesting activities. he is an interesting person, and REALLY teaches you A GINORMOUS AMOUNT. yes, hw is long, and tests are like over 100 blanks, +all require lots of thought. Definitely take him, only possible reason not to=hard grader.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Worth is a great history teacher! He really knows his stuff and he can answer almost every question you throw at him. I highly recommend you take him if you like history. Projects and homework may be slightly challenging but manageable.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Homework counts a lot, fill in the blank tests+ essays. Oral presentations. Very interesting, fun class!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He really cares about the subject he teaches. I took him for American Democracy and even though I wanted a class I could just breeze by in, he forced me to be interested in what we were learning. He doesn’t give a small amount of homework, but it isn’t hard work and he is a good teacher. He’s also really nice. One time he told me to sit up because he was worried about my posture. He was right too, I have bad posture. I didn’t fix it but it was nice of him to try.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Somewhat hard, but you will LOVE his class","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My only criticism is that he's TOO knowledgeable. Should be a college professor or somethingSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Worth is a good teacher and a good person. He teaches well (has experience in MW, AP Euro, Econ, and more) and is very interactive. He does give extra credit, but writing thought-out homework and putting a lot of effort into the projects can allow you to slack off on tests and do HW last-minute, yet still get an A. I would recommend you take him for any class if possible.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is absolutely great, this a teacher that always love to have a great laugh and the homework is simple, you think while carefully reading your assignment, then you have a great chance of succeeding. His tests are challenging but if you actually learn from his classes, then you'll do fine, even though you are one of those students that aren't that good at tests, then theres always an opportunity for improving, overall, Mr. Worth is one of the best teacher that you can learn from.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great Teacher, learn alot, but the homework load is huge. Many late nights finishing his essays, then spending the night right after working on a powerpoint. Too much work makes this class seem alot less deserible, although class time is enjoyable and fun, and usually really easy.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr worth is the best teacher ive had. Funny, engaging, thought provoking and overall awesome.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You learn a lot in his class. He has reasonable curves. If you want an A, you have to give it a lot of effort. If you Ace his homework, then that really boosts your grade, but it is hard to get an A.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He has to be one of the most AMAZING history teachers out there. He makes us laugh while teaching and relating to modern times. He has a bit of homework (some of them are longer than my essays!) but its okay.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. worth is so cool!! even though his class is super hard, he makes euro fun. his outlines help if you don't know how to spell a name and he pretty much follows that. he's a easy B, but you really gotta work if you want an A","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"participation is a big thing and can make or break you. his finals aren't that bad but his homework is annoying to do","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love social studies. I've taken AP history classes every chance I've gotten. Mr. Worth makes me wish I hadn't taken AP Gov. We don't learn anything. The class is unstructured. We are way behind and will be going into the AP unprepared. I don't mind working hard for my grades, but he doesn't make you. The class is way easy but with a lot of time wasting assignments. 30 pages articles only loosely related to the subject. Reading assignments ranging in length by up to 10 pages between nights. BadSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Worth is a good teacher and is very interactive but I think he should offer extra credit options.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr worth is totally awesome he's funny and chill. u hav to turn in hw every 2 days and it'll be probably 2 pages long and this sounds bad but it's not (im not those hard working ppl if ur wondering)","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a great teacher, but his homework can be overwhelming as well as the test. I learned a lot in his class.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The person below is totally lying...You don't get checks if you have grammar errors. Most people get check pluses. He's the best teacher ever, best at lowell at least. Lectures are funny and tests are so easy, curve is 10%. Extra credit movies and participation too.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his TAs grade soooo hard on the hw! it's kind of annoying how much effort you put into your hw and you get a check rather than a check plus just because of grammar errors. REALLY REALLY REALLY good teacher. tests = easy if you study. so nice! we get too off-track tho haha. projects are a killer. :o","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Worth was such a cool teacher. His lectures are interesting to listen to and he gives an outline to fill out during class so you know what you need to write down. His tests are fill-in-the-blank but if you really study you will ace it like me!!! But his homework will take you at least an hour an","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the BESTEST academic teacher ive ever had!!! he teaches really well and you learn stuff while having a fun time in class!! :) a lotta work, but definitely worth it. hes AWESOME","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i like. very funny and his lectures are interesting","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"lots of homework, none of it hard, but tedious and boring, lectures are interesting enough, he digresses a lot","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Do not take Mr. Worth for AP Gov. He is unprepared, unorganized, and confusing. He constantly goes off on tangents or rants and doesn't prepare his classes for the tests. In addition, Mr. Worth assignes ridiculous amounts of reading for his daily quizzes. It's easy to get an A, but not worth it for such a bad teacher.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I was so sad to hear Mr. Worth decided to quit teaching at Lowell. My kid really liked this teacher and learned a lot from him. He was stimulating and had lots of group projects, extra-credit.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A lot of work, but it isn't hard, and his lectures are good. You'll learn a lot if you pay attention. Also a really awesome guy outside of class. He just got married! Oh and he throws parties after AP exam for AP Euro.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"<3 :DDD you can eat in his class. his curves are usually about 10 points for a test. i'd say eaasy B, but hard A.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best Teacher I've Ever Had","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr. Worth for 1st-2nd semester MoWo. This is the best class I've had so far in Lowell. I learned a lot. Gives an outline first(to take notes keep track)before explaining the lesson. Has tests/quizzes almost every Friday, but it's not impossible to get an A as long as you study your outline or make a reviewer. Website=all the materials. Can watch movies on your own time for extra cred(3% per grading period). Really funny. Don't procrastinate! Take his class. It's really w o r t h it!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hes the best teacher ive ever had at lowell by far. if youre a good history student its an easy A and i guarantee that youll learn a ton. the only problem is that he gives a lot of homework and you have to put in many details to get an A. If you have a chance to take him i strongly recommend signing up for his class","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the besttt teacher ever! personally im a liberal person. and he is very liberal too. and tries to be fair. sometimes his tests can be very detailed but if you listen to his lectures carefully (which are never boring btw) then u'll do fine","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Worth is the best teacher I've had at Lowell in terms of amount learned... It's really a fun class... The homework is tough, but graded somewhat easily.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AMAZING!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a very lecturer. He throws in plenty of personal stories which are very entertaining. He is a fair grader, so you will not necissarily always get an A, but if you work hard, you will. His homework can take a very long time, but for AP Euro it is an amazing study tool.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fine for Modern World, but AP Gov is a different story. Class is too unstructured and always goes off track. Lots of unnecessary videos, activities, and assignments that offer no value to the course. Mr. Worth knows a lot and is very insightful, but he doesn't know how to teach an AP class. AP=college course, and in college there are no participation logs, and the professor is always in charge of leading the discussion. Mr. Worth wastes too much time going off topic with irrelevant discussions.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's funny and is really into history, so he makes his almost endless lectures interesting. There is hmk nad projects, but they're ok","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a really fun and great teacher! His lectures are full of information, so take notes major pronto. He gives out a bit of homework though (Terms and Documents) and you have a lot to read, especially if you're taking AP Euro, but he's willing to help if you need it. :]","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best teacher at Lowell, and great reg teacher too.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The best history teacher I have ever had fun, highly competent, and intelligent. Don't take his class if you don't want to learn; otherwise, you'll do well.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is the best teacher you'll ever have,there is some homework but it is totally worth it to take him!!!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have had him for a reg teacher for three years, and as a history teacher for almost every semester. GOOD STUFF.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his class is pretty hard. you actually gotta read the book to do the homework, and even then, he grades the homework tough. and his tests and projects are tough. but he's an awesome teacher. he's really cool and gets along with the students.overall, if you pay attention and actually try,itll be fine","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Liked his lectures and tries to keep you awake. The fill in the blank test can be pretty tricky but at least he curves. Wrote more essays for this class than my actual English class. Lots of homework (40% of your grade) .Finals 10%.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is the best teacher in the world!!!!!, oh yeah, and you'll love his laugh","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Kinda tough tests and h/w...but the nicest teacher you can get","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a great teacher with an easy, interesting, fun class","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's so LIVELY. I had him for AP Euro and loved it. All his lectures are interesting and he's a really smart person (went to Yale?). He teaches you so much it's crazy. A lot of work, but grades fairly. Odds are you will get a 5 on the AP. One of the best history teachers. DEFINITELY take for Euro.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"worst reg teacher ever, its not that serious. you should not mark your students tardy even though they are here and come in a little later. Reg is one of those times where we want to relax and chill for 15 mins. But nope, he's the worse. he doesn't let us use our phones, play music or let us talk/study in peace. if he sees you having a convo and laughing he will butt in and ask whats funny. If you are studying he will stop you and ask questions. this is why everyone in reg hates him.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love his class!!he makes class fun and interesting (although does go off on tangents sometimes)homework takes a while and is hard at first, but after a couple of assignments you get the hang of it and its not badquizzes arent hard as long as you pay attention in class (which isnt too hard; he keeps it interesting) and study a bithe's also super knowledgeable about history. hes the one who made me like history again, so props to him!! (:","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. the test are a bit hard,but the class is exciting and fun","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The homework isn't much if you split it into two days of work. Especially since he only assigns work to be due on Tuesdays and Fridays. He has TAs grade most of your work. Put time into your work and study hard for the tests. They're usually fill in the blanks. Participation makes a difference.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST TEACHER EVER. Had him for AP Euro, super easy 5. Fun, but a lot of worthwhile work. great stories, too","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy. Tests you will get A on if you study. Prepares outlines that make taking notes a snap. His hw is easy if you **** it in one day and then have the rest of the week free. Only problem is too open with students, so some studnets can drag the class on and prevent you from learning stuff.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"lots of hw, but u really learn how to write essays well. also lots of videos, cool music, he can make anything relate to history...","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pretty good teacher. His homework is SO annoying though. They take a while to do and are a huge part of his grading system. Tests are kind of tough too. Projects are annoying too. Haha Other than that, his discussions in class are hilarious and fun to listen to.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The BOMB! Great guy. If you pay attention and do HW you're gonna get an \"A\". Gives extra credit from watching movies! Great stuff. One of the nicest teachers!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Worth's a pretty good teacher, teaches based on lectures and outlines. Often goes off on tangents, sometimes gets boring, but maybe because i had him 19/20. Tests are easy, homework load is ok. Take him if you want an easy A, but not guaranteed to remember everything you learned.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome modern world teacher! his lectures and videos are very interesting and i learned a lot from him. tests are easy if you study and homework is not hard. he is very funny too :)","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher! learned a lot but the class isnt very hard. hes also really interesting!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Worth is a very good teacher. His lectures are very clear, and he passes out outlines so you basically never fall behind in his class. The outlines have everything that is on the tests or quizes. If you miss a day, all you have to do is look at someones outline and see what you missed.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ALOT more work than reynolds but teaches a whole lot more, so he prepares you for the AP exam really well. i've heard reynold's class gets really boring, but that'll NEVER happen with worth. he's so fun & his lectures interesting, but TAKE GOOD NOTES. TAKE HIS CLASS. you wont regret it.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Worth is an extremely nice and funny teacher. I guarantee you that if you take him, you will love him. But his homework makes you think and his tests are okay. HE IS AWESOME. EVERYONE LOVES HIM. I WOULD RECOMMEND ANYONE WHO IS READING THIS TO TAKE HIM.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"eeeeasiest A of my life","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a very good teacher. He can explain the material in a non-textbook-reading-monotone way. Listen to his lectures and fill in stuff for his outlines he hands though, because he literally gives you the test if you fill out the stuff/take notes. Got an A all 3 grading periods for him.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His homework is kind of a pain sometimes, but you learn a lot in his class. He teaches in a non-boring way and knows how to make the class interesting. Best teacher I've had so far. He grades easy too, so take him!","rating":4.5,"version":1}],"rating":4.5}},"__N_SSG":true}