{"pageProps":{"teacher":{"name":"Jonathan Fong","departments":["Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Chemistry","block":"2","semester":"Fall2014"},{"name":"Chemistry","block":"4","semester":"Fall2014"},{"name":"AP Chemistry","block":"1","semester":"Fall2014"},{"name":"AP Chemistry","block":"5","semester":"Fall2014"},{"name":"Chemistry","block":"2","semester":"Spring2015"},{"name":"Chemistry","block":"4","semester":"Spring2015"},{"name":"AP Chemistry","block":"1","semester":"Spring2015"},{"name":"AP Chemistry","block":"5","semester":"Spring2015"},{"name":"Chemistry","block":"1","semester":"Fall2015"},{"name":"AP Chemistry","block":"2","semester":"Fall2015"},{"name":"AP Chemistry","block":"4","semester":"Fall2015"},{"name":"Chemistry","block":"1","semester":"Spring2016"},{"name":"AP Chemistry","block":"2","semester":"Spring2016"},{"name":"AP Chemistry","block":"4","semester":"Spring2016"},{"name":"Chemistry","block":"1","semester":"Fall2016"},{"name":"AP Chemistry","block":"2","semester":"Fall2016"},{"name":"AP Chemistry","block":"4","semester":"Fall2016"},{"name":"Chemistry","block":"1","semester":"Spring2017"},{"name":"AP Chemistry","block":"2","semester":"Spring2017"},{"name":"AP Chemistry","block":"4","semester":"Spring2017"},{"name":"Chemistry","block":"1","semester":"Fall2017"},{"name":"AP Chemistry","block":"2","semester":"Fall2017"},{"name":"AP Chemistry","block":"4","semester":"Fall2017"},{"name":"Chemistry","block":"1","semester":"Spring2018"},{"name":"AP Chemistry","block":"2","semester":"Spring2018"},{"name":"AP Chemistry","block":"4","semester":"Spring2018"},{"name":"Chemistry Honors","block":"1","semester":"Fall2018"},{"name":"AP Chemistry","block":"2","semester":"Fall2018"},{"name":"AP Chemistry","block":"4","semester":"Fall2018"},{"name":"Chemistry Honors","block":"1","semester":"Spring2019"},{"name":"AP Chemistry","block":"2","semester":"Spring2019"},{"name":"AP Chemistry","block":"4","semester":"Spring2019"},{"name":"AP Chemistry","block":"2","semester":"Fall2019"},{"name":"AP Chemistry","block":"4","semester":"Fall2019"},{"name":"Chemistry Honors","block":"1","semester":"Fall2019"},{"name":"Chemistry Honors","block":"1","semester":"Spring2020"},{"name":"AP Chemistry","block":"2","semester":"Spring2020"},{"name":"AP Chemistry","block":"4","semester":"Spring2020"},{"name":"AP Chemistry","block":"1","semester":"Fall2020"},{"name":"AP Chemistry","block":"2","semester":"Fall2020"},{"name":"AP Chemistry","block":"4","semester":"Fall2020"},{"name":"AP Chemistry","block":"1","semester":"Spring2021"},{"name":"AP Chemistry","block":"2","semester":"Spring2021"},{"name":"AP Chemistry","block":"4","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-03T00:05:40.596Z","text":"He's a  teacher who actually teaches and grades very quickly. He utilizes time well but assigns a lot of work that it can be overwhelming sometimes... Participation can really save your grade, and accuracy and speed are very important to do nows since he will give extra credit if you are one of the first groups done. Overall, he's a great teacher.","rating":4,"version":0},{"timestamp":"2020-05-02T00:19:04.015Z","text":"Mans knows his stuff and has jokes. He teaches the concepts really well and really tries to make sure his students understand it. As long as you participate and take notes you'll do fine. (For his Chem Honors class atleast)","rating":5,"version":0},{"timestamp":"2019-05-28T20:36:01.846Z","text":"Fong is a relatively hard teacher test wise. He really tries his best to make the test averages high though, and teaches you the content well. Take if you want to work harder but be more prepared and learn more chem. Better than Trimble, and easier A but in a strange manner.","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love mr.lee!!...he's great and i understood everything...he makes chemistry very easy to understand and i dnt know how you cnt get an A in his class","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Fong is an excellent teacher who truly know his chemistry. I learned a lot in his class and as long as you do your work and study, you should be able to pull off an A in his AP Chemistry class. I really want to major in chemistry now because of his class. Too bad my high school chemistry career is over ): but he seriously is the best chem teachers at Lowell.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. semi-hard tests though study and you will do well. sometimes homework, short assignments. funny and overall wonderful","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"By far the best chem teacher compared to Rotter, Trimble, Johnson. He moves through the material pretty quickly but he explains everything really clearly and if you ever fall behind, go during office hours, he is super nice and helpful and really wants you to succeed. Fun class, lets you choose seats, entertaining teaching style but also gets information across. There is homework almost every night but it's usually very quick and easy. Tests are not too hard and there are usually retakes.Submitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is awesome.... best chem teacher ever! u learn more from his regular class than any chem H class","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his tests aren't that, but his finals are terrible. just study hard. he's a really great teacher and such a cool guy, just that sometimes he might go a liiittle too fast. if you work hard and pay attention in class and do all the homework and participate (which seems a lot but it's not that much) then you'll do fine. also, his labs are really tight","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Grades are mainly based on participation but it isn't that bad. There is usually a decent amount of homework which really helps you and his tests are doable if you study and understand the concept well. He can teach really well while making the lessons fun. There is no way you can fall asleep in his class.Submitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take him if you're taking reg chem or AP chem, he's the best chem teacher!! you'll learn a lot of things, though his tests might be a little hard, but you'll learn","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Kinda nerdy, but in a good way. Gives homework every other day or so. Tests are pretty hard, but not impossible. Definitely one of the best chem teachers at Lowell.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST Chem teacher ever. His class is fun and you actually learn your stuff. His personality's great and his jokes are....\"violence\"! Definately definately definately take him.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Fong is so AWESOME!! He's probably one of the best chem teachers ever! He's funny, and he relates to teenagers. I like the fact that he gives out mini tests instead of big tests each week. The important thing to do in his class is participate because you get points for it!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pretty easy teacher, just do your work, he's a points type of teacher. I hate the textbook so his notes are somewhat helpful but then I don't really like chem so there you go. He plays \"inspiring\" music before tests, tells funny quotes before giving you notes to take, tells lame-funny jokes.. Easy B","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher, teaches the material wellhomework every night, usually pretty easy, book workvery manageable. lots of labs. most of us get like 95-100 on our labs, easy grade boostersive had an a all semester, really not too hard10/10 would recommend","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very clear explanations for reg chem. Lots of labs with lab report usually due a week after. Not too much homework and spaces things out nicely.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool teacher but hard in a way","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"coolest teacher can teach but hard test","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. fong is the best teacher ever! not only does he teach well but he makes you participate for points (can even raise one letter grade!). his class is really fun and he's really helpful when you ask, so don't be afraid to! you can always go to him and chat just about really random things. he went to lowell before so he knows how evil the hw and teachers can be so he'll be understanding if you ask for an extension on something. take him if you can!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fong is super hard don't take him especially if you're bad at math. Take Rotter instead, you don't even need to pass most tests to get an A. Rotter's grade is mostly based on how colorful and organized your notebook is, while Fong's grade is mostly based on his super hard tests. His test averages are like 50-70. Don't take him unless you want to be stressed.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST TEACHER ON EARTH!!!!!!!!!!!!!!!!!!! had him for bio 1, chem 2h, and ap chem 1 and 2.... class is pretty chill but u learn at the same time... :D","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Every '1/1/1' rating (or something similar to that) is a lie. Mr. Fong is probably one of the best and most sought after teachers at Lowell. TAKE HIM FOR ANY CHEMISTRY CLASS IF YOU GET THE CHANCE! His classes are very fun, he's willing to help out, and it's an easy A/B, even if you fail a test.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I was lucky enough to have Mr.Fong for my whole year of chemistry, and it was delightful. I can't imagine a better class than one where participation is 35% of your grade! Finally, a Lowell teacher who cares that his students make the classroom fun and engaging, as opposed to silent and depressing. He wants all of his students to understand the material, and he's always there to help you outside of class on a concept.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"coolest teacher ever too bad hes not teaching bio 2 since he taught bio 1 but o wells","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Fong is super cool. he makes chemistry interesting and his classes are hilarious. You learn ALOT from the way he teaches. He may go fast for some people but just ask him and he helps. you have to work in his class but his classwork and homework are easy as long as u pay attention in class. Remember to participate because those cost major points. But overall he's the best teacher ever, so take him if you get too!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He went to Lowell so he knows what you're going through. Gives out HW about every day but it's helpful. Pay attention in labs and notes and you'll be fine. He's pretty easy to talk to too.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Fong is not a hard chem teacher. I managed to get a 96% in his class! Tests are almost always curved. a lot of hw but that helps bring up bad test grades. Also participation helps bring it up. So PARTICIPATE in class. it will help you! Thought he does sort of favor people the ppl he calls on","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The BEST teacher ever! His class is only class I don't fall alseep in... Mr. Fong's the coolest! Though his jokes may be a bit... on the lame side... he's still the greatest.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Fong is one of my favorite teachers. I had him for reg chem and it was my favorite class. He really knows his stuff and makes his lessons fun. He does move a bit fast but if you pay attention and do all the work, it's pretty easy. He is nice and easy to approach if you need extra help. Grades are mainly based on participation but it really isn't that bad. I am a student that does not like answering questions much in class but he asks simple questions so everyone can participate.Submitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"First semester of Chem was easy, but the second was much harder. He's funny and straight to the point. You won't regret taking him. Class passes by VERY fast in that class.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's cool and funny (sometimes), but doesn't really teach you. his lectures are boring and his tests are hard.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fong is tight...that's really all I have to say. His class is the one I most look forward to, as far as classes go. Study and you'll be fine. AWWW VIOLENCE! he makes chem very understandable which is good for me cause I thought chem was gonna be really hard.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"fong is definately one of the best teachers i had in a while. he is kool and is pretty easy and he makes chem interesting!! i hated chem in first semester, and i got a C. i took his class, and it was so fun and i got an A!!! bottom line- take him, cuz hes kool, fun, and moderately easy. and whoever is the guy hoo reviewed before me, your just mad because he gave u a B","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's tests are SOOO hard! Although he's hw is easy he's tests are not what he reviews. Have to REALLLY think :(","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I am one to let you know that his class fills up fast at arena. Speaking as a student from normal chemistry, I can say I have learned a lot throughout the year. He may be harsh at times and perhaps a bit mean, but he knows what he's doing. He will always be able to help you when you ask for it and he will love students that listen and know what they are doing. His tests may be harder than other teachers, but you will definitely learn plenty in his class. Easy B, work hard for an A.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Fong's hecka cool. 8D His grading is a little funky but overall...if you do your work and do alright on the tests, you get a B. =] His jokes are PRETTY LAME but i mean, you can't help but laugh at the effort he puts into thinking of them. hahahaha. take him if you actually participate in class though, since it's part of a ginormous portion of your grade.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"New good teacher. this guy might be a little dorky but his cool. i mean cooler than any other teachers in the school.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome teacher! Really a nice guy and really helpful. I learned A LOT. He does go a bit fast, but he goes over the new material for a few days so you can understand the concept more. Participating is vital for your grade. Study and pay attention in class, & you should be good. He makes learning chemistry fun!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Fong is a really cool teacher who knows what he's teaching. You will learn a LOT in his class, but his tests can be a little on the hard side. HW is not too much, and the posters and projects usually only take one class period to finish. Lab reports are usually due a week after the lab. IF YOU'R","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Avoid fong for Chem he cant teach and reads out of the book","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i have him as a reg teacher right now, so i really can't say anything about his science classes, but i can comment on his personality. His personality is pretty good and he's pretty organized and nice. so i would reccomend him as a teacher just for his personality, but i'm not sure about his grading policies, etc..","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Fong saved my life. 10/10. if you have him you are blessedSubmitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's the best. He'll help you out any way that he can and really has your best interest in mind. He will take the time out of his day to help you out, and fined a way to help you even if it seems impossible. He is what all councilors should be. Not saying the other councilors are bad or anything, they're all pretty decent as far as I know, but Mr.Fong is above the standards they've set for themselves. My class has had 3 councilors in the last 3 years, but he was definitely worth the wait.Submitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"coolest teacher on earth... hands down...","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fong is such a great teacher but i just feel like..he is a goooood teacher for REGULAR CHEM but for ap chem... not so good... ppl in martens class actually learn more than fongs class... its just fong is more entertaining.... if u are not so smart and want a 5 take marten","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Fong is a really great teacher. I was a senior when I took AP Chem so I didn't take it very seriously or put in a lot of work at home, but I was still able to do well on the AP test just from his lectures and what I learned in class. I don't think I fully appreciated how good of a teacher Mr. Fong was until I took Chem in college this year. He was way better at explaining concepts than my professor and I rely heavily on what I learned in his class.Submitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr.Fong for regular chem and it was super fun and I learned a lot.If you participate, you get extra credit every time you answer a question correct.And Mr.Fong is super nice and funny, and if you have questions, he's always there to help.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"buddy is super chill. he always says hi to me in the hallways and helps me out with my schedule when my other counselor can't or won't help meSubmitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best science teachers in the whole department! He's popular, so during arena, his classes are usually the first to fill out. You can tell that he loves what he's doing, and we all know that students tend to learn better when they like their subject, too. Easy B, but tests are HARD.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"IF YOU ARE TAKING CHEM,(reg) TAKE FONG. HE IS AN AMAZING TEACHER, AND HE HELPS YOU SO MUCH! hes so nice and he helps everyone understand the concept while making me motivated and want to learn. no questions ask, JUST TAKE FONG! (3rd pick and higher if you want him.. he's that good)","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher, hard course. I'm taking AP Chem right now and it's super fast paced. He gives out homework and do nows on topics we haven't even touched on yet. Can be really frustrating. He has a pretty unfair participation system that is worth a good chunk of your grade. His class is a TON of work!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"YOU MUST TAKE MR.FONG FOR CHEMISTRY!hes such a good teacher and makes sure that everyone understands what hes teaching he really cares about his students and is understanding although theres alot of work and participation its not really hard. he tries to make it easier for us. BEST CHEM TEACHER EVER","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THE BEST CHEM TEACHER EVER! HAVE A HIGH PICK TO TAKE HIM! DEFINTE GONER AFTER 3rd rotation!!!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had mr. Fong for chem, and it was a really good class. I learned a TON and have a B plus. However, I had to work my butt off for that b plus, so if you just want the grade, be prepared to WORK! If you just want an A, and dont care about learning, I suggest you take someone else.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MR FONG IS THE BcESTTTTT he helped me escape ms.pang AKA the worst Chinese teacher ever! He's always checking up on me and is super chill. He understands everything and always makes sure I get what I need. Love ya Mr.Fong!!!!Submitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ChemH, 1&2, APChem1 (F07-F08) He's one of my favorite teachers because he's so easy to talk to. His class is fun, but his tests are difficult, and they are worth an incredible amount of your grade. Participate when you can! Easy B. He's VERY helpful if you go to him for help directly. Favoritism!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Fong is such an awesome teacher! lol his voice is so strong, it keeps you awake even in the morning. His class is definitely one that you want because you learn a lot about chemistry and have lots of fun while learning. =] if you get to know him, you can make jokes about him in return!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class won't be easy, but you learn so much, and it's worth the time. i came to love chemistry because of Mr. Fong","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Assigns way too much HW. Most of its is impossible. He doesn't even help you with it. Half of the time he doesn't even know what he is talking about. He plays favorites and is grumpy.His tests are pointless and harder than all chem teachers including marten.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For AP Chem-very clear in class (much more than Marten)-nice and knows his stuff-prepares you for the AP exam well-if you have a good base from previous chem, you'll do fine-doesn't spend too much time on past subjects, just refreshes your memory","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"eeeeh hes alright. now that he redued the chemspace points from 100 to 25 its way harder to get an A. His test are way tooo hard.... the multiple choice is prob just as hard as the written part.. and his reviews do nothing for u.hes a chill guy and loves sports. but his lectures are soooooooo boring","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Fong is amazing! he is so helpful, and he really explains things. if you don't understand a concept, he will surely explain the issue. he is a great teacher and i would for sure take him!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hes hard. A nice guy and trys to help you learn, but nevertheless, if what you're looking for is easiness, especially in terms of tests, stay away. However, if you like to talk a lot that can help in boosting your grade","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tough. Not the oh you'll learn a lot you just have to teach yourself kinda tough, but doesnt help, unorganized.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tests are kinda hard. loves shoes. Cool person. good teacher. Fun teacher to have.","rating":4.8,"version":1}],"rating":4.793939393939399}},"__N_SSG":true}