{"pageProps":{"teacher":{"name":"Juan Lopez","departments":["Physical Education"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"PE 1","block":"1","semester":"Fall2014"},{"name":"PE 1","block":"2","semester":"Fall2014"},{"name":"PE 1","block":"5","semester":"Fall2014"},{"name":"PE 1","block":"6","semester":"Fall2014"},{"name":"PE 3","block":"7","semester":"Fall2014"},{"name":"PE 4","block":"7","semester":"Fall2014"},{"name":"PE 1","block":"1","semester":"Spring2015"},{"name":"PE 1","block":"2","semester":"Spring2015"},{"name":"PE 1","block":"4","semester":"Spring2015"},{"name":"PE 1","block":"6","semester":"Spring2015"},{"name":"PE 3","block":"7","semester":"Spring2015"},{"name":"PE 4","block":"7","semester":"Spring2015"},{"name":"PE 1","block":"1","semester":"Fall2015"},{"name":"PE 1","block":"2","semester":"Fall2015"},{"name":"PE 1","block":"6","semester":"Fall2015"},{"name":"PE 3","block":"7","semester":"Fall2015"},{"name":"PE 4","block":"7","semester":"Fall2015"},{"name":"Soccer","block":"4","semester":"Fall2015"},{"name":"PE 1","block":"1","semester":"Spring2016"},{"name":"PE 1","block":"2","semester":"Spring2016"},{"name":"PE 1","block":"4","semester":"Spring2016"},{"name":"PE 1","block":"6","semester":"Spring2016"},{"name":"Soccer","block":"7","semester":"Spring2016"},{"name":"PE 1","block":"1","semester":"Fall2016"},{"name":"PE 1","block":"2","semester":"Fall2016"},{"name":"PE 1","block":"4","semester":"Fall2016"},{"name":"PE 1","block":"6","semester":"Fall2016"},{"name":"Soccer","block":"7","semester":"Fall2016"},{"name":"Soccer","block":"7","semester":"Spring2017"},{"name":"PE 1","block":"1","semester":"Fall2017"},{"name":"PE 1","block":"2","semester":"Fall2017"},{"name":"PE 1","block":"4","semester":"Fall2017"},{"name":"PE 1","block":"7","semester":"Fall2017"},{"name":"Soccer","block":"6","semester":"Fall2017"},{"name":"PE 1","block":"1","semester":"Spring2018"},{"name":"PE 1","block":"2","semester":"Spring2018"},{"name":"PE 1","block":"4","semester":"Spring2018"},{"name":"PE 1","block":"7","semester":"Spring2018"},{"name":"Soccer","block":"6","semester":"Spring2018"},{"name":"PE 1","block":"1","semester":"Fall2018"},{"name":"PE 1","block":"2","semester":"Fall2018"},{"name":"PE 1","block":"4","semester":"Fall2018"},{"name":"PE 1","block":"6","semester":"Fall2018"},{"name":"Soccer","block":"7","semester":"Fall2018"},{"name":"PE 1","block":"1","semester":"Spring2019"},{"name":"PE 1","block":"2","semester":"Spring2019"},{"name":"PE 1","block":"4","semester":"Spring2019"},{"name":"PE 1","block":"6","semester":"Spring2019"},{"name":"Soccer","block":"7","semester":"Spring2019"},{"name":"PE 1","block":"1","semester":"Fall2019"},{"name":"PE 1","block":"2","semester":"Fall2019"},{"name":"PE 1","block":"3","semester":"Fall2019"},{"name":"PE 1","block":"6","semester":"Fall2019"},{"name":"Soccer","block":"7","semester":"Fall2019"},{"name":"PE 1","block":"1","semester":"Spring2020"},{"name":"PE 1","block":"2","semester":"Spring2020"},{"name":"PE 1","block":"3","semester":"Spring2020"},{"name":"PE 1","block":"6","semester":"Spring2020"},{"name":"Soccer","block":"7","semester":"Spring2020"},{"name":"Soccer","block":"7","semester":"Fall2020"},{"name":"Soccer","block":"7","semester":"Fall2020"},{"name":"Soccer","block":"7","semester":"Spring2021"},{"name":"Soccer","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-12T03:36:51.847Z","text":"The best P.E. teacher in Lowell! LITERALLY! very flexible and chill, way too chill. Definitely an easy A as long as you participate and try your best. Focuses a lot on mental health as well not just physical health of his students which is a kudos.","rating":5,"version":0},{"timestamp":"2020-05-06T23:58:13.408Z","text":"Literally the best PE teacher. I was late almost everyday, didn’t change almost everyday and he kinda cared but I had a high A every semester. As long as u try sometimes, you’ll get an A. There’s no Monday run day, you do yoga, and he teaches you how to ride a bike.","rating":5,"version":0},{"timestamp":"2020-05-05T11:29:52.014Z","text":"Mr. Lopez, he’s the best PE teacher EVER!! He hates it when you’re late, but that is literally the only complaint.","rating":5,"version":0},{"timestamp":"2020-05-05T02:25:13.334Z","text":"Mr Lopez is really chill and nice, and an easy A. ","rating":5,"version":0},{"timestamp":"2020-05-04T01:33:47.335Z","text":"He taught PE but the most important thing he taught us was that common sense is lacking at Lowell.","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome teacher, very chill guy. we did not have any written tests the 2nd semester even though he said there would be. the people who dont get A's in his class are people who cut class on a daily basis.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Super chill guy. Make sure to listen to him when he talks and follow his instructions and you will for sure get an A. As long as you show up, dress, you should be fine. He has written tests sometimes for units such as, Tennis","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes really chill about everything and like he actually tries to help his studentshe gives tests like physical and written, but aren't hardSubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lopez is a great PE teacher! He actually teaches you and improves you on various skills in different sports. I personally don't like P.E. much, but I had lots of fun in his class. Easy A as long as you follow instructions and try your best.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lopez is the best PE teacher you will ever have. Not only does he explain and demonstrate everything super clearly but he is so funny and easy to get along with. You will have the best PE class of your life even if you don't actually like exercising because he makes it super fun and entertaining.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is the best PE teacher in my opinion! He was new last semester when i got him. At Arena I specifically wanted to get him again. His syllabus may seem strict, but he's actually really easy going. He's very nice and easy to talk to. He actually cares about PE and teaches techniques, but isn't very","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's such a chill teacher! He gave our class 1000% extra credit (yes, 1000%) for winning a football game! He actually teaches while making class fun. Only complaint is that I'm sad I can't take him again. ):","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lopez is a pretty good teacher. You have to do stuff, but it's easy. Grades you on how athletic you are, but is nice about it. Whenever there's a sub we have to do book work. He also grades you on your \"student conduct\" and you have to do the 7-minute workout like every Monday. He remembers the bad students the most. Even if he doesn't like you, you'll still get an A. The finals were teaching yoga to the class and biking to the beach.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST PE TEACHER EVER. TAKE HIM. HELLA CHILL AND FUNSubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a very nice teacher and is very skilled at what he's teaching. He'll give you an A if you try your best and follow instructions. Don't be afraid to take him for PE.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THE BEST! Super cool and can actually do the stuff he teaches. Also pretty laidback and friendly! Knows how to joke around and connect wit students (:","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lopez is a pretty good PE teacher. He's pretty understanding, and is a fun teacher. He does have tests (both physical tests and written tests), as well as paperwork, which is a bit different.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's nice and all, but overall his class is boring. Not super challenging but you can't just sit around either.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy as long as you try. Don't have to be athletic to get an A. he's also Very nice","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lopez is a nice and chill teacher. His tests are not too hard. He does have students make their own portfolio and sometimes substitutes reflections for tests. He is a very generous grader and will try to make you fit. He is not very helpful when trying to help students improve in a sport though. He can be strict for physical exams. He often lets students out late. He truly cares for the wellness of his kids.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Thank the good lord for Mr. Lopez! He is helpful and funny at times. He doesn't run too much and has super fun units for PE. He is a big fan of 7-minute high intensity interval training, but don't be afraid. Consider yourself very lucky if you get him!Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fun units, entertaining, great teacher. Wants the best for his students. Digs deeper than most phys ed teachers do, be prepared to write short papers after each unit.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes ok. doesnt like some students but still gives them an a. has a lot of book work when gone but i laid back and overall a cool guy. recommend i guessSubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lopez is really funny and nice but he has questionable music taste. I would recommend his class, we don't do a lot of running.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His a nice teacher. His actually fun when you get to know him better. He taught me a lot when he used to teach me.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"eh yeah hes chill but i actually wanted to do stuff and saw him as lazy. easy a but dont take if you want to get fit. we literally never run i feel like I cant even run half a block anymore, since i didnt run since middle schoolSubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A lit dude. Take him for soccer PE, it's a lot of fun and you get to scrimmage the whole time. Free A if you actually play, which is not always required. Good fun,good dude 10/10Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"we never touched our PE portfolio. we only did Fit for Life when there is a sub. chill classSubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lopez is awesome! :D i love the unit activities that we did which included biking xD hes really nice and friendly. Easy A and really written tests arent hard, its mostly just self explanitory stuff so dont worry about that. Just enjoy PE :)","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"At first, I thought he would be like Hosoda but he's not bad. :D His class is fun and I'm enjoying P.E.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think he's an AWESOME TEACHER! He isn't super tough or scary and he compromises half way with the students. We still do work but we aren't heavily graded which makes PE so much more fun! I love this guy's class. XD","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher! I thought he was giong to be hard at first, but you basically just have to pay attention and put effort in order to get an A. We did some ice breaker games during the beginning of the semester and some tests/quizzes.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HE IS REALLY CHILL. good for pe teacher :D he can acrually do everything he teaches us, and super nice","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is an okay teacher. He is often unfair about grading and hard to talk too.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"At first I thought he would've been strict, but he's really not. And he's very chill. You have physical and written tests but they're not too bad. I really like his class and you probably will too.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lopez is the best!!! i hope i can taake him again!!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is awesome! I currently have him as my p.e teacher. And had him my first semester and he is the one of nicest teacher. It easy to get an A, just don't take advange of his niceness or you'll end up with a C. He is also very encourging because of him I love p.e!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the best teacher u can ever have he is smart awesome and u can get an easy A i had him since 2nd grade always been nice, caring, and fair to everyone","rating":4.6,"version":1}],"rating":4.652631578947365}},"__N_SSG":true}