{"pageProps":{"teacher":{"name":"Judith Brooks","departments":["Miscellaneous"],"semesters":["Spring2016","Fall2016","Spring2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"PE 1","block":"1","semester":"Spring2016"},{"name":"PE 1","block":"2","semester":"Spring2016"},{"name":"PE 1","block":"3","semester":"Spring2016"},{"name":"PE 1","block":"7","semester":"Spring2016"},{"name":"College and Career","block":"4","semester":"Spring2016"},{"name":"PE 1","block":"1","semester":"Fall2016"},{"name":"PE 1","block":"2","semester":"Fall2016"},{"name":"PE 1","block":"5","semester":"Fall2016"},{"name":"PE 1","block":"7","semester":"Fall2016"},{"name":"College and Career","block":"4","semester":"Fall2016"},{"name":"College and Career","block":"4","semester":"Spring2017"},{"name":"Health Education","block":"3","semester":"Spring2018"},{"name":"Health Education","block":"6","semester":"Spring2018"},{"name":"Health Education","block":"7","semester":"Spring2018"},{"name":"College and Career","block":"4","semester":"Spring2018"},{"name":"College and Career","block":"4","semester":"Fall2018"},{"name":"Health Education","block":"3","semester":"Fall2018"},{"name":"Health Education","block":"5","semester":"Fall2018"},{"name":"Health Education","block":"7","semester":"Fall2018"},{"name":"Health Education","block":"1","semester":"Spring2019"},{"name":"Health Education","block":"3","semester":"Spring2019"},{"name":"Health Education","block":"5","semester":"Spring2019"},{"name":"Health Education","block":"7","semester":"Spring2019"},{"name":"College and Career","block":"4","semester":"Spring2019"},{"name":"College and Career","block":"2","semester":"Fall2019"},{"name":"Health Education","block":"3","semester":"Fall2019"},{"name":"Health Education","block":"5","semester":"Fall2019"},{"name":"Health Education","block":"7","semester":"Fall2019"},{"name":"Health Education","block":"8","semester":"Fall2019"},{"name":"College and Career","block":"2","semester":"Spring2020"},{"name":"Health Education","block":"3","semester":"Spring2020"},{"name":"Health Education","block":"5","semester":"Spring2020"},{"name":"Health Education","block":"7","semester":"Spring2020"},{"name":"Health Education","block":"8","semester":"Spring2020"},{"name":"College and Career","block":"2","semester":"Fall2020"},{"name":"Health Education","block":"3","semester":"Fall2020"},{"name":"Health Education","block":"6","semester":"Fall2020"},{"name":"Health Education","block":"7","semester":"Fall2020"},{"name":"Health Education","block":"8","semester":"Fall2020"},{"name":"College and Career","block":"2","semester":"Spring2021"},{"name":"Health Education","block":"3","semester":"Spring2021"},{"name":"Health Education","block":"6","semester":"Spring2021"},{"name":"Health Education","block":"7","semester":"Spring2021"},{"name":"Health Education","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-07T20:28:48.763Z","text":"Her class was arguably very easy, but you have to deal with her attitude. Just stay quiet and do the work and she won't try to pick on you. Don't be overly friendly, but don't be extremely rude either, if she doesn't notice you then you'll earn an easy A. ","rating":2,"version":0},{"timestamp":"2020-05-02T04:58:10.644Z","text":"brooks sucks. she definitely has favorites, and is moody, and i dont think she knows what shes talking about. take cole. i had her for health and she just made us do dumb worksheet things in a journal. sooo fucking boring, but i mean its health. dont really like her; we had a miscommunication once and she definitely over reacted. easy A tho. DO NOT RECOMMEND.","rating":1,"version":0},{"timestamp":"2020-05-02T00:01:52.742Z","text":"If you are going to take Health, please try to take Cole instead. Ms. Brooks is a terrible teacher, and she plays favorites in all of her classes. If you are not on her good side, get ready to be disrespected and yelled at in class. She knows nothing about her field of teaching, and often tells the class to learn entire units of material on their own. The only positive is that it is very hard to not get an A in her class as long as you stay quiet and do not go on your phone. The final is usually an automatic 100 unless your group is not prepared. Class is very boring because you usually just write down a few notes in your journal or answer a question that she never even checks.","rating":1,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Brooks made my PE life a breeze. 100% participation grade, very very minimal written work. If you have no interest in PE and just want to get the easy A, she is the perfect choice. Also, 20 minutes of stretching each day! Just don't be surprised when other students laugh at your class if they happen to pass bySubmitted by a student","rating":2.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"honestly, she's not qualified to be a PE teacher at all, never lets u do actual units (sports), while other classes are doing tennis or yoga, you will be doing track and field and the \"fit for life\" textbook. u spend most of the class period stretching or carrying down materials for class and a chair for her to sit on while she watches you run. she always has her favs in class but easy to get an A if u look like ur trying.Submitted by a student","rating":2.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really easy A. Not physically difficult, but she is strict about uniform, etc.Submitted by a student","rating":2.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Aiya this class is honestly very bad. No only does she take 20 minutes to get there in the morning, but she's super rude and doesn't care about your opinion whatsoever. Take her if you want to do absolutely nothing physical, and just read textbooks about fitness. Yup you read that right. You have to do book work in PE. Submitted by a student","rating":2.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's not qualified to be a PE teacher at all whatsoever. That's why I chose her class again. Even though she's not the best teacher, when you compare her to the rest, she's basically the easiest freshmen PE teacher ever(along with lopez, but i heard he gives written tests) If you hate PE and just want to get an A, CHOOSE MS BROOKS. When we actually exercise, just stop and chill when she isn't looking. If you enjoy exercising and sweating a lot, don't choose her.Submitted by a student","rating":2.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Boring class, but easy A though if you stay on her good side (which is really easy). Has favorites, and will yell at you for random things. If you want to get in shape and do intense exercises for PE instead of running and stretching, this is NOT the teacher for you.Submitted by a student","rating":2.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ahh. if you want to do actual physical activity, i dont recommend her class. she plays favoritsm on certain types of people, points you out & embarasses you in a way in front of the entire class, spend 20 minutes on stretches, is VERY behind compared to other classes. overall shes an easy ASubmitted by a student","rating":2.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Ms. Brooks freshman year for PE. Almost no actual physical activity. She has the class form up in roll call order at the beginning and end of each class while she takes roll, and spends about 10 minutes doing this each time. If you look like you're trying, it's an easy A. Asks the guys in the class to do pretty much everything for her. Also cares a lot about uniforms. Didn't finish giving our class the PFT...Submitted by a student","rating":2.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"TERRIBLE teacher. Plays favorites, very disrespectful to students. Has absolutely NO knowledge of her subject area. VERY boring. Would not recommend at all. Has an inferiority complex and will flip out at anyone she feels is undermining her, even if they're being completely genuine with her. My worst teacher all year.Submitted by a student","rating":2.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had her for C&C, an easy A but her class is boring.Submitted by a student","rating":2.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she makes u work hard and motivates you to actually do exercise. sometimes she races us down the hill and she wins because she rolls so fast! like her momentum is unprecedented; that sheer speed of her flying down the hill is unlike anything ive ever seen before. i bet she can beat the ppl on the white golf carts any day! if the olympics had a hill racing contest, ms brooks would win gold for the US every year, then eat the medal because she thought it was chocolate. rolling down hills GOAT!!!!!Submitted by a student","rating":2.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Never did physical activity and we basically read fitness for life most of the timeSubmitted by a student","rating":2.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Brooks is a really great teacher. She is really nice and cool.Submitted by a student","rating":2.1,"version":1}],"rating":1.9562500000000005}},"__N_SSG":true}