{"pageProps":{"teacher":{"name":"Karen Arnold","departments":["Math"],"semesters":["Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Algebra 1","block":"1","semester":"Spring2018"},{"name":"Algebra 1","block":"7","semester":"Spring2018"},{"name":"Algebra 2","block":"5","semester":"Spring2018"},{"name":"Geometry","block":"2","semester":"Spring2018"},{"name":"Geometry","block":"6","semester":"Spring2018"},{"name":"Algebra 2","block":"1","semester":"Fall2018"},{"name":"Algebra 2","block":"3","semester":"Fall2018"},{"name":"Algebra 2","block":"5","semester":"Fall2018"},{"name":"Geometry","block":"2","semester":"Fall2018"},{"name":"Geometry","block":"6","semester":"Fall2018"},{"name":"Algebra 2","block":"1","semester":"Spring2019"},{"name":"Algebra 2","block":"3","semester":"Spring2019"},{"name":"Geometry","block":"6","semester":"Spring2019"},{"name":"Geometry","block":"2","semester":"Spring2019"},{"name":"Geometry","block":"5","semester":"Spring2019"},{"name":"Algebra 2","block":"1","semester":"Fall2019"},{"name":"Algebra 2","block":"3","semester":"Fall2019"},{"name":"Geometry","block":"2","semester":"Fall2019"},{"name":"Geometry","block":"4","semester":"Fall2019"},{"name":"Algebra 2","block":"1","semester":"Spring2020"},{"name":"Geometry","block":"2","semester":"Spring2020"},{"name":"Algebra 2","block":"3","semester":"Spring2020"},{"name":"Geometry","block":"4","semester":"Spring2020"},{"name":"Geometry","block":"6","semester":"Spring2020"},{"name":"Algebra 2","block":"2","semester":"Fall2020"},{"name":"Algebra 2","block":"3","semester":"Fall2020"},{"name":"Geometry","block":"1","semester":"Fall2020"},{"name":"Geometry","block":"4","semester":"Fall2020"},{"name":"Geometry","block":"6","semester":"Fall2020"},{"name":"Algebra 2","block":"2","semester":"Spring2021"},{"name":"Algebra 2","block":"3","semester":"Spring2021"},{"name":"Geometry","block":"1","semester":"Spring2021"},{"name":"Geometry","block":"4","semester":"Spring2021"},{"name":"Geometry","block":"6","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-09T20:57:24.888Z","text":"She is an ok teacher. During hw check, she sees if u did it and gives u a 100. She teaches right of a book, and her tests vary. There was one test where the class average was a 60%, and she didn't curve it. She does drop one test and two quizzes every semester tho. Compared to other geo teachers tho, she is pretty solid","rating":4,"version":0},{"timestamp":"2020-05-07T00:13:17.333Z","text":"Some people really hate this class, and at times I understand, but I liked this math class more than any other I had taken at the time. She doesn't entirely know what she is doing but she goes so slowly it's really hard to get lost. Homework makes up the majority of your grade and it's fairly easy, even if tedious sometimes. It was the only math class where I knew what was happening the entire time so I can't complain. I will say that she has no control over the class, we did whatever we want. One time she switched our seats to assigned seating and the next day we came back, sat in our old seats, and no one ever talked about it again. If anything else, easy A","rating":4,"version":0},{"timestamp":"2020-05-05T17:20:15.058Z","text":"teaches from the book. can't control the class. messes up frequently on grading quizzes and tests. doesn't car what you're doing as long as you don't disturb class.","rating":3,"version":0},{"timestamp":"2020-05-04T18:52:03.244Z","text":"Honestly I think the other reviews are exaggerating how easy it is to get an A in her class. Homework is graded nicely and she's a good person but her tests are a large portion of your grade and she gives a lot of trick questions. I would say easy B harder A, class average on some tests was as low as a 75%.","rating":3,"version":0},{"timestamp":"2020-05-02T22:22:37.582Z","text":"I had her for Geometry as a freshman. She's really nice and easy. I don't recommend taking her since she just teaches straight out of the book. She can't control the class very well. She only grades homework based on effort and not if you're right. You won't know if you got the correct answer unless you cross-reference. She's nice but you don't learn much from her unless you self study.","rating":3,"version":0},{"timestamp":"2020-05-02T03:38:06.628Z","text":"If you know your math take this class. If you are at all weak in the subject don’t expect much help. Homework based. No one fails. Ez A","rating":5,"version":0},{"timestamp":"2020-05-02T00:13:41.972Z","text":"Class was really easy, but I wouldn't recommend if you actually want to learn since she essentially teaches straight out of the book. She's really nice but can't really discipline her students as others have said. You could be on your phone the entire time and she'll just nicely tell you to put it away. ","rating":3,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is okay.easy A but Is not very good at teaching at all. We are perpetually behind all the other classesSubmitted by a student","rating":2.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a great person and a good teacher. Not recommend if you cant self learn. extra time to study before tests, offers notecards and calculators!Submitted by a student","rating":2.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"super easy A and tests are better than other classes. inefficient teaching tho bc she just copies the textbook onto the board. don’t recommend taking her if u actually wanna learn and pass finals. i struggled on finals bc she didn’t teach anything. great person overall tho and she tries to be helpful. don’t take advantage of her personalitySubmitted by a student","rating":2.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Arnold is a super sweet person. As a person she's great, she will help you if you need something, will give you participation points just for asking questions, collects homework every two weeks. the quizzes and tests are pretty easy, her class is a easy A, she will never fail someone. But as a teacher you won't learn very much. You will learn more from the book and youtube than from her. Take her if you want an easy A and don't really care about learning geometry (idk how she teaches Alg)Submitted by a student","rating":2.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very easy but you won't learn much.Submitted by a student","rating":2.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very nice person, just not a very good math teacher, and not good at controlling a class.Submitted by a student","rating":2.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Incredibly easy teacher. We are behind the other classes however. Personally, the exams were easy for me but they do have things that we have not learned. Really you can do whatever you want in her class, she won't really stop you. Honestly it doesn't even seem like she fully understands what she is teaching, and never really gives definitive answers. Also, all her lessons are just straight from the textbook, and she isn't good at explaining them either. Just read the book.Submitted by a student","rating":2.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a very sweet woman and a pretty good teacher. I had her for geo, she doesn't teach quite as much as I'd like but I completely understood everything we covered. She doesn't let anyone fail a test, you can always get a C.Submitted by a student","rating":2.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She never gets upset, even when her class is very disrespectful, and has a lot of patience. She gets walked over a lot. The classes can get very loud and by the end of the year, no one is listening to her. It's a very easy class, as the majority of your grade is homework. She only grades homework on if you tried, not if you actually got it right. If you ask questions, you can see she doesn't have a deep understanding of math. If you know the subject, take her class. You won't have to do much.Submitted by a student","rating":2.2,"version":1}],"rating":2.8000000000000007}},"__N_SSG":true}