{"pageProps":{"teacher":{"name":"Karl Hoffman","departments":["Math"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Calculus BC","block":"1","semester":"Fall2014"},{"name":"AP Calculus BC","block":"2","semester":"Fall2014"},{"name":"Geometry Honors","block":"6","semester":"Fall2014"},{"name":"Geometry Honors","block":"7","semester":"Fall2014"},{"name":"AP Calculus BC","block":"1","semester":"Spring2015"},{"name":"AP Calculus BC","block":"2","semester":"Spring2015"},{"name":"Geometry","block":"6","semester":"Spring2015"},{"name":"Geometry","block":"7","semester":"Spring2015"},{"name":"AP Calculus AB","block":"2","semester":"Fall2015"},{"name":"AP Calculus BC","block":"1","semester":"Fall2015"},{"name":"Geometry","block":"6","semester":"Fall2015"},{"name":"Geometry","block":"7","semester":"Fall2015"},{"name":"AP Calculus AB","block":"2","semester":"Spring2016"},{"name":"AP Calculus BC","block":"1","semester":"Spring2016"},{"name":"Geometry","block":"6","semester":"Spring2016"},{"name":"Geometry","block":"7","semester":"Spring2016"},{"name":"AP Calculus AB","block":"2","semester":"Fall2016"},{"name":"AP Calculus BC","block":"1","semester":"Fall2016"},{"name":"Geometry","block":"6","semester":"Fall2016"},{"name":"Geometry","block":"7","semester":"Fall2016"},{"name":"AP Calculus AB","block":"2","semester":"Spring2017"},{"name":"AP Calculus BC","block":"1","semester":"Spring2017"},{"name":"AP Calculus AB","block":"2","semester":"Fall2017"},{"name":"AP Calculus BC","block":"1","semester":"Fall2017"},{"name":"Geometry","block":"6","semester":"Fall2017"},{"name":"Geometry","block":"7","semester":"Fall2017"},{"name":"AP Calculus AB","block":"2","semester":"Spring2018"},{"name":"AP Calculus BC","block":"1","semester":"Spring2018"},{"name":"Geometry","block":"6","semester":"Spring2018"},{"name":"Geometry","block":"7","semester":"Spring2018"},{"name":"AP Calculus BC","block":"1","semester":"Fall2018"},{"name":"AP Calculus BC","block":"3","semester":"Fall2018"},{"name":"AP Calculus BC","block":"4","semester":"Fall2018"},{"name":"AP Calculus BC","block":"1","semester":"Spring2019"},{"name":"AP Calculus BC","block":"3","semester":"Spring2019"},{"name":"AP Calculus BC","block":"4","semester":"Spring2019"},{"name":"AP Calculus BC","block":"1","semester":"Fall2019"},{"name":"AP Calculus BC","block":"4","semester":"Fall2019"},{"name":"AP Calculus BC","block":"5","semester":"Fall2019"},{"name":"AP Calculus BC","block":"1","semester":"Spring2020"},{"name":"AP Calculus BC","block":"4","semester":"Spring2020"},{"name":"AP Calculus BC","block":"5","semester":"Spring2020"},{"name":"AP Calculus BC","block":"1","semester":"Fall2020"},{"name":"AP Calculus BC","block":"2","semester":"Fall2020"},{"name":"AP Calculus BC","block":"5","semester":"Fall2020"},{"name":"AP Calculus BC","block":"1","semester":"Spring2021"},{"name":"AP Calculus BC","block":"2","semester":"Spring2021"},{"name":"AP Calculus BC","block":"5","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-01T23:04:58.174Z","text":"He's transparent, reasonable, fair, and most importantly a good teacher. Some don't like his slideshow style of teaching but like what others are saying, you get out what you put in. If you ask him questions he'll happily answer them. His tests are never harder than the homework/classwork. He doesn't even force us to do homework, but a lot of us do it anyway because we know it helps. He's also pretty geeky lol and he seems hard to get close to but he's honestly super chill","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's the coolest math teacher ever! He's kind of nerdy and talks in a monotone voice, but he has a very great sense of humor and teaches really well! He doesn't reinforce doing homework because he doesn't collect it, so remember to do it so you actually do well on the tests! The tests only have things that we have learned, which is great! He's a very clear teacher as well! =D","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a great teacher. He teaches things you need to know at a good pace. The only homework he collects are constructions and the tests aren't that hard.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His tests are much more difficult than the homework or stuff from the textbook. His class lectures are pretty good because you understand the classwork or the lesson afterwards. However, he goes pretty fast and goes over at least a new theorem or postulate a day. He's a pretty quiet guy and class ca","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a good teacher, I got what he talked about, and he explains things really clearly. He's not intimidating either, so you can ask him for help if you need it. He might be somewhat boring, but at least he's not strict or sucks at teaching. His tests are very manageable if you listen to his lecture","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"truth is, a lot of the people here have written good stuff about Mr. Hoffman. Most of these people would have gotten A's with basically any math teacher. He teaches you a lesson a day, no exceptions, uses the most precise terms he possibly can, almost never smiles, won't let you out for Kermesse or anything like that, is hard to talk to during class. He is very easy to go to after class, is pretty fair for curves, though he should make it a cumulative both class curve. I got a B, butfelt onmyown","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr hoffman was a really cool reg teacher...it takes some time to get used to him and his jokes, but i learned to like him...he's just misunderstood.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i honestly look forward to geo H everyday.. no i'm not a nerd, but i like how his class is pretty chill and clear. yep take mr. hoffman, he's way better than all the other math teachers! :D","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Dedicated teacher. if you go to him for help, he will definitely help you.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Mr. Hoffman! Best geo teacher ever!! Tests during the semester are kinda hard but they are curved. The final is EASY (and also curved!). You learn a lot in Mr Hoffman's class, a lot more than from other teachers. TAKE HIM!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hoffman is god. Hoffman is life. Hoffman is the world.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"KARL HOFFMAN IS A GEOMETRY GOD! He teaches straight off of his slideshow which is basically a copy of the textbook, but he goes super in depth about everything. He is really monotone, he makes jokes that aren't funny but its super funny when he tries, and he is always willing to help. If you ever need help or have a problem, just send him an email or talk to him in person because he's super easy to work with and he is very reasonable. 10/10 would recommend. THIS TEXTBOOK IS MY BIBLE!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hoffman will be the BEST math teacher you'll ever have. He's incredibly straight-forward and will teach you everything you need to know.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Legit teacher. So chill and funnily awkward. Best joke teller ever. Loves to dress up on Halloween. Slick comments. Will never be caught laughing out loud. Fun stuff! Oh, and he'll put you in your own table if you happen to talk too much.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a pretty good teacher.His tests are sooo hard, but there are curves. The tests are worth 75% of your grade and 25% is constructions. He doesn't really collect the homework, but it'd probably best to try to do it to prepare for tests. It's good how he has people put up the answers the next day though. Working in groups helps as well. Is also picky about tardiness. Like I said, a good teacher, but if you're not uber smart in geometry like me, you may be better off taking someone easier.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Rubix cube genious. lol! he does it hella fast.. but anyways. he gives good lectures. youll learn a lot.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hoffman is my favorite math teacher of all time. He knows his stuff, and he's willing and able to help you on whatever you're having trouble with. His class is a challenge, but I love it. His tests can make you feel dumb and question why you're taking BC in the first place, but he's the kind of teacher that makes you not want to drop his class. I absolutely love this guy! Definitely take him.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hoffman is amazing, and doesn't give you any BS.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"u will always help u if u needed, even after school. but, his tests are so short that u can't barely miss anything.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hoffman is this perfect stereotype of a Lowell teacher. He is everything mentioned below. I personally enjoyed his class because he is a sensible teacher with a predictable class schedule. It is true that anyone taking his class will become a geometry buff. I can't stress this hard enough: IF YOU LIKE GEO, YOU WILL LIKE HIS CLASS. Compared to Mana (I had him as well), Hoffy is more difficult but you learn more.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hoffman is a very clear and precise teacher. Great teacher if you want to learn everything in the cirriculum. However, he has a very dull and boring voice.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a good teacher, just take him, don't question it","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He may be the \"easiest\" geo h teacher but he honestly dont push you to try your hardest to succeed in his class. I dont prioritize his class because he doesnt make me want to put all my energy into his class. Learning from him is like learning from a robot. the fact that he doesnt care if you do homework at all is NOT a blessing in disguise.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"DRAWS PERFECTLY STRAIGHT LINES AND GREAT CIRCLES. when I shadowed here 2 years ago I went in Mr. Hoffman's class (that was when he taught in the science wing) and he seemed great. Now I have him and he' still good. HW isn't optional now.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Teaching method is very clear for Geo Honors!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A superb teacher, I learned a lot from him. His tests may be a bit difficult but he always curves them unlike other teachers and his final is super easy AND he still curves it. He is always willing to help you if you have questions and he has a good sense of humor. Highly recommended.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Just amazing.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"U learn lots, and he curves, and it's super fun and you become a math genius, both in one class.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Extremely cool math teacher. ppl say hes geeky and nerdy, but his sense of humor is cool in its own way; he can make you laugh a lot. you dont have to do the hw, since he nvr checks; he assigns them so that you can study for the tests. they can be hard, but he curves so its not bad at all. and of course there are the constructions, which can be cool at times.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hoff definitely does not screw with your mind. His tests are designed to draw the best effort you can give. Hoff does not give \"easy\" tests. You must self-study, and ask questions to clarify the things you do not understand. The Hoff is awesome!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"oh man mr. hoffman is great. his geeky sense of humor makes class most interesting.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really super teacher. Work for an A, but it's possible. Learn lots, kinda funny sometimes, but not for the reasons you'd think. Curves, so it's okay not to do too well. Honest grader","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST GEO TEACHER! i learned SOOOOOO much. you'd never learn those weirdass constructions in manas class","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His subject is pretty hard, but if you are willing to ask questions and come in for help, he is very nice and willing to help. he definitely knows his stuff and is not one of those teachers that just stays one lesson ahead of the students. he is very clear and concise in his lectures.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"super fun class because he has a great sense of humor. You don't see it very often, but when he let's some of it out, the whole class has a good laugh. teaches well and covers a lot of material. if you need help, just see him in his office. too bad i can't take him again.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very good teacher, explains the material thoroughly, ready to help, very clear and concise. Study, do homework, and do contstructions well; you should have an A. His tests are hard, but he teaches hard classes (I'm in Geo H).","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His AP Calc class is so much easier than my pre-calc class. In this case, easier is good (you still do work, you still learn, but you feel less stress). He's a great teacher and makes math understandable again. His geeky sense of humor is awesome. It inspired a lot of students to make their own geeky jokes, too. Lots of math teachers are distant and cold, but he's nice. Take him! I got a 5 in the AP test. I had a C in pre-calculus from evil Merlo.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"talks like an electronic robot.. you can't understand his language as \"human\".. just gives you the definition of a theorem and expects you to know everything about it. doesn't correct homework so you don't know if you are doing the stuff right or wrong.. because of that = death on the tests","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"what a boss, geometry is god for this guy, he is god for me, logikSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's good at teaching; however, the tests are pretty difficult, so it brings the grade down. Sadly, his tests are always 40 minutes long whether we have a long or short class. Your grades depend only on tests and constructions. We used to hand in our homework, but we stopped doing so because our tests supposedly determine whether or not we had completed our assignments. The few homework points actually improve your grade.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty tyte guy, tests are a bit hard.. but he curves em. the guy is really clear and helps tutor off mods.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"This guy = geek to the max.He never smiles and is very monotonous.He wore a white tshirt once and we all had a good laugh. Pretty easy but cant control students","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hr hoffman is really cool, yeah a bit geeky, but he is really a good teacher, constructions were cool and his lectures interesting","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hoffman is a good, straightforward teacher and his tests are pretty easy. If you have any problems, he is willing to spend time to tutor you.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr hoffman is the coolest teacher ever!! kind of hard but overall he's a great teacher. i would choose him for my teacher any day. his classes are mostly fun but the tests are a bit hard. if you listen to his lectures then the tests are okay. if you get the chance, be sure to choose him.. i know i would x]","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr.Hoffman for Geometry H and if you’re looking for an easy A don’t take him. However if you want to learn the subject and challenge yourself I would highly recommend. At the beginning of the semester I was finding his class very difficult and frustrating but towards the end I realize how much I learned and how happy I am to have taken this class. If you want to get an A it’s very much douable - HE CURVES HIS TESTS GENEROUSLY AND OFFERS OUTSIDE HELP AND EXTRA CREDIT -Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I take his GeoH and his class is definitely the chillest class in my day because he gives you everything straight up, people may think he's monotone but i believe he speaks calmly and clear. i say out of the teachers i have had, mr. hoffman is the most helpful because he is the most OPEN to help you","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hoffman is totally cool, at first glance he may be sorta hard to approach, but he gets along with people really easily and he's easy to talk to once you get comfortable with him. He's pretty funny sometimes too. His teaching is clear, and once you don't get something, he'll explain it right away. He","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"wow...nerd humor off the charts but you love him for it! great class for hmwk slackers..memorize the order then do the one problem ull have to do! tests are INSANE! fortunately u r allowed to print out index cards with all the theorem on them so get used to Uber small print! take only if you really want to learn or work on math","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Haters. Hoffman is the best and I think his tests got a lot easier since they've never been that hard for me, and I'm not very good at math. Classwork is hard but he always explains it well.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Geometry godSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good teacher, kinda boring and monotonous, but teaches well, goes at a nice steady pace","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THE HOFFINATOR. I have never been a math class where I laughed so much. Hoffman, aka Mr. Hoffy, will let you get away with a lot of stuff because although he doesn't seem like it, he does have a pretty good sense of humor. Never collects homework, which is not necessarily a good thing because tests count for 75% of your grade and he places a lot more emphasis on constructions than other teachers. But overall, TAKE HOFFMAN. His tests can be tricky, but just study and review previous problems. =]","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hoffman is the best for Geo H. I would take him again for AP Cal. You should do your hw even though it is not required. He talks in a monotone voice, but still take him its worth it. Overall, good teacher. Goodbye Geo HSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Hoffman is relatively easy going and NEVER collects homework. His tests are pretty hard, but if you do at least some of the hw and pay attention in class and youre decently smart you should be able to get at least a B easily.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. hoffman is the best geo teahcer. His grades aren't that bad. i still remember the stuff he taught even now...nice occassionally and if you work hard then you can get an A just like me x 2","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"super smart guy, but I feel like he only teaches from the book, and his exams are pretty hard. You learn a lot if you try to, but otherwise you have to spend a lot of time studyingSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes so cool but hes so hard... if he was only easy... but hes the coolest out of mana and cohen","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Taking him soph year for Geo honors. Just do it, trust me. :)","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. karl hoffman....wow. everyone told me he was very very easy in geometry compared to hunt; ironically he became a lot harder and totally made me hate geo, i admit, the guy himself is pretty cool in his nerdy way and homework is \"optional\", however beware of his tests nowadays, he's definitely gone up a whole new level. good luck >_<","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best (and cleanest, neatest, geekiest) math teacher ever! \"[Math problem] 2b or not to be?\" *snicker*He even resembles a meter stick. Use him as an example when you start parallel planes and lines.Funny guy with a sense of humor. Willing to tutor students outside of class for several mods if needed.Curves tests and final.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have had Mr. Hoffman for three semesters (Geo H and AP Calc). You really get out what you put in in his class. For a Lowell teacher, he is extremely chill and understanding. He lays out the whole semester and is very transparent with his teaching style and curriculum. Great teacher overall. Bonus points for his amazing dad jokes.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hoffman is an awesome Geo H teacher! He tells/teaches you all that you need to know to succeed on his tests, so pay attention in class and/or copy down what's on the board. You get a notecard on his tests, so utilize that and STUDY. If you pay attention, do you hw and study, then a B is not too hard. HAve to work for an A. Also, he's a super funny guy and knows people's names really fast. If you want to learn a lot and work hard and have a chill class with a cool teacher, take hoffman!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had very high grades in all my previous math classes, but his Calc tests are too much. Homework doesn't take too long but the problems on the test are very tricky.... I've struggled for passing grades. He rarely explains material, and on the rare occasion only extremely briefly. I heard Cohen was difficult but Hoffman is definitely a toughie.","rating":4.7,"version":1}],"rating":4.704687499999994}},"__N_SSG":true}