{"pageProps":{"teacher":{"name":"Katherine Melvin","departments":["Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Environmental Science","block":"1","semester":"Fall2014"},{"name":"AP Environmental Science","block":"2","semester":"Fall2014"},{"name":"AP Environmental Science","block":"5","semester":"Fall2014"},{"name":"AP Environmental Science","block":"6","semester":"Fall2014"},{"name":"AP Environmental Science","block":"1","semester":"Spring2015"},{"name":"AP Environmental Science","block":"2","semester":"Spring2015"},{"name":"AP Environmental Science","block":"5","semester":"Spring2015"},{"name":"AP Environmental Science","block":"6","semester":"Spring2015"},{"name":"AP Environmental Science","block":"1","semester":"Fall2015"},{"name":"AP Environmental Science","block":"2","semester":"Fall2015"},{"name":"AP Environmental Science","block":"4","semester":"Fall2015"},{"name":"AP Environmental Science","block":"6","semester":"Fall2015"},{"name":"AP Environmental Science","block":"1","semester":"Spring2016"},{"name":"AP Environmental Science","block":"2","semester":"Spring2016"},{"name":"AP Environmental Science","block":"4","semester":"Spring2016"},{"name":"AP Environmental Science","block":"6","semester":"Spring2016"},{"name":"AP Environmental Science","block":"1","semester":"Fall2016"},{"name":"AP Environmental Science","block":"2","semester":"Fall2016"},{"name":"AP Environmental Science","block":"4","semester":"Fall2016"},{"name":"AP Environmental Science","block":"6","semester":"Fall2016"},{"name":"AP Environmental Science","block":"1","semester":"Spring2017"},{"name":"AP Environmental Science","block":"2","semester":"Spring2017"},{"name":"AP Environmental Science","block":"4","semester":"Spring2017"},{"name":"AP Environmental Science","block":"6","semester":"Spring2017"},{"name":"AP Environmental Science","block":"1","semester":"Fall2017"},{"name":"AP Environmental Science","block":"2","semester":"Fall2017"},{"name":"AP Environmental Science","block":"4","semester":"Fall2017"},{"name":"AP Environmental Science","block":"6","semester":"Fall2017"},{"name":"AP Environmental Science","block":"1","semester":"Spring2018"},{"name":"AP Environmental Science","block":"2","semester":"Spring2018"},{"name":"AP Environmental Science","block":"4","semester":"Spring2018"},{"name":"AP Environmental Science","block":"6","semester":"Spring2018"},{"name":"AP Environmental Science","block":"1","semester":"Fall2018"},{"name":"AP Environmental Science","block":"2","semester":"Fall2018"},{"name":"AP Environmental Science","block":"4","semester":"Fall2018"},{"name":"AP Environmental Science","block":"6","semester":"Fall2018"},{"name":"AP Environmental Science","block":"1","semester":"Spring2019"},{"name":"AP Environmental Science","block":"2","semester":"Spring2019"},{"name":"AP Environmental Science","block":"4","semester":"Spring2019"},{"name":"AP Environmental Science","block":"6","semester":"Spring2019"},{"name":"AP Environmental Science","block":"1","semester":"Fall2019"},{"name":"AP Environmental Science","block":"2","semester":"Fall2019"},{"name":"AP Environmental Science","block":"4","semester":"Fall2019"},{"name":"AP Environmental Science","block":"6","semester":"Fall2019"},{"name":"AP Environmental Science","block":"1","semester":"Spring2020"},{"name":"AP Environmental Science","block":"2","semester":"Spring2020"},{"name":"AP Environmental Science","block":"4","semester":"Spring2020"},{"name":"AP Environmental Science","block":"6","semester":"Spring2020"},{"name":"AP Environmental Science","block":"1","semester":"Fall2020"},{"name":"AP Environmental Science","block":"2","semester":"Fall2020"},{"name":"AP Environmental Science","block":"4","semester":"Fall2020"},{"name":"AP Environmental Science","block":"6","semester":"Fall2020"},{"name":"AP Environmental Science","block":"1","semester":"Spring2021"},{"name":"AP Environmental Science","block":"2","semester":"Spring2021"},{"name":"AP Environmental Science","block":"4","semester":"Spring2021"},{"name":"AP Environmental Science","block":"6","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-01-30T03:52:11.167Z","text":"Her class and assignment schedule is really laid-back. She talk a lot about grading harshly but everyone always gets a ton of bonus points at the end of the semester that should put you into an A if you spent some effort. On top of that, I feel like I learn a lot from her class even though sometimes she comes off as kind of hippie / preachy.","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST TEACHER! Gotta take her, she is the best/ don't listen to all the other ratings! she is the best teacher/ she is so cool","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"OMG what are you guys all talkign about?! she has got to eb the coolest etacher at Lowell and she actually knows hwo to teach her subject. she makes it fun for you too with all the labs she does.Ms. melvin is teh roxor!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she expects everything and doesn't give you the tools necessary for anything. if you like copying vocab out of the book, take her. otherwise don't take her. Or APES","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Melvin is the bestest teacher EVER!! i really enjoy her APES class.. she is so funny and her lectures are relly informative, clarifying, and not boring.. you just have to actually read the book and study for the tests and u can get an A...its really stressful when we have 7 labs going all at 1ce","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She realizes being smart is not all about doing well on tests — you can fail all of them b/c there is lots of extra credit.. Just do your work, even if it's bs'd. She actually KNOWS her stuff and will keep you updated (even when our crap books won't). APES is the best class I've taken yet.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good teacher...fun labs...boring lectures","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's pretty fun, but don't take her class too lightly. The little quizzes and labs may seem easy, but you have to put some effort into them. And her tests are pretty hard, only ten questions that covers 4-6 chapters and she moves very quickly, 1-2 chapters a week. Her final was easy second semester-it was a board game. Overall, she's fun and you learn a lot.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool teachers, makes references all the time. exams & finals way hard!!!!!!!!!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She knows her material well. I didn't do much intensive studying for the AP at all. Massive AP FRQ drills weekly. If you fail test, it's not the end of the world. Ask her for help.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"First off, melvin and laureyns literally do everything exactly the same when it comes to quizzes, labs, projects, and PowerPoints. EVERYTHING. But I definitely recommend Melvin because while she is quirky, she knows what she is talking about and is very passionate about what she teaches. She also does a good job relating to current events. One of my fave teachers!Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she can be nice and funny but sometimes criticizing. watch out for the web grading system there are errors.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she definitely knows her stuff. class is very fun, especially the labs. yeah, she's sarcastic and it's hard to ask her a question, but if you listen during her lectures, you'll get a good grade on her exams. plenty of opportunity for extra credit.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Although I graduated in 2008, I still am struck by how amazing of a teacher she was. She connected w/ her students and made sure everyone understood. One of the few teachers I actually liked there.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"tough stuff but very fun class. Just be prepared for sarcasm and some attitude","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"tests are hard. has attitude problems. never has time to help students. although she has great knowledge of the subject and is a pretty good teacher..","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best teachers that I've experienced in 16 years of schooling!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best teachers I've ever had. She'll help you if you go for help. Intense class, hard to slack off in but you learn a lot. Labs are interesting and she connects w/ students. One of the best!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's awesome! She's funny and interesting, even if the tests are hard. there is very little hmk and fun labs","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is one of the worst teachers at lowell by far. my daughter, who had took her class a few years go, told me that, although, she is nice, she can not teach and provides no incentives for her students to succeed in her class. i was also told that her classes would watch a lot of movies and go on a bunch of useless field trips.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She expects too much from the little information she gives you. You have long labs to type up every night, and leaves everything very unclear.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very good teacher. Probably one of the only teachers at lowell that actually teachers for you to learn. Kids need to understand how she teaches--she's very straight to the point, and wastes no time. if you are slow, and don't like the truth, then you won't like the class. i love the way she teaches,","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not a bad teacher, but I've seen better. Her biggest problem is that she seems to care more about school politics than teaching.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Melvin is generally a good teacher. She's very clear in her lectures; definitely a good teacher to take in the morning because her lectures always use the words \"happy shiny people.\" But she gives a lot of work for labs and her tests are only bearable if you study.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had her for APES. I got a 5 on the exam, but I scored really high on the diagnosistic test too. Didn't learn much. She talks down to you.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher for APES! really drills you hard. All labs and work is bearable. Very easy to raise grade and very big curve on grades. I really want to take her again..","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a really easy teacher. she loves labs, lots of labs. but shes a really nice person and an extremely easy B. even if you fail her tests, you can still get a b. take her labs seriously.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A LOT of homework, one chapter per week with questions and notes and a quiz plus 2 labs a week. bio class was hard, and she has attitude w/ sarcasm.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Melvin's class is really fun and interesting - she likes to tell you strange and gross facts! it's pretty easy to get an A, because most of the class is based on labs (which are usually pretty fun). don't stress too much about tests or the final, because they don't count too much, but i'd definitely study a little.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes a good teacher..talks alot..shes been around [[places not ppl]]..shes a hard grader but a good teacher...i like her...she can be mean though... =l","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"OMG, SHE IS SOOOO EASY. HER TESTS ARE EASY CUZ SHE GIVES U HINTS DURING THE TEST. SUPER NICE, WAY COOL, I TOOK HER FOR BIO AND GOT AN A WITHOUT OPENING THE BK. YOU SHOULD TAKE HER!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Simply the best science teacher at Lowell. Must take for APES or MS.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is an interesting one. The way she teaches is not even like lectures its more like stories or talking to you as a person not just a student. Even though I was just looking for an easy Ap, she really changed the way I look at the environment now. She truly wants all her students to pass and prepares them for the AP exam its your choice to cooperate.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shes a great teacher who knows the material and will make sure u learn. she teaches alot throught labs which r fun and relate well to the material. one of my favorite classes her lectures are pretty fun too its good to participate in class even if u dont know the answer just have an opinion on the question","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i took her for bio and it was my favorite class of the day. lots of labs. most of the work is busy work so you dont have to think very hard. 10pt quizzes every week, super easy. essay test every grading period, you must study for these! hella cool cuz she lets you out early and makes quality jokes. dude she is laid back, but dont take her if you cant put a little effort in the class. otherwise she is a good bet. she isnt the easiest bio teacher, but it could be worse.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"FUN CLASS, moderate tests, she tries to make them easy. She knows her stuff, and shares our hate for the biology book =)","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Melvin is an absolutely fabulous teacher. You can't go wrong with her as a teacher for any class! Not only does she know how to teach well, but she makes the material fun and understandable. I highly recommend her.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"DO NOT SLACK OFF. She has extra credit options which are very helpful. She has a lot of easy points option. If ur looking for an AP this is the one. Reading the chapter once is enough. My test average was 70% cause I had a lot of APs It's good","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She may be the most fun science teacher around, but has some sarcasm issues....","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Towards the end of the semester the class just got way too boring to stay awake BUT she's a great person and fun to talk to... She prepares us a good amount for the ap test and she cares ab all her students. Tests every friday that you can pass with half an hour of studying. Impossible to get a B there's just too many extra credit options but I'm not complaining. I would choose melviln over laurenz but they're essentially the exact same person.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ummm... AP Enviro... BORING! Pointless! Doesn't even give you college credit! If youre not about saving the environment, DO NOT TAKE THIS CLASS!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Wonderful and eays teacher; but A LOT of work. pratically do everything she asks and A. Lectures are great, but are touched with sarcasm and attitude. Moved fast, learn a lot.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Class of 03. Ms Melvin was the best teacher I ever had at Lowell. Sarcastic, extremely opinionated, and might even quote Simpsons lines from time to time. Those are all positive qualities, btw. The connection I feel for her class goes beyond words.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I adore Ms. Melvin!! i think she is a great teacher and i really understand the material she teaches. in her lectures, she always adds stories that really help me understand. she is not neccesarily an easy teacher(her tests are hard) but you learn. I would reccomend her without a doubt! (and it pays off because i have an A in her class, and i actually know the material)","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"boring lecture and will pick on certain people. her tests are kinda hard but the grading system is ok if u finish all your work. personality needs work.","rating":3.8,"version":1}],"rating":3.8266666666666684}},"__N_SSG":true}