{"pageProps":{"teacher":{"name":"Kathleen West","departments":["Science"],"semesters":["Fall2019","Spring2020"],"classes":[{"name":"Biology","block":"1","semester":"Fall2019"},{"name":"Biology","block":"2","semester":"Fall2019"},{"name":"Biology","block":"5","semester":"Fall2019"},{"name":"Biology","block":"6","semester":"Fall2019"},{"name":"Biology","block":"7","semester":"Fall2019"},{"name":"Biology","block":"1","semester":"Spring2020"},{"name":"Biology","block":"2","semester":"Spring2020"},{"name":"Biology","block":"5","semester":"Spring2020"},{"name":"Biology","block":"6","semester":"Spring2020"},{"name":"Biology","block":"7","semester":"Spring2020"},{"name":"Biology","block":"8","semester":"Spring2020"}],"reviews":[{"timestamp":"2020-05-22T21:55:18.773Z","text":"Speaking from personal experience, she's really boring and unenthusiastic. She doesn't seem like she likes being a teacher. Her class isn't really engaging, but I don't think that's for every class, so I might be a bit biased. However, something that I've seen is the main problem across all classes, is her grading on essays and projects. A lot of people believe she just grades harshly, but once you ask her what the problem is, you start to realize that it isn't just because she grades harshly, but rather doesn't pay attention to your project/essay.  Most of the errors she points out are easily fixed by telling her that you already stated the prompt. She just doesn't pay attention, and much like her class is very unfocused when looking at your work. TLDR She doesn't seem like she wants to be a teacher, and this poorly affects her teaching. She's not engaging and because she herself isn't engaged, your essays/projects will be poorly skimmed over and she'll miss important facts->bad grade","rating":1,"version":0},{"timestamp":"2020-05-12T03:33:00.035Z","text":"Ms. West is definitely one of the best and knowledgeable teachers in Lowell. She's the kind of teacher that will make you actually put in the effort in any assignments as she grades really harshly. And she literally makes the BEST and aesthetic slides ever with gifs. No tests at all. but more on lab-works and CER(R). Anyways you'll definitely learn a lot in her class as long as you pay attention and actually focus.","rating":5,"version":0},{"timestamp":"2020-05-06T17:37:01.863Z","text":"Ms. West is super nice and sweet. Although she does assign a lot of labs and projects, you will learn a lot. It's not hard to get an A in her class just do your work. ","rating":5,"version":0},{"timestamp":"2020-05-05T22:06:09.944Z","text":"Ms. West is a pretty good teacher and her class is pretty involved, we do al lot of labs. We do not get tests, which is good, but it also means that the classwork is very heavy and we have a lot of projects. She is also a little boring to listen to, she seems to go from being extremely unenthusiastic to being over the moon, but overall she's a decent teacher and she cares about her students individually, which is nice.","rating":4,"version":0},{"timestamp":"2020-05-05T21:50:24.255Z","text":"ms. west is pretty cool and gives fun labs :) overall a good teacher and u learn a lot","rating":5,"version":0},{"timestamp":"2020-05-05T11:25:27.265Z","text":"Ms. West is a good teacher overall. I did have some complaints about her grading on the CER’s. She also doesn’t give much info to what your supposed to do. But she’s really nice and easy going, being a young teacher she understands our struggles and will be very genuine on however she can help you. She was the best teacher overall this year.","rating":4,"version":0},{"timestamp":"2020-05-04T21:11:43.124Z","text":"She’s not the worst teacher I’ve ever had, but definitely not a good one. Her grading is harsh, although it is still an easy B. Getting an A is also not too hard, but don’t expect any high A’s, they’re extremely hard. Asking her questions also usually ends up confusing you more than clarifying things, and you’ll end up with more questions than you started with. She also at times seems really nice, but also sometimes looks like she just wants to get out of the class and leave. She’s ok, not the best, not the worst, and a good option compared to another bio teacher.","rating":2,"version":0},{"timestamp":"2020-05-04T20:30:25.693Z","text":"Ms. West is such a great teacher. She is so understanding and kind. She grades harshly on projects and written work, so do your best. There are very rare quizzes and little to no homework. She doesn't really play favorites but likes making jokes with people. She gives everyone the opportunity to earn an A.","rating":5,"version":0},{"timestamp":"2020-05-04T18:57:09.269Z","text":"An amazing teacher. Super super nice and teaches so much. Only note is that the essays are graded kind of harshly, but you can always do a revision. Homework is minimal unless you have a project. Easy A if you put in effort and do the work. She is a great teacher and person.","rating":5,"version":0},{"timestamp":"2020-05-04T07:06:33.604Z","text":"Super kind and sweet. Always willing to help you understand the material more in and out of class. Her lessons were really engaging and I really learned a lot! ","rating":5,"version":0},{"timestamp":"2020-05-04T05:03:43.039Z","text":"i love ms west!!! so much she is literally the coolest person ever !!! i had her in freshman year for bio and we did a lot of cool projects :] rn i chill in her class a lot even tho im not her student anymore ","rating":5,"version":0},{"timestamp":"2020-05-02T20:53:07.911Z","text":"ms west is the best! she funny and someone you can talk to. she’s so flexible and makes it so you always have a 2nd chance to do better in her class. no tests or quizzes ever. our final was a socratic seminar and it was chill. barely any homework usually. definitely would recommend her! ","rating":4,"version":0},{"timestamp":"2020-03-04T17:53:26.715Z","text":"I love Ms.West ! She is super nice, chill, fun and understanding. Her work is pretty easy. She doesn't give tests or a hard final. For finals we did a socratic seminar only. Also with all the work we do, she gives us rubrics and they help me alot! She also lets you do revisions as much times as you want for most of her work . ","rating":5,"version":0}],"rating":4.230769230769231}},"__N_SSG":true}