{"pageProps":{"teacher":{"name":"Katrina Rotter","departments":["Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016"],"classes":[{"name":"Chemistry","block":"2","semester":"Fall2014"},{"name":"Chemistry","block":"6","semester":"Fall2014"},{"name":"Chemistry","block":"8","semester":"Fall2014"},{"name":"Chemistry Honors","block":"3","semester":"Fall2014"},{"name":"Chemistry Honors","block":"7","semester":"Fall2014"},{"name":"Chemistry","block":"2","semester":"Spring2015"},{"name":"Chemistry","block":"6","semester":"Spring2015"},{"name":"Chemistry","block":"8","semester":"Spring2015"},{"name":"Chemistry Honors","block":"3","semester":"Spring2015"},{"name":"Chemistry Honors","block":"7","semester":"Spring2015"},{"name":"Chemistry","block":"1","semester":"Fall2015"},{"name":"Chemistry","block":"2","semester":"Fall2015"},{"name":"Chemistry","block":"5","semester":"Fall2015"},{"name":"Chemistry","block":"6","semester":"Fall2015"},{"name":"Chemistry","block":"7","semester":"Fall2015"},{"name":"Chemistry","block":"1","semester":"Spring2016"},{"name":"Chemistry","block":"2","semester":"Spring2016"},{"name":"Chemistry","block":"5","semester":"Spring2016"},{"name":"Chemistry","block":"6","semester":"Spring2016"},{"name":"Chemistry","block":"7","semester":"Spring2016"},{"name":"Chemistry","block":"2","semester":"Fall2016"},{"name":"Chemistry","block":"3","semester":"Fall2016"},{"name":"Chemistry","block":"6","semester":"Fall2016"},{"name":"Chemistry","block":"7","semester":"Fall2016"},{"name":"Chemistry","block":"8","semester":"Fall2016"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took Rotter for regular chem. Ms. Rotter's class is not easy if you don't have a good mind for chemistry. She assigns 1-2 reading logs a week, which require an hour if you really want to absorb the material. Then she expects you to come into class with a full understanding of all topics. Her class also moves extremely quickly, so you are doing a few things in each class. I hated this because we never had time to finish assignments and would have to do them at home, on top of other work.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's great!! I had her for both semesters of chem and even though chem 1 was much easier than chem 2, I still managed to get a A for all of the grading periods. Just be prepared to learn and do work.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you do the work, you can get an A. She makes sure you're actually learning! Plus, her class is really fun because it's so mellow and there's so much time where the students just talk nonsense. RLogs are long and you don't learn from them, but easy and the R (95%) you'll probably get is worth it!","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Probably one of the best teachers I've seen at Lowell. I can actually see that she's passionate about her job. HUGE load of homework, but it's pretty helpful. Retakes on tests/quizzes.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's such a fun teacher! I love her class. I find her sarcasm extremely amusing. Her class is an easy A.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"DO NOT TAKE HER. She used to be easy because it was the same as her reg chem class, but that's not the case anymore. She got a LOT harder. It's impossible.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Rotter is actually pretty cool and helpful. I had some trouble before so I asked her about it and she gladly explained it to me. And reading logs aren't that as bad as it sounds. And her quizzes are pretty easy because she actually explains it on preambles or review problems before the test.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Rotter is hilarious. Really down to earth and cool. Her table-group system is very helpful and the truckloads of homework she throws at you forces you to actually learn the material. Easy A if you study and do the homework. . Tardiness is accepted, as are cellphones and whatnot.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty nice teacher....weird work though. Doesn't answer questions directly. Like most other people said thought shes pretty nice and can relate to us kids.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I've never put so much effort into one class. Most people don't like her because her class is A LOT OF WORK but in the end I was glad I had her as a teacher, because out of all my teachers, she taught me the most. I got an A- in her class, its not that hard grade-wise as long as you do reasonably we","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's nice... kinda childish and she doesn't teach. We have stupid group work that she doesn't really go over. Doesn't answer questions either.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hahaha i have GOT to be the only one that actually likes her. i thought she was cool! when she actually does teach i think it's really straight forward, and i understood it! =D the people that complain are the ones that don't GET IT just because i don't know what's wrong with them. AHa...but she's cool!","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She does assign more hw compared to most teachers, but I thought she taught well. And she jokes sometimes with the class, so its never really boring in her classroom. Pretty easy A if you do all the hw. She curves tests like crazy. :D","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Rotter for ChemH. Truthfully, I DID NOT like this class. She gives a RIDICULOUS amount of homework, and during class you're always doing some kind of work as well. The only good thing is if you do all your homework, it should boost your grade up to at least a flat B if you don't do so well on her tests.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's a really young and funny and cool PERSON, but as a TEACHER, like the other ppl said, she can't explain that well. there's plenty of hw to boost your grade up though, so she's an easy-ish A, and def. an easy B. the problem is that you might not learn as well, but i guess you can learn frm the book.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not going to lie. I thought this class would be kind of easy, since i am an upperclassman. The reading logs. killer. uhh.... the quizzes are quite straightforward and simple. as long as you dont mind tons of homework, she is great. yes, she does explain stuff. (CHEM1H).","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"imo, the reading logs only take like 2 hours, which is not too big of a deal if you get it over with over the weekend. plus, her abbreviated notes help out a lot if you don't feel like reading the textbook (aka me)! her quizzes are relatively easy, and her preambles test your knowledge. take her! :D","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i was in her chem h class. easy A, but i wish she included conceptual question on her test. her test are just easy calculations. i didnt learn much and the rLogs didnt help.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Rotter is one of the most... unique teachers I have ever had. She skipped high school, so she must be a genius of some sort. She expects a lot from her students, giving assignments and labs with very little help and advice. The work is fairly easy, but time-consuming and tedious. The quizzes started off easy, but got more difficult as the class progressed. It is definitely an achievable A b/c all the homework you do can each get an A grade to balance out the test grades.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her Reading Logs aren't that bad if you don't procrastinate. You could get F's on her tests and still get A's on your report card. But homework and labs are a big part of your grade.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is cool and all...but not really understandable! Her work is pretty easy abd her class is easy A or B, but I don't understand half the things in her class!!","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy A, but if you want to learn and understand concepts better i recommend someone else.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome teacher. I love her class! The reading logs and QP's take a while to do, but it is helpful. As long as you do the work, you should be fine.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great and easy teacher if you could stand the long reading logs :(","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"LOTS of hw for chem reg and even more for honors. She's a pretty good teacher, but I mainly learn from her example problems. Easy to get A if you do all your work well and do ok on tests.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good teacher, too much work that's overwhelming. Had her for chem H, so it was a little difficult, but if you ask for help, she's very nice about it. Funny and always drinking diet soda.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I should not have been put into the chem1h! The test to get in needs to be more difficult! I struggled a LOT with the math. Normally, I self study from the textbook. In this class, we used a college level textbook and it was too hard to understand. Too much homework. Students slept at 4am -> HW.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She assigns so much busy work its insane, she obviously thinks that her students have nothing better to do then spend every night filling every part of every page of a 230 page notebook with meaningless reflections and random worksheets that don't really teach you anything. Either that or she doesn't care. 65% of my homework from all seven of my classes came from her, and I still haven't learned much chemistry. Easy A if you sacrifice your life to the notebook.Submitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I really enjoyed Ms. Rotter's class. It was both fun and helpful. Although the workload can get a bit difficult since there is homework from other courses, I really did feel like the homework was informational. With the decorations and the color, I was very interested in looking back at previous work, and it was a really organized way to study for the final.Submitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Currently have Rotter for reg chem. She seems to know her stuff but does not do very well explaining it. Her tests are super hard, especially since she can't teach and we haven't done most of the stuff. However, there is usually a huge curve on it so its not bad. Grades are based on a 10 pound notebook we have to carry around where we keep all our work. Make sure it is neat and colorful. If you keep up with the work, you can get an A. All we have done this semester is climate change.Submitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's like a little kid and likes to joke around with students. It's a super easy B and a easy A. Even if you do fair or not TOO good on your test, just do good on all your homework and you would get an A. sometimes she might not be too clear on her explanation in class. So remember to sit next to em smart people in class to make life easier.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"It's a pretty easy A if you just do the h/w.  She'll explain things to you if you just ask her, so she wasn't as bad as I thought she would be. If you want to know what's the workload like, go to \"enjoyscience.org,\" click on \"Assignments,\" and you'll see a calendar that has all the work.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I still have wrist aches from writing all of her pointless RLogs. Her lessons and tests go further in-depth about whatever you're writing the RLog about. There are Odyssey assignments. I aced all her RLogs, homework assignments and labs, but got B's/C's on her tests and failed her finals. Got an A.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a workload of homework EVERY night and its extremely hard even if your at an average a B student. her regular class is just like her honors class except they use a different book. she treats her regular class just as hardly. its all bad.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She explains things really well, and you understand pretty quickly. She's a really easy A, but there is a ton of useless homework. I used to have rotter, and now i have trimble. Big mistake to switch. I went from getting straight As in chem, to straight Cs. Rotter is a great teacher for chem!","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"As a person, she can be really sarcastic to the point that it's offensive and she can be moody. But as a teacher, she's easy. You just have to do all her reading logs and take good notes. Sometimes, you can even use your notes/rlogs during quizzes. Basically, EASY A!","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"study and u get an A. reading logs are helpful","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Generally good, but missing a few minor th!ng$: not enough lectures (explaining stuff/making stuff clear), assigning too many reflections and forces brutally the use of color. Super smart and quirky, and strange, but decently nice. Passionate reader of reflections (the most important part of the notebook along with color to get an A).","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's not all that nice, but she knows her material well. it's her first year teaching, so just give the girl a breake.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Im currently taking her Chemistry Regulars class (Im in 10th grade). This class is a little easy for me because i take honors math. Shes a fairly okay teacher though. Lotsa homework though, but easy to get an A.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes a really good teacher..easy test but reading loqs are annoying","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"your 3 lab groups (which she picks) determine your grade. retakes for tests. I got an A and didn't learn anything.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Homework is so fun. I love Ms Rotter, she rocks my socks","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"its not too hard to get a B but shes really unclear and you don't learn. gives kind of a lot of hw, oh and she reads slides off whle you're copying and goes to the next slide too fast. even though shes a nice person, i wouldn't take her again.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"KAtrina Rotter is the best chemistry teacher every much better than Quach","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Two words... READING LOGS. If u like homework...","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't know what anyone who says she's an easy A is on. You used the word easy in that sentence. Her homework is NOT easy. It is a pain in the posterior region. Someone start a petition to abolish reading logs, or something.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Rotter was so easy. I just sat there half falling asleep while listening to her talk about mostly things that are more like math than actual chemistry. Her reading logs are crazy, but if you spend an amount of time on hw, you'll get an easy A.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she doesn't teach squat. she makes you do reading logs which are completely useless and a waste of time. easy A if thats what you want.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes a nice lady, class is sometimes a bit boring, homework isnt too bad, but you dont really learn much from her, learn on your own and you'll get an A, if your lucky sometimestoo","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her reading logs are not fun, but it is easy to get an A. She offers a lot of chances for extra credit.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SHE IS A VERY EASY TEACHER! Ridiculously easy A. Just do homework to a fairly good content.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Homework that doesn't help ANYONE at ALL. Sure, I might have a good great and learned quite a bit, but it would have been a ton easier with another teacher.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. rotter's nice but she can't teach chemistry. she is an easy A but after i think about it, maybe i should have taken green. rotter doesn't seem like she can teach chemistry; she's like a preschool teacher, treating us like we're little kids and talking so slow. it's almost like i'm getting dumber in her class. easy A but learn little - take rotter, if you want to learn more, i advise one of the other chem teachers.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for regular and it was pretty easy to get an A in her class. for those horrible reading logs, just make sure to fill in every blank space you can find and you'll get at least a 95. curves on tests","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"This teacher knows her stuff, but she can't explain it to you if her life depended on it. Horrible teacher, exams are insanely hard. Everyone fails them, so she has to curve them every time so she doesn't look like a bad teacher. Do good on your notebook, and get an A.Submitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i dont know why mrs. rotter has such bad ratings. you can ask all her students, and theyll tell you shes not a bad lady. shes very nice, and relates to students because shes young. you just dont really learn from her and you sort of have to learn on yourself. theres a lot of group work, so if your group is DUMB, then you're screwed","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy, Guaranteed A in Chemistry if you show a little effort.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"An easy A if you do most of the homework. She actually has her own website where she posts grades, assignments, and due dates, which is very helpful. Most teachers at Lowell are too lazy to post the grades and assignments there.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"COOL person [: easy A. but you don't really learn much..","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you're the type of student who is a visual neat freak then you'll love this class. If not, then you may find this class to be a bit challenging.If you take her class 1. Be neat. You'll have a notebook where everything you do will eventually end up in, and it's worth a BIG portion of your grade. Take pride in making it organized and presentable. 2. Do. The. Homework. The night it's assigned. It's a self-taught class that can be managed by understanding all hw & ESPECIALLY READING LOGS.Submitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy A, do her assignments and get at least an R (95%) on a lot of them, they you can screw up on the tests.not a lot of tests. the preambles and the reading logs are annoying.finals are 10% of your overall grade, so DO ALL OF YOUR ASSIGNMENTS AND TURN IT IN ON TIME then you can at least get 50% on the final and still get an A. if you're smart and get a 100% in her class, all you need is 9 correct on her finals.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She will drive you mad with her insane loads of busywork. It's ridiculous. She gives out so much work that she can't grade it all even with 4 TAs. Class is generally an easy A and she's nice but moody","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Nice but doesnt teach well. Class gets boring really fast. And VERY long homework. You can retake tests, though. Weird grading method... Oh, and preambles are stupid.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"if you take her, youll suffer with PREAMBLES almost every day. but its a good waste of time. MUAHAHA. shes a very nice person, and is willing to help, but if you dont ask, she expects you know it and keeps giving you harder material. the cool thing is that you can talk to her about anything because shes very young and understanding.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"maybe lots of homework, but no tests, only \"quizs\" on special topics you're learning, curves alot. she doesnt teach out of the book, but has her own note, which i find far more helpful and easy to understand","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"At first I found Ms. Rotter's class difficult, because quizzes are hard. But she curves so it's ok. I also didn't like the Preambles, but i realize the preambles actually helped me a lot. Overall Okay","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's annoying. Her preambles are amazingily pointless. They would make sense if we actually LEARNED how to do the stuff beforehand. She doesn't teach. Gives LOADS of stupid work that you have to learn how to do on your own. Plays her stupid nations game and interrupts working more than anything else.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"busy work the whole year. if you want to learn, much less remember chemistry, i'd advise you to not take her. though she's friendly and playful, she isn't the best teacher. very easy A however.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms rotter isnt that bad. her rlogs and QPs may seem long but if you do it over time, its ok. her quizzes and tests r easy. just do your hw and ur fine","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't hate her, but I definately hate the homework she gives. She makes you do a lot of reading logs that don't really help and take an enormous amount of time. :\\ Easy A as long as you do all your homework. ^-^","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really good for regular chem. gives quizes no tests, and you can retake all of them. LOTS OF HW, but HW is worth as much as a quiz, but u must do it to get an A. shes pretty funny. all info for quizes is given in the notes. take her, shes easy.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"take her if you like homework. or need to be entertained with 6 hour straight homework on weekends reading logs. self teach. nice tho...","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She doesn't teach the material for tests very much in class; she expects us to understand it mostly based off of homework. I often scramble to learn material before quizzes. She also doesn't always answer questions, which can get really irritating. That being said, she is approachable outside of class and will help you understand concepts if you ask her for after school help. She also puts genuine effort into lesson plans and her class, which is more than you could say for a lot of teachers.Submitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a great person, but not so much as a teacher. If you actually try on her homeworks, you should be getting an A at least. If a lot of people do horrible on the tests, she'll curve. The workload is a bit high, but manageable.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's sometime lazy in class and don't do much. She should teach us more and give us more problems. Group work is not very effective for us because no one knows how to do anything.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Overall, I think she is not all that bad. She might not teach well but you can learn the material from the textbook. The R-Logs aand QPs seems pointless. The labs are very fun to do. I do have a lot of fun in her class but I think she needs to work on her teaching techniques and her moods. Once when","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"In the beginning, i HATED her, i thought she was overly sarcastic and her hw was pointless and long (rLogs). But as the semester went on, the hw got easier to do and less in amount. i love how she has quizzes on every concept (sig figs, conversions) instead of a huge test, definitely helped me under","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I do not know why she chose to become a teacher when she clearly cannot teach. She bickers at you when you do something wrong instead of actually TEACHING you the material.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have had Marten, Johnson, and Rotter as chem teachers. Rotter was by far my favorite. She does have a lot of (mini) homework, but it's usually just the notebook. You do NOT want to face the workload of other teachers if you think her load is high. She is very helpful, and if you don't understand something, just ask her. She's really funny and she has a sweet side. I loved her class, and the labs were really fun. I really wish I was still in honors, but it's time to leave Lowell.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A, better do well on her tests or else, you'll end up with a B. Her homework may get you stressed out but working hard on her homework and stuff does pay off. I stay up doing her homework and I get like 100%. She is nice, funny but sometimes scary. When you work on whiteboards, watch out!","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A very smart person, she assigns a lot of homework and does not teach that much. I think that she has NEVER answered any of my questions, but instead always says \"what do you think.\"","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very genuinely caring teacher, super approachable if you ask questions after class and after school! Truly makes an attempt to help students understand chemistry. She clearly puts a lot of effort into making the class click. Workload can be high some times but overall very rewarding experience. She's amazingly knowledgable. Her sarcasm is also unbeatable.Submitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her class is an easy A as long as you do all your work and do reasonably well on her tests/quizzes. She's willing to help you if you don't understand anything. However, she can be moody at times. One second she's happy, another she's cranky. Otherwise she's a good teacher overall but you'll be spending hours staying up doing her rlogs.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Too much work","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"her assignments are few and far between, but when she does give work its so hard because no one knows how to do it!! the class is so confusing and boring. and shes moody","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I didn't feel like I was learning much in her class last year. Reading logs are annoying and really seemed to be a waste of my time. In fact, that whole class was a waste.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took her for two semesters. Teaches by powerpoint, you've got to take notes. May have mood swings, occasionally humorous. She is VERY lenient on late work, but heavy workload. Posts everything on her website. Easy B or possibly A-, difficult A.Her explanations only occasionally work for me, but she frequently reviews the material. The only people that hate her are those who don't want to learn and are REALLY lazy, which you might be with Chemistry.Doesn't allow food.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She should try to make the class more personal and inject more color into her teaching methods. The rainbow gloves and hats should also go.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Rotter gives a lot of hw but its all on the calendar online so there's no excuse for not finishing them. Grading system is super easy, an \"N\" is 100% and \"R\" is 95%, quizzes are pretty easy too and the class overall is quite interesting I only need a 32% on the final to get an A in her class =)","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"about 3/4 the class has an A. retakes on tests, she explains the material so its easy to understand, but sometimes these preambles dont make sense","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She gives a lot of homework and overreacts a lot. A lot of her assignments seem pointless and take a lot of time.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice person, but she cannot teach at all! I barely learned anything in her class.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I previously had Trimble for first semester of chemistry and I barely passed. I'm talking about 1% from a D. So, at arena, I chose Ms. Rotter instead. It was the best choice I've made. Her class isn't too bad, except there is a lot of homework. However, it is easy to get a A/B if you complete all her rlogs, labs, and worksheets while getting Cs on tests and quizzes. I currently have an A in her class because of this. Just pay attention and take notes and complete homework.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you have no chance of taking Fong, then just don't even consider taking chem at all. Rotter doesn't teach for god's sake, and she expects you to learn everything from you homework-which is just reading the textbook. She makes you lug around a good 10 pound notebook that you have to make \"colorful.\" A good portion of your grade depends on that thing so... Effort. There is material on the test that she has never taught-which means, hooray beautiful test scores! Just don't. You'll regret it.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The class is slower paced than Trimble's but you'll learn just as much. Rotter is much more relaxed and approachable than Trimble is. The work is never back breakingly hard or too much because it will often be a continuation from topics discussed in class, but make sure to keep up your notebook! Also, she is very thorough with grading and reads everything that you write. make sure to definitely put in the work.Submitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MS. ROTTER IS AMAZING. her notes are way more helpful than the book, she's willing to help you if you're struggling, everything she teaches is direct, and she is SO COOL :D. take her! the rlogs preambles aren't even that bad.. ya'll needa chill","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"This class is an easy A if you just do the homework. You don't learn anything from reading logs, but her powerpoints (notes) are useful. Tests are generally easy, there's usually no tricky problems. Sometimes, she goes over the material so many times that it gets stuck in your head.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"While her class certainly frustrated me a times and overwhelmed me at others, the workload heavy but pretty manageable as long as you stay on top of it, and the quizzes are easy if you take the time to try to understand the concepts at home. The notebook is worth much more then the quizzes so as long as it's neat and complete (and colorful) you should be fine if you bomb a quiz. As for Ms. Rotter, sarcastic/intimidating in class but not lacking a sense of humor and helpful outside of class.Submitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"not much work. she doesnt do lectures, instead we make guesses and have class discussions on the topic... that we know nothing about. not a useful class","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's not that bad. i actually learned in her class from preambles, and it was really easy to get an A. reading logs and qps are a pain, but she always gives us at least 2 weeks notice before they are due. she's nice and remembers everybody's name.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A lot of people have complained about the work overload before. Over the years, the work has been sharply decreasing, and now i can call the amount of hw i have from her manageable. Plus a lot of people forgot the upside of the homework-it helps your grade if you bomb the tests! (which really aren't that hard either). Lectures are alright, teaches by powerpoint. Definitely consider taking her. In my opinion, the best chem honors teacher.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she looked nice at the beginning but thats before she gave out all this work. she doesnt answer ppl's ?'s clearly","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Don't take her. Reading logs and preambles are pointless and just extra work and a load on your back.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"gotta love the 100 page notebook and the amount of coloring & organization you need to learn chemistrySubmitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"completely hillarious, totally awsome. way better than fong. i do not understand chem at all, but you can still get an A or B, and her hw helps you understand. ilearned more from her than from my chem teacher last year. she is so cool, and makes class entertaining","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't even know where to start w/ Ms. Rotter. She assigns a strenuous amount of work. In fact, she assigned more work than my two AP classes combined!! If you're not into chemistry, and are not ready to work your tail off, do not take Ms. Rotter. Believe me, you will hate your life so much. Keeping up w/ her futile notebook assignments, especially her reading logs, were the worst. I'm sorry to say this, but I've never hated a class like this -- but that's probably just me b/c I hate science.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"took trimble first semester for reg chem and got a C. Rotter is better bc she has more assignments. She does assign way too many nb assignments, to get an R or N (95% or 100%), you must wirte a lot, being specific and colorful. Tests are pretty hard but can be retaken for a 75%. pretty easy B but a hard A. I had an A for much of the semester but her final dropped it to a B. I wish i had taken her for chem H, because its about the same as her regular class, and its weighted. TAKE OVER ROTTER","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A Had her for Chem 1. Her Rlogs pointless and time consuming. We have quizzes about every week which are straightforward and pretty easy, but we just don't get enough time. Her labs are irritating because you have to figure everything out urself. If you can, get Fong, but if not, just get her.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She may not be the easiest teacher, that doesn't mean she is the hardest teacher. I had her for regular chem, the workload was decent. Just take notes, listen during class, always ask questions, do your homework, read the book and ace at least 75% of the tests. I failed her final and still got an A","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THE READING LOGS ARE POINTLESS. She gives way to much work but shes understandable and her tests are easy. But if youre a procrastinator, dont take her class.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's okay i guess. shes kind of kidish but shes pretty easy. i hate her reading logs and QPs (questions and problems) herreading logs has to be in i saw/ i thought format. it sucks. you can make up her tests so thats good. mostly all group work. i suggest you find a good group","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Ms. Rotter for chemistry honors after I had Dr. Marten for a semester. There's a lot of busy work, and the course is pretty similar to her regular chemistry course. She has tests that basically just test you to make sure you're actually taking the time to learn the things in your homework. As far as chemistry h teachers go she's probably your best bet.Submitted by a student","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SHE NEEDS TO TEACH THE SUBJECT!!!! She makes us learn in groups, which is sucks because we have never learned anything. Grading is one of the better.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's really easy easy actually. I never studied for her tests and always got at least a B. As long as you do the homework, you can pretty much get an A in her class.","rating":3.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she makes us try to learn on our own. a lot of ppl don't like it, but sometimes that's what makes one think about the material more. she's an awesome person. real nice","rating":3.4,"version":1}],"rating":3.3999999999999946}},"__N_SSG":true}