{"pageProps":{"teacher":{"name":"Kevin Sullivan","departments":["Math","Computer Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Calculus AB","block":"3","semester":"Fall2014"},{"name":"AP Calculus AB","block":"5","semester":"Fall2014"},{"name":"AP Calculus AB","block":"7","semester":"Fall2014"},{"name":"AP Statistics","block":"8","semester":"Fall2014"},{"name":"Algebra 2","block":"6","semester":"Spring2015"},{"name":"AP Calculus AB","block":"3","semester":"Spring2015"},{"name":"AP Calculus AB","block":"5","semester":"Spring2015"},{"name":"AP Calculus AB","block":"7","semester":"Spring2015"},{"name":"AP Calculus AB","block":"5","semester":"Fall2015"},{"name":"AP Calculus AB","block":"7","semester":"Fall2015"},{"name":"Pre-Calculus","block":"4","semester":"Fall2015"},{"name":"Pre-Calculus","block":"8","semester":"Fall2015"},{"name":"AP Calculus AB","block":"5","semester":"Spring2016"},{"name":"AP Calculus AB","block":"7","semester":"Spring2016"},{"name":"Pre-Calculus","block":"4","semester":"Spring2016"},{"name":"Pre-Calculus","block":"8","semester":"Spring2016"},{"name":"AP Calculus AB","block":"5","semester":"Fall2016"},{"name":"AP Calculus AB","block":"7","semester":"Fall2016"},{"name":"Pre-Calculus","block":"4","semester":"Fall2016"},{"name":"Pre-Calculus","block":"8","semester":"Fall2016"},{"name":"AP Calculus AB","block":"5","semester":"Spring2017"},{"name":"AP Calculus AB","block":"7","semester":"Spring2017"},{"name":"Pre-Calculus","block":"4","semester":"Spring2017"},{"name":"Algebra 2","block":"4","semester":"Fall2017"},{"name":"AP Calculus AB","block":"3","semester":"Fall2017"},{"name":"AP Calculus AB","block":"5","semester":"Fall2017"},{"name":"AP Calculus AB","block":"7","semester":"Fall2017"},{"name":"Algebra 2","block":"4","semester":"Spring2018"},{"name":"AP Calculus AB","block":"3","semester":"Spring2018"},{"name":"AP Calculus AB","block":"5","semester":"Spring2018"},{"name":"AP Calculus AB","block":"7","semester":"Spring2018"},{"name":"AP Calculus AB","block":"5","semester":"Fall2018"},{"name":"AP Calculus AB","block":"7","semester":"Fall2018"},{"name":"AP Computer Science Principles","block":"2","semester":"Fall2018"},{"name":"AP Computer Science Principles","block":"4","semester":"Fall2018"},{"name":"AP Calculus AB","block":"5","semester":"Spring2019"},{"name":"AP Calculus AB","block":"7","semester":"Spring2019"},{"name":"AP Computer Science Principles","block":"2","semester":"Spring2019"},{"name":"AP Computer Science Principles","block":"4","semester":"Spring2019"},{"name":"AP Calculus AB","block":"8","semester":"Fall2019"},{"name":"AP Computer Science Principles","block":"2","semester":"Fall2019"},{"name":"AP Computer Science Principles","block":"4","semester":"Fall2019"},{"name":"AP Computer Science Principles","block":"5","semester":"Fall2019"},{"name":"AP Computer Science Principles","block":"2","semester":"Spring2020"},{"name":"AP Computer Science Principles","block":"4","semester":"Spring2020"},{"name":"AP Computer Science Principles","block":"5","semester":"Spring2020"},{"name":"AP Calculus AB","block":"8","semester":"Spring2020"},{"name":"AP Calculus AB","block":"7","semester":"Fall2020"},{"name":"AP Calculus AB","block":"8","semester":"Fall2020"},{"name":"AP Computer Science Principles","block":"2","semester":"Fall2020"},{"name":"AP Computer Science Principles","block":"4","semester":"Fall2020"},{"name":"AP Calculus AB","block":"7","semester":"Spring2021"},{"name":"AP Calculus AB","block":"8","semester":"Spring2021"},{"name":"AP Computer Science Principles","block":"2","semester":"Spring2021"},{"name":"AP Computer Science Principles","block":"4","semester":"Spring2021"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"Okay, i know there's a lot of negative comments about Mr. Sullivan, but he's really not a bad teacher, i had him for calc ab both semesters and i got a 5 on the exam! if you go to him for help, he can clear up a lot of things for you and that's mainly the only time i learned...it's kinda hard and boring to learn in class cus most of the time u dont even know what he's saying but if you ask him questions, you really can learn a lot! and plus he's a really nice teacher too","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"okay A in the class, 3 on the ap exam, which is making me retake calc in college right now because that wasn't good enough for science and engineering calculus. wish he would've taught better :(","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he talks too quiet so its hard to learn...at least in his Accel. class","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's really chill and nice =]","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Extremely funny and intelligent guy. Kinda boring but he's a great guy and you learn a lot if you try.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he will help if you ask. SO much cheating in his class. tests are hard, some very different from homework. my class wasn't very motivated. lots of self study for the AP","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My favorite math teacher at Lowell so far. His class is easy and very relaxed. Even though I have his class after a 2 hour break, I never not look forward to going. He's also an outdoors person, which is very cool.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Sullivan as a person is pretty chill and nice, but he isn't very good at teaching the material. Sometimes if you pay attention he is helpful, but other times he isn't clear. He is very smart but doesn't know how to explain things really well. He drops your lowest test score which is chill, but his tests are pretty hard. He also curves most tests and sometimes gives retakes so its not that bad. I managed to get an A the first semester of Pre-Calc, but the second semester is harder so I have B.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great person.. nice, never loses his temper.. tries to be a good teacher but is not clear, at all... take lots of notes in his class, read the text book on your own time, and ask questions!!! if you just try to pay attention in class you won't get good grades.. i got C's my first two semesters","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His way of teaching doesn't really help me in math.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a really nice and chill teacher. His lectures are boring and half the time, most people don't know what hes teaching or saying, but thats ok cuz on his tests, there are huge grade curves cuz a lot of people fail his tests.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"one of the nicest of teachers however he cant teach at all and what adds to the ttrouble is his tests are super hard. avergae grade in my class is like a c.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is not a very great lecturer, but you can learn everything by yourself and get an A. That's what I did.Submitted by a Parent","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"boring but nice","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ridiculous.....you never know what the hell is going on in that class. if you take him and go to another math teacher for help, you can can get a pretty easy A. Don't forget to bring your music player....you don't get your tests back until 3-4 weeks...hw is not due until the day of the test. tests are 85% of your grade. hw can count for up to 5% on each test. the final is 15%. the man you love to hate. This is a class where you gotta rely on yourself and friends.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you put in a decent amount of effort trying to understand his lectures (aka no daydreaming no sleeping NO senioritis), you can get an A in the class. I didn't feel too prepared for the AP but his occasional efforts of making jokes and sarcasm made the class for me.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"never had such a hard teacher before take mr.evans... imean seriously he is probably the nicest teacher n the whole school however his tests r super hard, he cant teach,","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher. Take him. His class is not that enthusiastic but you learn a lot and its not that hard. Seems like good prep for Calc BC","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP calc. Chill class, very grateful for that. He's willing to help if you ask. Tests ARE SUPER HARD. doesn't lecture on hard stuff, so its hard to learn. he's a nice guy. got a 4 on ap.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For accel math, i really had to get used to his lectures before i got good grades. In the beginning of the year, he was one of those \"study at home\" teachers, but as I became more accustomed, i felt like i was learning in his class. Lenient grader: looks at the work and effort you put in your tests and marks off poitns accordingly, and homework is extra credit (though you should to do, otherwise you have no chance at tests). He sometimes teaches off topic things, but hes a decent teacher.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ehh, debatable. He was okay. All I learned was that his nephew's name is Gizmo or Desmos because of the calculator. He's the type of guy who's funny but doesn't know he's funny. His lectures were kinda helpful if you payed attention. Nearly died 1st semester, but gladly got an A! Actually, thinking about it, he helped my pre-calc foundation or he made my math structure slightly better. Those who are not strong in math will have a hard time, Pre-calc, let alone, is hard. He makes you work.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's funny in a boring kind of way, like Dr. Marten","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pretty good teacher in some ways; he's kind, albeit boring during class lessons. If you're the type who likes lively teachers, Sullivan is not really the teacher you're looking for. He curves test grades and homework acts as extra credit. Homework is not due until the day of the test. The downside datum is that MOST of his tests are quite hard and require lots of work. However, he does give partial credit even if your answer is wrong or if work shown is not clear.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He really does want you to succeed though. He cares about his students (if you interact with him), and he's really nice. But, his tests are almost too easy, so you get tempted to slack off...","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pay attention in class, do your homework, and study and you'll be fine. He'll answer questions and play music. Overall very cool, but most people won't pay attention, and the class just ends up begging him for points on tests, which he usually gives. Pretty chill guy.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ok, his lectures are boring, but man, Mr. Sullivan is honestly brilliant. He's amazingly smart. People who say they can't learn b/c he talks to soft, ASK QUESTIONS. He'll answer all of them, and he'll help you individually. He knows what he's talking about he just REALLY absentminded sometimes. Also he's super funny in a subtle, kind of passive way. It's hilarious. You can sleep, he doesn't mind, but he DOES mind if you do hw for other classes. It's just that he usually won't notce if you do.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Nice guy, TERRIBLE teacher. I'm really good at math but I ended with a C (so did many others). He lectures for the entire period, but nobody has any clue what he's talking about, even if you try and pay attention. No one learns anything, and his tests are very difficult (everyone fails). If it's between him and Rosales, TAKE ROSALES!!!Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr sullivan isnt that bad. he may b boring, but if u listen u'll understand. if u hav anything u dont understand, just ask him n he can help u out. hes a chill guy. his class isnt even that hard.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Sullivan may be boring, and all, but he's a very nice guy. You can actually learn, if you tried. Ask him for extra help or extra credit, and you'll be fine. the point is, although sullivan is \"boring\", he's very approachable, and you don't have to worry about grades. Definitely recommend!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very easy. He gives plenty of extra credit assignments.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for PreCalcH in F06/S07. He's really soft spoken and doesn't always seem to know what he's doing when he lectures, but he knows the material. (If you don't understand, please ask him for help outside of class -- it seems to work wonders.) We definitely had a lot of freedom in class, though","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes okay, but its hard to understand him. either way i think hes cool cuz can sleep in his class.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy A. he does give hard test, but theres a huge curve for every test because the majority of the class fails them. wish he could just teach.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HE IS SO FUNNY but he does teach","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for the fall semester in 2010. As a freshman, I say he's a ok teacher. Most people think he's hard, because his voice is kind boring. So no one listen to his teaching in class. So that's why his tests are hard. He likes to test stuff he taught in class. So if you pay attention in class=A","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"absurdly boring, but extremely easy, if you have trouble understanding something, he sees nothignwrong with talking to you for an hour (or 2 or 3)","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HE IS AWSOME. I LOVE HOW HE GRADES. MR. SULLIVAN YOU ARE THE BEST.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sullivan is a really nice and chill guy. Easy B if you put in some effort. (The curves will help you.) Or, you can get an A if you don't let senioritis get to you. However, I didn't feel well prepared for the AP exam after taking his class.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"if u can actually not fall asleep with boring teachers, he is a good teacher and a nice guy. his tests are pretty hard but he grades on a kind of curve, which is SO HELPFUL!!! he explains if u have a question and he appreciates it if u show that u actually care and like ask for extra credit if your doing bad. i can see why people might not like him but i thought he was pretty good","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's really easy. you can sit in his class and do nothing. you don't even have to really pay attention, because you can just re-read everything in the book","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Doesn’t teach much and the curve is pretty nice... he’s aight ig one of the better teachers I would say. Very nice as well.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Is the most leanient and reasonable teacher out there.Extremely helpful.Makes tests reasonable,final is worth only half of one chap. tests.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ap Calulus, basically a self taught class. there's no discipline whatsoever, you basically do whatever you want. his tests are very hard, but I think he's a generous curver as I do have an A in the class. But he can't teach, gotta learn by yourself. If you want to learn, take Chan. He does jokes tho","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Probably the best choice for ab calc. It is extremely hard to learn from his lectures, but unlike gribler, he's really helpful one on one. webworks forces you to actually learn, unlike most homework. his class is boring. and it can be really frustrating, because he doesn't seem to understand how slowly we are actually learning. but he's super sweet, and takes effort into account on grading. if you pay attention, do your homework, and try you will get an A or B.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's BORING AS HECK! The tests are 100% of your grade and homework is extra credit! Half of my class always falls asleep and HE DOESN'T CARE! Bring a pillow!!!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a really nice guy and it's obvious he knows a lot about Geometry but his lectures aren't really interactive at all. It's not that hard of a class, but his tests are extremely inconstant. He curves a lot usually so if you can do better than most of the class you can get at least a B. Overall, not bad but you half to be good at learning things by yourselfSubmitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I feel like Mr. Sullivan is misunderstood. I had him for one semester of Algebra 2 and I managed to get an A in his class. His lectures may not be very interactive or interesting, but if you ask him for help everything starts to make a lot more sense! A lot of people sleep in class and then complain about how they have a really low grade...don't be one of those people. If you study for his tests, pay attention in class, and do your homework, you should be fine.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I used to tell people, \"NEVER take Mr. Sullivan! He is sooo boring! All he does is talk monotonously to the board the whole time and he takes forever to hand back tests!\" But he's actually a good teacher if you ask questions. He really does have a good sense of humor. He's extremely mellow and never seems to get mad. But the best part (my opinion) is that the homework is EXTRA CREDIT (up to 5% only)! Just get good test scores. Tests are kind of hard & always too long, but I love Mr. Sullivan! :)","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take him Boring but actually teaches and knows his stuff. Not that hard to get an A","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Sullivan is super sweet and kind! His lectures aren't always the best, but he's super clear when your ask him privately for help. For pre calc, he tells you the type of questions that are going to be on the tests the day before. Curves are reasonable and tests are fair game if you put in the effort to keep up with the homework.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sullivan is probably the worst geometry teacher ever. He never actually teaches the subject, and his tests are actually hard even if you study. people cheat in his class and get an A he doesn't see it, but for honest people, he grades unfairly and basically rewards people who make mistakes as long as everyone did it. While he curves his tests a little that test is worth 80-90% of your grade, so that doesn't matter. a subpar teacher in every way possible. His grading and teaching style suckSubmitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have him for AP Calc AB. If you are a hard worker and self-motivated, you will do extremely well in this class. I am not, so I got a C. He doesn't give any lower than C's (I think I deserve lower). It's too easy to slack off in his class because homework isn't due until test day and his lectures are very monotone and soft. Makes you sleepy. You have to learn from the book by yourself when you do your homework. Easy B, you have to work for the A.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Funny, but odd. Often confused and not very clear. EXTREMELY slow grader. Homework worth 5 points, tests are the main grade contributor. Gives time to do homework in class. Tests aren't very easy; few questions so if you miss a couple problems....... Collects homework before tests","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He seems like a super mellow version of mr. mana (that's saying a lot because mr. mana is pretty mellow already... mathematical high!). he starts his lectures without too much notice which confuses people. Kind monotonous voice (i swear, he reminds me of mr. mana that way too) but pretty damned funny.. \"How many questions are in the test? I don't know.\" and that's with a slowly ascending know.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr. Sullivan for my first semester of Accelerated Math, and his class has single-handedly made me lose my interest in math. His lectures were unclear and boring. I had to learn EVERYTHING by myself through reading and memorizing the textbook the entire semester. On the bright side, his tests are very easy. An A in his class is not difficult, but you will have to do all the learning by yourself.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Learned alot in his class...really tough tests. Kinda boring but extremely nice man ready to give help if needed.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sullivan isn't as bad as most say he is. Yes he can be boring at first but you will get used to it. He is actually one of the nicest teacher out there. If you pay attention you will actually learn. His tests aren't too bad, plus he curves SO MUCH. Homework is 5% of your grade, just do the hw, do","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"dont learn anything in his class, have no idea what he is talking about, and if you sit in a bad seat, and dont pay attention, ur screwed","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is very nice! However he is very hard and does not teach very well. I got a B in his class.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. sullivan might seem emotionless but he is the tightest teacher ever. once you get to know him he has a great sense of humor and he can help you with anything that has to do w/ math as long as you ask questions. he is an easy B but in order to get an A you either have to know math really well or spend time learning it from the textbook...dont rely on his lectures b/c you will prob fall asleep.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"excellent","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love mr. sullivan. he is so funny if you just listen to him. i adimit he's pretty vague when he lecures but gives everyone the attention they need. he's great and i love how he makes homework extra credit. it helped me a lot.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. sullivan is easy IF YOU PAY ATTENTION. he seems pretty boring in the beginning but if you listen carefully and get used to him it's not too bad.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's so boring. You don't have to do homework if u dont wnat to thogh","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His AB Calc class is excruciating! He's like a nagging parent, always pushing us to study. I get it, he wants us to do well, but why can't he let us study on our own time? If I want to screw myself by waiting until the last minute, that's my choice! Let me be an adult about schoolwork, better to start now than in college. Some of his tests are okay but he always puts something from the chapters we haven't learned yet.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for 2 semesters so far and his class is cool. He lectures basically, going over the material, and if you pay attention every step of the way, it helps. Take notes, do hw, look at the book, and tests should be okay. He gives students lots of freedom to do hw and talk (toapoint) in class.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty chill class. just wish he could teach better. its not our fault that we fail tests. he claims that we dont try hard enough but its due to the fact that he cannot teach.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"just wish he could actually teach. none of us get what he is lecturing about, but when it comes time for a test we end up doing bad because he doesnt teach. none of us are even prepared for the ap test.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Mr. Sullivan! I had him for precalc. He's a great guy. I would recommend him if A.) you are already a decent math student and B.) you can ask questions and make the personal effort to understand concepts. If neither of these apply for you, (or you just want an easy A) then take someone else. I got As on most of his tests with a bit of effort but a B is easy to achieve. Also he curves the tests a lot so if you can do just SLIGHTLY better than your classmates then you can get good test scorSubmitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a cool guy, but not that great at teaching. Brownie points for trying though. Just do all your homework and TRY to listen to his lectures. If you can't follow along, pretend you are, and guess at his questions....","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"All Students have to take Mr.Sullivan, cuz he is the best. He gives a lot of tests,which I ace, and extra credit.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"you should take him!! hes good...and we have interesting discussions in class(not about math). talks to himself!!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"okay i don't know what kind of mr. sullivan you guys are talking about. but he is seriously a horrible teacher. but i constantly feel sorry for him. he's been through a lot this semester.. and he's a reck. he never returns our tests and homework .. he doesn't give lectures, he cannot control the class... he's very disorganized. but nonetheless, he is a very nice person and will help you if you ask.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes NOT easy, but hes NOT hard. homework is extra credit. the whole grade is the test, but theyre are really HARD. kinda boring at times, but he knows his stuff","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sullivan is actually a really nice teacher. Even though his lectures might not be the clearest, he still tries hard to help his students by pushing them to do work. He even offers time outside the classroom if they need more tutoring. It's really just based on your effort, especially for Calc AB, that determines your grade. Most of the time he has huge test curves. But don't rely on those as reasons to slack off. And keep up with homework because that's what most tests are based on.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr sullivan is a nice guy, but sometimes he can be boring, and that just gets you to sleep. other times, it's hard to understand what's he's talking about or what he's doing. and it is true, it takes FOREVER to get your tests back. for me, one of those tests were about 2 months! -not exaggerating here- but overall he's still a nice guy, so you could cut him some slack, and he'll teach you personally if you ask and say you don't understand things (sometimes say you should go ask your groupmates).","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class is awesome and really easy unless you're one of those really uptight people that value \"learning.\" Oh and don't take his class unless you have friends in there with you or it'll be really boring.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy, but kind of boring. he let me eat in class and do homework for other subjects. grading method is lenient and homework is extra credit!!!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"never gives us a test back, and all of his tests have various questions from previous chapters, so you never know if you get the questions right. tests make up all of your grade, so thats tough. hes so boring in class, doesn't teach us anything - we have to do all the learning","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took him for Pre-Calc. His lectures are crap but if you ask him questions separately he's helpful. His tests are multiple-choice which are much easier. He only curves a little so don't get your hopes up. Let's you sit with your friends if you ask. Lot of homework but you can do it during class. His class is pretty chill, just need to know basic concepts.Submitted by a student","rating":3.3,"version":1}],"rating":3.300000000000005}},"__N_SSG":true}