{"pageProps":{"teacher":{"name":"Kristin Lubenow","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Economics","block":"2","semester":"Fall2014"},{"name":"AP Economics","block":"4","semester":"Fall2014"},{"name":"AP Economics","block":"6","semester":"Fall2014"},{"name":"World History","block":"8","semester":"Fall2014"},{"name":"AP Economics","block":"2","semester":"Spring2015"},{"name":"AP Economics","block":"4","semester":"Spring2015"},{"name":"AP Economics","block":"6","semester":"Spring2015"},{"name":"AP Economics","block":"8","semester":"Spring2015"},{"name":"AP Economics","block":"2","semester":"Fall2015"},{"name":"AP Economics","block":"4","semester":"Fall2015"},{"name":"AP Psychology","block":"6","semester":"Fall2015"},{"name":"AP Psychology","block":"8","semester":"Fall2015"},{"name":"AP Economics","block":"2","semester":"Spring2016"},{"name":"AP Economics","block":"4","semester":"Spring2016"},{"name":"AP Psychology","block":"6","semester":"Spring2016"},{"name":"AP Psychology","block":"8","semester":"Spring2016"},{"name":"AP Economics","block":"6","semester":"Fall2016"},{"name":"AP Psychology","block":"2","semester":"Fall2016"},{"name":"AP Psychology","block":"4","semester":"Fall2016"},{"name":"AP Psychology","block":"8","semester":"Fall2016"},{"name":"AP Economics","block":"6","semester":"Spring2017"},{"name":"AP Psychology","block":"2","semester":"Spring2017"},{"name":"AP Psychology","block":"4","semester":"Spring2017"},{"name":"AP Psychology","block":"8","semester":"Spring2017"},{"name":"AP Economics","block":"2","semester":"Fall2017"},{"name":"AP Economics","block":"4","semester":"Fall2017"},{"name":"AP Psychology","block":"6","semester":"Fall2017"},{"name":"AP Psychology","block":"8","semester":"Fall2017"},{"name":"AP Economics","block":"2","semester":"Spring2018"},{"name":"AP Economics","block":"4","semester":"Spring2018"},{"name":"AP Psychology","block":"6","semester":"Spring2018"},{"name":"AP Psychology","block":"8","semester":"Spring2018"},{"name":"AP Economics","block":"2","semester":"Fall2018"},{"name":"AP Economics","block":"4","semester":"Fall2018"},{"name":"AP Psychology","block":"6","semester":"Fall2018"},{"name":"AP Psychology","block":"8","semester":"Fall2018"},{"name":"AP Economics","block":"2","semester":"Spring2019"},{"name":"AP Economics","block":"4","semester":"Spring2019"},{"name":"AP Psychology","block":"6","semester":"Spring2019"},{"name":"AP Psychology","block":"8","semester":"Spring2019"},{"name":"AP Economics","block":"2","semester":"Fall2019"},{"name":"AP Economics","block":"6","semester":"Fall2019"},{"name":"AP Economics","block":"8","semester":"Fall2019"},{"name":"AP Psychology","block":"4","semester":"Fall2019"},{"name":"AP Economics","block":"2","semester":"Spring2020"},{"name":"AP Psychology","block":"4","semester":"Spring2020"},{"name":"AP Economics","block":"6","semester":"Spring2020"},{"name":"AP Economics","block":"8","semester":"Spring2020"},{"name":"AP Economics","block":"5","semester":"Fall2020"},{"name":"AP Economics","block":"6","semester":"Fall2020"},{"name":"AP Psychology","block":"2","semester":"Fall2020"},{"name":"AP Psychology","block":"8","semester":"Fall2020"},{"name":"AP Economics","block":"5","semester":"Spring2021"},{"name":"AP Economics","block":"6","semester":"Spring2021"},{"name":"AP Psychology","block":"2","semester":"Spring2021"},{"name":"AP Psychology","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-01T23:13:03.226Z","text":"i never thought i'd enjoy an econ class so much. like the other reviews say, she's an amazing teacher who also cares about her students' lives. my favorite thing about her class is how she often relates the concepts we're learning in class to current events and helps us understand why our economy is the way it is.","rating":5,"version":0},{"timestamp":"2020-05-01T22:47:38.419Z","text":"Had her for AP Econ, and she's hands down one of the most sincere and respectable teachers I've had at Lowell. She truly cares about all of her students and often checks in on not only our understanding of the concepts we're learning but also just on our lives to see if we're doing okay. \n\nShe's open to questions during class, after class, and during office hours. Ms. Lubenow actually explains topics rather than just confusing you more with her explanations. \n\nI personally think she's really flexible with grades since she allows extra credit and test corrections. Overall, I think you would have a great time in her class if you put in just a little effort to study for the tests and do the assignments on time.","rating":5,"version":0},{"timestamp":"2019-09-21T04:59:03.010Z","text":"I’ve only had her for a month so far But let me just say: she is the best teacher I’ve ever had IN MY LIFE. She emits warmth, and kindness in this loving and protecting motherly way. I want her to be part of my family I love her so much. Plz be my aunt Mrs lubenow! ","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty good teacher for AP econ. homework/no hmwk option's great for lazy seniors.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Sweetest female teacher to ever walk the hallways of Lowell. If you respect her, she will have the same respect for you, no doubt about it.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Lubenow is amazing(: AP Econ isn't the greatest subject, but she is always there to help out. She cracks the funniest jokes and grading isn't all that hard. Just show up, pay attention and you'll be fine. Great teacher for seniors.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A very cool, real teacher. Tries to keep class hip, fun, and entertaining with various games, jokes, and activities and succeeds.(AP econ) Def one of my favorite teachers I've had at Lowell. Her class has been one of he lases i would look forward to everyday and will remember forever <3(this is a male).","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is such a good teacher.... I'm so sad I could not get her 2nd semester for AP econ.She knows her stuff, is nice, exam difficulty is medium.. I mean honestly she's the perfect teacher.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is understanding and nice. She likes to joke around and make the class laugh. She makes you speak in front of the class A LOT.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a pretty good teacher. Gets moody at times and fed up with lazy seniors. AP Econ is easy because of \"test corrections\" which boost your grade a ton. Her crude jokes get pretty tiresome though... She tries a little too hard when making jokes that she thinks appeal to the class. Overall, not bad","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Wow, sociology is sooooo easy with Mrs. Lubenow, probably the easiest social sciences A you can get. Not much work and the first test was a take home.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Love this class. AP Econ is great. I learned a lot and this class is fun with lots of capping on pretty much everyone. The bomb!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"OMG. MY FAVORITE TEACHER EVER!!! i liked her more than spellicy. i know its hard to believe, but you dont have to do any work in her class. but the great thing is, you learn A LOT. i felt really confident when taking APs, and knew the majority of the quesitons. I LOVE YOU MS. LUBENOW!!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's so cool. She wasn't THAT easy, but she has a great personality and I really enjoyed her well-paced class.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had her for Modern World and AP Psych. Extremely knowledgeable and funny. One of my favorite teachers and loved her class :)Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MS LUBENOW SO MUCH SHES LIKE A SECOND MOTHER TO ME. she always gives you a hug or asks if you're okay, she always makes sure that we understand the material. also she lets us do test corrections (you get half point back). 10/10 recommendSubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"GOOD TEACHER. YOU LEARN A LOT EVEN IF U SLEEP THROUGH CLASS. JUST GO TO CLASS and u will do fine...","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had her for modren world, last semester. She was probably one of the best teachers I've ever had. Her classes are always fun, with a lot of special activities/reenactments, etc. Her tests are pretty easy for me, but i know people who don't like them. Take Her! Seriously. You will not regret it.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Have her for modern world history. She's okay. She calls on people at random and gives a lot of group projects. Overall, she's a good teacher but I know there are better history teachers at Lowell.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Lubenow is an amazing teacher. She cares so much about her students, and is really good at teaching AP Psych. I 100% recommend taking herSubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Lubenow is like an underdog teacher. People don't really who she is even though she's been a teacher for quite a while BUT SHE'S SUPER NICE AND MOMLY AND CHILL & FUNNY. I'm SO lucky to have her for AP psych even though I had 12th pick!! She's way too awesome to still be available for 12th pick. Tests are kinda hard (I don't like psych tho) but there are test corrections and extra credit opportunities. I hate Pysch lectures but she's a lovely teacher. Take her!Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good teacher who makes sure you understand the concepts","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST TEACHER FOR ME THIS YEAR! GO LUBENOW! NEVER A DULL MOMENT!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lubenow is definitely a cool teacher! Her class never gets boring, and she takes the time to get to know her students. However, the tests are usually very hard and require a lot of study time. She also runs through her lectures very quickly and I have a hard time keeping up and recording all the necessary information. Despite this, she is a good teacher overall and I'd recommend.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mrs. Lubenow is amazing! She's a fun teacher that you can also learn from. It's sad that she didn't teach World History this semester, but I would highly recommend getting her for your world history teacher.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Though she's new to teaching AP Econ, she did an excellent job.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Lubenow gives me a combination of teenager and mother feel. The way she jokes around makes us feel like she's one of us. The mother side of her is seen when she squats down to help you when you're struggling. Her class is somewhat based on effort. If you try getting an A shouldn't be that hard. You learn a lot in her class. The only bad thing is that sometimes she talks so fast, it's hard to follow. It helps to review notes daily. It will help you understand the class better.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I was surprised by how much I learned in her class even though I slept through most of her lectures. Ms. Lubenow prepares you very well for the AP Economics test even if you don't feel like you are learning. When I was reviewing for the AP, I actually remembered a lot of the material from her well-paced, comprehensive lectures. She also provides a no homework option for lazy seniors (myself included) and is quite liberal with extra credit and test corrections. With minimal study, an easy A.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AWESOMEEEEEEEEEEEEEEEEEEESubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She was a great teacher for my senior year. I'll never forget her! Sorry my class was a hassle.Submitted by a student","rating":4.6,"version":1}],"rating":4.639999999999998}},"__N_SSG":true}