{"pageProps":{"teacher":{"name":"Kristen Mitchell","departments":["English"],"semesters":["Spring2016","Fall2016","Spring2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"English 1","block":"1","semester":"Spring2016"},{"name":"English 1","block":"5","semester":"Spring2016"},{"name":"English 1","block":"7","semester":"Spring2016"},{"name":"English 2","block":"2","semester":"Spring2016"},{"name":"English 2","block":"6","semester":"Spring2016"},{"name":"English 1","block":"5","semester":"Fall2016"},{"name":"English 2","block":"1","semester":"Fall2016"},{"name":"English 2","block":"7","semester":"Fall2016"},{"name":"The Novel","block":"2","semester":"Fall2016"},{"name":"The Novel","block":"4","semester":"Fall2016"},{"name":"English 2","block":"1","semester":"Spring2017"},{"name":"English 2","block":"7","semester":"Spring2017"},{"name":"English 2","block":"2","semester":"Spring2017"},{"name":"English 2","block":"6","semester":"Spring2017"},{"name":"English 1","block":"1","semester":"Spring2018"},{"name":"English 1","block":"3","semester":"Spring2018"},{"name":"English 1","block":"5","semester":"Spring2018"},{"name":"English 2","block":"6","semester":"Spring2018"},{"name":"English 2","block":"7","semester":"Spring2018"},{"name":"English 2","block":"2","semester":"Fall2018"},{"name":"English 2","block":"4","semester":"Fall2018"},{"name":"English 2","block":"6","semester":"Fall2018"},{"name":"The Novel","block":"1","semester":"Fall2018"},{"name":"The Novel","block":"7","semester":"Fall2018"},{"name":"English 2","block":"3","semester":"Spring2019"},{"name":"English 2","block":"4","semester":"Spring2019"},{"name":"English 2","block":"6","semester":"Spring2019"},{"name":"The Novel","block":"1","semester":"Spring2019"},{"name":"The Novel","block":"7","semester":"Spring2019"},{"name":"English 1","block":"5","semester":"Fall2019"},{"name":"English 1","block":"7","semester":"Fall2019"},{"name":"The Novel","block":"2","semester":"Fall2019"},{"name":"The Novel","block":"4","semester":"Fall2019"},{"name":"The Novel","block":"2","semester":"Spring2020"},{"name":"The Novel","block":"3","semester":"Spring2020"},{"name":"English 1","block":"5","semester":"Spring2020"},{"name":"English 1","block":"7","semester":"Spring2020"},{"name":"English 1","block":"8","semester":"Spring2020"},{"name":"The Novel","block":"2","semester":"Fall2020"},{"name":"The Novel","block":"4","semester":"Fall2020"},{"name":"English 2","block":"2","semester":"Spring2021"},{"name":"English 2","block":"4","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-20T23:13:39.465Z","text":"Pretty easy class, a lot of reading but not much other than that. Pretty boring definitely fell asleep a few times but she didn't notice :)","rating":4,"version":0},{"timestamp":"2020-05-07T00:51:47.114Z","text":"Nice teacher, grades hard on essays but gives really good advice. Pretty easy to get an A.","rating":5,"version":0},{"timestamp":"2020-05-05T17:23:08.796Z","text":"many class discussion. kinda boring but not the worse. A if you try","rating":4,"version":0},{"timestamp":"2020-05-05T03:15:40.826Z","text":"Ms. Mitchell is an average teacher. She is nice and friendly and gives out minimal homework, like reading and annotating or answering study guide questions. There are some essays, which she grades extremely harshly. She is strict about late work. You need to study for her quizzes. If you participate and put in effort, you have a guaranteed A.","rating":4,"version":0},{"timestamp":"2020-05-05T01:59:50.999Z","text":"My favorite teacher by far! Super nice, but she does play favorites. If you do become a favorite though, the class is an easy A.","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy and no worries, sometimes has bias but doesnt show that much. easy A as long as you do your workSubmitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's average. Since most of the English department consists of mediocre - below average teachers, Mrs. Mitchell should be one of your top choices. The only reason I took her is because I was her favorite. Overall, extremely easy B+ to B if you slack off A LOT. If you try, you will manage an A. Grades essays harder than Ms. Bajet. Ms. Bajet manages around +/-B's for average students and As for best. Mrs. Mitchell's grading is spread out. F's - A's. Surprisingly a lot of essays are below C.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really nice teacher that really helped me improve my writing and is a really nice person in general.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The class is laid back- some to none homework. All your work accumulates so essays aren't worth much (usually a B). She's strict about late work 50% or 0 but as long as you participate and are a good student, she'll probably let it go. She's really nice so don't be afraid to talk to her!!Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shes a really nice and friendly person. Open minded in class discussions and super down to earth. Moderate hw making essays a lower weight % of your grade.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is by far the most understanding english teachers there are. She is very flexible. You really jut have to do homework and do your work and you will get an A. she is an easy A and very lovable. Finals are always either a skit or silliloque. I love her and wish to take her again. I most defintely recommend her !!Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is very nice and she has helped me a lot with my writing. I heard she was a hard grader so I was afraid for my grade lol but surprisingly I got an A on both of the essays we did but it definetly influenced that I asked her for help. Overall really nice teacher and you will learn to do better writing. Watch out for the pop quizzes, read when you are supposed to!!Submitted by a Parent","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She gave a project over spring break, non of the other teachers did. Also very unorganized and seem biased to a group project. Only problem is that people are busy over spring break. She just wants to chill over spring break and not grade anything. Also she can't really plan things out right. Spends most of the time with one essay and if she sees that you obviously didn't follow her guidelines EXACTLY she'll give you an F (higher if your lucky)Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Mitchell is so unfair. She treats all of her students very unequally. She plays favoritism a lot!! She will most likely pick over Caucasian people over any other race. I've been in so many situations in which she would let students from other classes turn in their work late and then when it comes to me she would just give me a direct no. If you're going to be a teacher at least be fair. Not to mention how unorganized she is.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Although Ms. Mitchell is the easiest English teacher you can get in Lowell besides Mr. Hereford she does play favoritism wether by class or by students. Her quizzes are pointless. I had her last semester and she WILL assign quizzes just for not participating. RIDICULOUS. Don't expect much she's just like any other English teacher in Lowell. But if I had to choose an English teacher to have for all my four years of English its Mr. Hereford.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for English 1 and she’s very interactive with the students and is always calling on people to share out but don’t worry, they’re fairly easy questions. she mostly teaches out of the book and she reads in a monotone voice and usually alternates readers around the room. barely has homework but will have random small quizzes. kind of a hard grader on essays.Submitted by a student","rating":3.3,"version":1}],"rating":3.643749999999999}},"__N_SSG":true}