{"pageProps":{"teacher":{"name":"Laura Telep","departments":["Math"],"semesters":["Fall2014","Spring2015","Fall2015"],"classes":[{"name":"Algebra 1","block":"2","semester":"Fall2014"},{"name":"Geometry","block":"1","semester":"Fall2014"},{"name":"Geometry","block":"3","semester":"Fall2014"},{"name":"Algebra 1","block":"2","semester":"Spring2015"},{"name":"Geometry","block":"1","semester":"Spring2015"},{"name":"Geometry","block":"3","semester":"Spring2015"},{"name":"Algebra 1","block":"4","semester":"Fall2015"},{"name":"Algebra 2","block":"2","semester":"Fall2015"},{"name":"Algebra 2","block":"6","semester":"Fall2015"},{"name":"Pre-Calculus","block":"1","semester":"Fall2015"},{"name":"Pre-Calculus","block":"3","semester":"Fall2015"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"i actually learned in this class! kind of. ms telep is great. its an easy class.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good teacher, but tricky tests that count for 80% of your grade. hw helps a bit.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not that hard as long as you pay atttention in class and do your hw. HW boosts your grades up too.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes ok for accel....theres homework everyday. she doesnt explain things very well. her test is very hard. its nothing like what you did in the homework. 1st sem of accel she was ok, but the 2nd sem when everything gets a lot harder, she cant explain stuff. kinda scary at times.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's a great teacher. just ask her something if you don't understand, and she will explain it to you. she's always offering to help. tests are always tricky, but doing the hw helps","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"not that great of a teacher, hard to understand and moves at a fast pace. tests account for a MAJOR part of your grade nd homework helps raise it very little. the tests are also a lot harder than regular material in the book","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Neri is a better teacher. The only reason why I survived the class is because I self-taught for every test. There's homework everyday but it doesn't help because there's always 2-3 hard questions that you just have to figure out.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Telep is so cool! nd u actually LEARN in her class unlike some other math teacher at lowell...... *ahem*","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Worse teacher of my life. Her tests arent even remotely close to what you do in class","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Telep is amazing. I had her for Accel in the fall and she taught concepts clearly and well and made them funny too. Her tests were somewhat challenging, and she checks the homework (for completeness) but teaches well and makes class enjoyable. She also knows her stuff - she can explain formulas and problems in the textbook. She preps well for the final, and does awesome one on one tutoring if you need it. She's clear, concise, and one of the best teachers in the Math department.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"telep is the best. knows how to keep us awake. makes sure that no one fails. take her!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Telep's class. Even though she sometimes doesn't know her material too well but she is willing to help out however she can. She has a deep passion for math. Hehes. I also like her test corrections a lot, basically you get half of points you missed on test if you get test corrections right","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mrs.Telep is pretty good at explaining Geo concepts and pretty helpful when you need a question answered. Goes over hw so you understand things you may have missed. Abit paranoid or strict about cheating. Straight forward tests a few tricky tests during the semesters","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I'm pretty neutral about Ms. Telep. She's usually pretty nice but the most trivial things can tick her off and then she gets sort of snappy. When you don't understand something she's willing to help you (when she understands your question). Homework every night, not that much though.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Telep is a great teacher, she genuinely cares about whether you understand the material and will go over it for you if you need. Yes, sometimes she takes too long going over homework, but if you're bored you can get started on the next nights homework. Not too much HW, usually 1-21 odd or something and you can usually get started in class if you finish your work quickly. Her teaching style is predictable and safe-feeling","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very good teacher. Pay attention and ask questions if you don't understand, she is very willing to help. She gives homework every night but its minimal, just keep up with the work (easy to do if you dedicate 20 minutes a night) and you have your A.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Terrible teacher. Condescending, unhelpful, rude, and treats her students like children. Her tests are VERY different from the homework. Only people naturally good at math do well. AVOID IF POSSIBLE","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She teaches very well!!! :D","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Telep is a great teacher. She might take a lot of time reviewing homework but she tries her best to go to the lesson right after and teach it. She doesn't assign much homework but it is a lot. It is usually 1-19 odd or something similar. If you have questions she could explain it and ask you questions to lead to the answer. Overall she is a really nice and good teacher.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's really nice and explains very well.Her tests can be a bit hard but if you study then you should be fine.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Extremely helpful and will teach you so many different methods to do certain math problems until you finally understand. She really wants her students to succeed and she's a really clear and thorough teacher. Also extremely nice!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"tests are hard but teaches pretty well","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is awesome!!! bestmath teacher evershe explains things well better than mr ambrose","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good teacher but her tests are very hard- she gives questions that are a lot trickier than those out of the book... during lectures,she moves really fast so u really have to pay attention...but good teacher overall & helpful on problems if u get stuck","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"okay teacher, not that great or awful, moves quick. doesn't explain much with words, and uses many examples to prove what she's saying. picky on what type of paper you use for homework.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's real good. If you're good at math then take her but if you're not don't","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Telep is able to explain anything to you if you have any questions, but she takes too much time. She ends up taking more time answering questions other than teaching us a lesson. It's becomes repetitive. She goes over homework from the previous night, it unfortunately eats up most of our time, so she rushes a lesson and assigns us homework that's based on the lesson we learned(ish) that day. The cycle repeats until we get a chapter test. The average class grade we got on last test was 64%.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice teacher. easy b. if you study n work hard, then youll get an A. the grade mostly counts on tests but also group work.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not a bad teacher at all. Funny and comfortable, but doesn't like it when no one is participating. Pretty hard tests. Hard to get your grade up, but also hard for it to go down. An easy steady B, but a hard A. Take her if you want to learn and you don't care about getting straight As.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. telep is a really nice and understanding teacher. she is very approachable, and teaches the material well. as long as you do all the homeworks before the test and study for her tests, you'll do fine.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she doesnt do the best at explaining things but is very nice and helps out the class when she can. her tests are hard. i did all her homework but barely got a passing grade for her test because it had tricky questions and some things we didnt review that much.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Telep is one of the best math teachers you could ask for. She goes over everything you need to know. I thought her tests were easy, but a lot of people thought they were hard so yeah. You have to pay attention in class. Make sure you participate cause she gets mad if you don't.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice teacher. but doesnt really teach. overall.. EASY","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had straight B- in her class. but thats just me. she's willing to curve in her tests which really help ur grade. reasonable hw, boosts ur grade.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mrs telep is way cool. she makes math fun and is a very good teacher. she helps you if you don't get something and is very patient. she's also very nice.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is good at geo,and explains really well. sometimes moody. tests are pretty hard and you have to study. nice mosttimes, and doesnt always collect homework.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Telep for Accel 1 last semester. She is a tough teacher, but she's clear and fair. Her tests are hard, but not unreasonably so. If you have a question about your test or homework, you can talk to her in the Math Office, and she'll explain it one on one. Hard A or B, but I reccomend her.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"super super helpful and nice. kind of a hard class, but at least i learned stuff.... (unlike ms neri)","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I cannot begin to say how i value ms.telep as a teacher. She is a great teacher, and will work with you through everything. She wants all her students to succeed, and will go to that extra mile to make sure that everyone does succeed. Her tests are clear, and on exactly what you learned. Occasionall","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"DONT' TAKE TELEP!! Tests are worth 80% of your grade, & are hella hard. She expects you to know much more than she teaches. She doesn't curve, and is hella mean if you go to her for outside classroom help. I HATE HER!! She assigns helal hwk each night but collects randomly, each hwk worth like 5%","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's soo cool and also great teacher. Her enthusiam is contagious.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. telep is actually a really cool math teacher. she has a soul.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had for Geo 1 and received a final B. Ms. Telep was one of those hard teachers in my opinion you had to adjust to when you get to Lowell. You really have to study for her tests and she sometimes throws in review problems or outside the box thinking type. She sometimes gets moody for no reason and it could be scary asking her questions sometimes. During back-to-school night, she told the parents to expect their kids to receive a low grade in Geo. She counts sports as absences sometimes.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Telep is actually my favorite teacher at Lowell. She is challenging enough to not be boring and reasonable at the same time. She's clear and basically the best person ever.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms.telep is an awesome teacher, but i didn't understand much in her class. plus, her tests are so hard. you need to work extra hard to get that A.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Telep is Amazing! I got a B in her class but I learned so much this semester and I owe it all to Ms. Telep. She worked with me but didn't spoon feed the material. I feel like I earned the knowledge. The classroom was a 'no nonsense' environment that was excellent for serious learning.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cool teacher who actually counts homework for 20% of grade, she also drops your lowest test grade at the end of the semester and if people do really badly on a test, she lets you do corrections for half the points you lost. Shes not easy though, she likes to throw trick questions onto the test. She does a lot of examples which really helped me and her explanations are usually clear. good teacher =)","rating":4.1,"version":1}],"rating":4.099999999999997}},"__N_SSG":true}