{"pageProps":{"teacher":{"name":"Lauretta Komlos","departments":["Social Science"],"semesters":["Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"English 1","block":"2","semester":"Spring2015"},{"name":"English 1","block":"4","semester":"Spring2015"},{"name":"English 2","block":"1","semester":"Spring2015"},{"name":"English 2","block":"5","semester":"Spring2015"},{"name":"English 2","block":"7","semester":"Spring2015"},{"name":"World History","block":"3","semester":"Fall2015"},{"name":"World History","block":"5","semester":"Fall2015"},{"name":"World History","block":"6","semester":"Fall2015"},{"name":"American Democracy","block":"2","semester":"Fall2015"},{"name":"American Democracy","block":"8","semester":"Fall2015"},{"name":"World History","block":"3","semester":"Spring2016"},{"name":"World History","block":"5","semester":"Spring2016"},{"name":"World History","block":"6","semester":"Spring2016"},{"name":"American Democracy","block":"2","semester":"Spring2016"},{"name":"American Democracy","block":"8","semester":"Spring2016"},{"name":"World History","block":"2","semester":"Fall2016"},{"name":"World History","block":"3","semester":"Fall2016"},{"name":"American Democracy","block":"5","semester":"Fall2016"},{"name":"American Democracy","block":"6","semester":"Fall2016"},{"name":"American Democracy","block":"8","semester":"Fall2016"},{"name":"World History","block":"2","semester":"Spring2017"},{"name":"World History","block":"3","semester":"Spring2017"},{"name":"American Democracy","block":"5","semester":"Spring2017"},{"name":"American Democracy","block":"6","semester":"Spring2017"},{"name":"American Democracy","block":"8","semester":"Spring2017"},{"name":"World History","block":"1","semester":"Fall2017"},{"name":"World History","block":"4","semester":"Fall2017"},{"name":"World History","block":"6","semester":"Fall2017"},{"name":"World History","block":"7","semester":"Fall2017"},{"name":"American Democracy","block":"2","semester":"Fall2017"},{"name":"World History","block":"1","semester":"Spring2018"},{"name":"World History","block":"4","semester":"Spring2018"},{"name":"World History","block":"6","semester":"Spring2018"},{"name":"World History","block":"7","semester":"Spring2018"},{"name":"American Democracy","block":"2","semester":"Spring2018"},{"name":"American Democracy","block":"1","semester":"Fall2018"},{"name":"American Democracy","block":"7","semester":"Fall2018"},{"name":"World History","block":"2","semester":"Fall2018"},{"name":"World History","block":"4","semester":"Fall2018"},{"name":"World History","block":"6","semester":"Fall2018"},{"name":"World History","block":"2","semester":"Spring2019"},{"name":"World History","block":"4","semester":"Spring2019"},{"name":"World History","block":"6","semester":"Spring2019"},{"name":"American Democracy","block":"1","semester":"Spring2019"},{"name":"American Democracy","block":"7","semester":"Spring2019"},{"name":"American Democracy","block":"4","semester":"Fall2019"},{"name":"American Democracy","block":"8","semester":"Fall2019"},{"name":"Ethnic Studies","block":"3","semester":"Fall2019"},{"name":"World History","block":"2","semester":"Fall2019"},{"name":"World History","block":"6","semester":"Fall2019"},{"name":"World History","block":"2","semester":"Spring2020"},{"name":"Ethnic Studies","block":"3","semester":"Spring2020"},{"name":"American Democracy","block":"4","semester":"Spring2020"},{"name":"World History","block":"6","semester":"Spring2020"},{"name":"American Democracy","block":"8","semester":"Spring2020"},{"name":"Ethnic Studies","block":"3","semester":"Fall2020"},{"name":"World History","block":"1","semester":"Fall2020"},{"name":"World History","block":"4","semester":"Fall2020"},{"name":"World History","block":"6","semester":"Fall2020"},{"name":"World History","block":"7","semester":"Fall2020"},{"name":"Ethnic Studies","block":"3","semester":"Spring2021"},{"name":"World History","block":"1","semester":"Spring2021"},{"name":"World History","block":"4","semester":"Spring2021"},{"name":"World History","block":"6","semester":"Spring2021"},{"name":"World History","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-12T08:53:45.502Z","text":"i had her for world history and she’s a very good teacher. Easy A and most of your grade is from the notebook check every grading period. we were a bit behind compared to the other classes but she probably the best world history teacher  ","rating":5,"version":0},{"timestamp":"2020-05-08T19:28:20.390Z","text":"Ms. Komlos makes history interesting and fun to learn. She is very caring towards all her students. She gives a fair amount of work. The class is easy, but you will definitely learn a lot from her.","rating":5,"version":0},{"timestamp":"2020-05-07T20:51:54.842Z","text":"Lots of homework, notebook teacher, easy A if you have a nice notebook, open notes final exam. (coming from a student who had her for mowo 2017-2018)","rating":3,"version":0},{"timestamp":"2020-05-06T20:05:00.869Z","text":"Ms. Komlos is one of the kindest teachers out there. She’s very considerate of the amount of work she gives, and made me really enjoy history. She would also be willing to help out if there are any questions, and she makes class really interesting. I would say that this class is definitely an easy A.","rating":5,"version":0},{"timestamp":"2020-05-05T03:10:55.846Z","text":"Ms. Komlos is the sweetest teacher I've had in so long. She's funny and kind and really cares about her students. There are notes and vocab every week along with a quiz that is super easy. She wants everyone to be able to succeed and the class is an easy A. The final is a breeze, it is open note. She has long lectures, but it's easy to sleep in her class if you're in the back. There are a lot of in-class notes.","rating":5,"version":0},{"timestamp":"2020-05-04T21:11:04.288Z","text":"class was fun interesting and she alright not hard all you do is Vocab and 2-3 pages of notes every week (takes around 60-80 min to finish 1 weeks worth of homework )","rating":5,"version":0},{"timestamp":"2020-05-04T00:27:39.073Z","text":"I like the way she teaches, but she gives an INSANE amount of work. 95% of my homework every night was hers. She only calls on students who know and love history, so she never called on me even though I sat in the front row, which I’m thankful for.","rating":2,"version":0},{"timestamp":"2020-05-01T23:07:34.159Z","text":"Wouldn't recommend taking her class. She gives the most work compared to every other amdem teacher, and it's all busy work. She also randomly calls on people every day to answer questions that you most likely won't know the answer to if you're not closely following the news or already confident in american history. The class itself won't be fun either since you'll be listening to her lecture nonstop or dealing with debates/socratics, and taking notes.","rating":2,"version":0},{"timestamp":"2020-02-01T18:58:37.419Z","text":"I had her last year for world history. She's a very sweet and understanding woman. I feel bad reading her past reviews because I know she does too. She seems to have decreased the amount of homework that is given over the years. Her class is very chill and overall actually pretty enjoyable. Tests are nothing too hard and notebook checks are fine if you've been keeping up","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is ok but does a lot of mindless notebook work. She hardly grades and often loses work. An overall easy class.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very helpful teacher and gets through a lot of different topics in fun and creative way. Very lenient project grader and the reading is very little compared to high level courses. Helps u be prepared do for the future and actually teachesSubmitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Komlos is super sweet and will hear you out, but she does give “busy work”, meaning her work isn’t that hard, but it’s an okay amount if you actually do your homework when it’s assigned. Highly recommend actually doing your homework and not letting it pile up or else it will seem like a ton of homework. Her homework consists of cornell notes, vocab, and lots of reading/annotating. Most of which you can copy off your friends if you learn that way. Projects are not many. Actually do your notebook!Submitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ggez, 5 min hw per daySubmitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is alright. She is a bit boring at times, but her grading scale is pretty good. She gives a lot of homework, but it is really easy. I finish it under fifteen minutes. When she gives quizzes, people don't have to study much for them. I just review what we did in class the past week during the three minutes she gives us to study and I still manage to get a 10/10. I recommend taking her for an easy A but if you want to learn, I don't recommend it.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Komlos is a quirky, hilarious, and overall a good World History teacher. She loved my class and our class became very close with her. Her quizzes are easy and so is the final. A lot of people complain about the amount of work she gives, but it isn't that bad if you actually does it when she assigns it. She can be talkative at times, but she is super nice and caring. I would recommend Ms. KomlosSubmitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a nice person, although u won't learn much. WONT PREPARE U FOR FUTURE ENG CLASSES. U HAVE TO TALK AND PARTICIPATE A LOT. I wouldn't say it's easy A I know. A bunch of people with Bs and Cs. Very boring class and she's disorganized and forgetful. If you eat in her class NOOOOOO. Also she hates when u don't know an answer she will REPEATEDLY CALL ON YOU OVER AND OVER. AND OVER.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very nice to students. Homework is minimal and quizzes are easy. She even gives us a few minutes to study for quizzes in class. Lenient grader. Can get a bit boring at times but not too much. Take her!","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I've always hated history. It has always been my worse subject. However, this is an easy class if you try. If you're like me who just doesn't do the readings and slacks off a little. You will manage a B. Quizzes are weekly and you have to do notebooks. Which are a pain. Don't take if you're not willing to commit to notebook grades and pasting everything in. An A is easy to get if you don't mind reading textbooks and packets and actually paying attention to note taking slideshows.Submitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Such a terrible teacher. I love history, but she makes me dread my modern world class everyday. She does not pronounce the names of historical figures because she is afraid the students will laugh at her, so half the time, the class is is like, \"who is she talking about?\" She shows so much favoritism to her daughter' best friend and does not learn the names of her students. Notebook grades are important but I have more worksheets than the textbook, which are so useless. HIGHLY DO NOT RECOMMEND.Submitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Komlos gets easily distracted and has a funny accent. She seems to really love all of her students. She grades super easily, except for notebook checks, which are graded by students of another block. Sometimes she assigns busy work which is really annoying. Extremely easy A. Has weekly quizzes that are only 5 questions long, but as long as you kinda pay attention to her, you'll be fine. If you don't sit in the front you can get away with doing other homework. I didn't learn much in her classSubmitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"An extremely easy class!!! just stay organized and consistently write in your notebook. She is a very nice women and she cares for her students. The class can get really boring though. Little workload","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I really enjoy the class she gave me the ghandi seat which is really cool and she greatly improved my knowledge on world historySubmitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lets start out with saying....... She's a nice person. Average-high amount of notebook work. Respects your way of writing ur essays unlike other english teachers. Grades pretty well. Quiz every Friday, but don't get scared. Quiz is on what u did in class for the past week and she gives u a few minutes to study on the day of the quiz. Pretty easy A unless u slack off on notebook. THE WORST PART IS THE DIALECTICAL JOURNALS FOR READING. HONESTLY, I DON'T GET THE POINT. But overall not a bad class.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is a nice person but definitely ruined the class for me with all the useless busy work,,,history used to be my favorite too!Submitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Komlos is a pretty easy teacher. She has this notebook thing which you may find lazy to do, but it teaches you to be organized. Her final is open-notebook. It's important to keep updating the notebook (aka attendance and paying attention) because writing is 50% of your grade, compared to tests which are only 20% of your grade. Take her if you can, very recommended. Her talks can get really boring and it's pretty east to sleep in her class.","rating":3.6,"version":1}],"rating":3.7839999999999985}},"__N_SSG":true}