{"pageProps":{"teacher":{"name":"Laurence Warshaw","departments":["Math"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Calculus AB","block":"1","semester":"Fall2014"},{"name":"AP Calculus AB","block":"3","semester":"Fall2014"},{"name":"AP Calculus AB","block":"1","semester":"Spring2015"},{"name":"AP Calculus AB","block":"3","semester":"Spring2015"},{"name":"AP Calculus AB","block":"1","semester":"Fall2015"},{"name":"AP Calculus AB","block":"3","semester":"Fall2015"},{"name":"AP Calculus AB","block":"1","semester":"Spring2016"},{"name":"AP Calculus AB","block":"3","semester":"Spring2016"},{"name":"AP Calculus AB","block":"1","semester":"Fall2016"},{"name":"AP Calculus AB","block":"3","semester":"Fall2016"},{"name":"AP Calculus AB","block":"1","semester":"Spring2017"},{"name":"AP Calculus AB","block":"3","semester":"Spring2017"},{"name":"AP Calculus AB","block":"1","semester":"Fall2017"},{"name":"AP Calculus AB","block":"3","semester":"Fall2017"},{"name":"AP Calculus AB","block":"1","semester":"Spring2018"},{"name":"AP Calculus AB","block":"3","semester":"Spring2018"},{"name":"AP Calculus AB","block":"1","semester":"Fall2018"},{"name":"AP Calculus AB","block":"3","semester":"Fall2018"},{"name":"AP Calculus AB","block":"1","semester":"Spring2019"},{"name":"AP Calculus AB","block":"3","semester":"Spring2019"},{"name":"AP Calculus AB","block":"1","semester":"Fall2019"},{"name":"AP Calculus AB","block":"3","semester":"Fall2019"},{"name":"AP Calculus AB","block":"1","semester":"Spring2020"},{"name":"AP Calculus AB","block":"3","semester":"Spring2020"},{"name":"AP Calculus AB","block":"1","semester":"Fall2020"},{"name":"AP Calculus AB","block":"3","semester":"Fall2020"},{"name":"AP Calculus AB","block":"1","semester":"Spring2021"},{"name":"AP Calculus AB","block":"3","semester":"Spring2021"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"He assigns homework without teaching you how to do it, so you end up stuck up on the problems at home every night.Tests are hard and doesn't give partial credit","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I was his best student,98%. No surprises: tests r straight forward (NO TRICKS like schulz or tommaney). Average grade in the class was around 84-85%. You decide","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's an Amazing teachers. Don't listen to those other previous ratings. He can teach, tell good stories, and is willing to help. What a great man! I recommend him over almost any math teachers.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good teacher. Class can be kinda boring (especially if taken after lunch).","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"So i have warshaw for advanced alg semester 2010-2011 and he's good and really chill. he lets his students know that he's availible if you need help and prepares you well for the test. the test are just homework problems but different numbers. ask everyday to go over hw problems. get him. the best !","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Warshaw is the most \"straighforwardist\" guy. For precal, everything was from the book. Even though your grade is almost entirely based on tests, he tells you exactly what kind of questions are on the test. And those questions are straight from the book.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His Pre Calc final was sooooo hard. I seemed way harder than he said. The class is not interactive at all. Reminds me of Sullivan except worse because you can't learn what he tries to teach. Take anyone else for PC","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool guy. he used to be a professional blackjack player, rocket scientist, and now a teacher. very nice and homework is due once every 2 weeks","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"everything's from the book, lessons and tests too, kinda boring too, but he doesn't care if you fall asleep in class. but better than a lot of the others","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr. Warshaw for Calc AB. He is probably one of the best math teachers at Lowell. He tells some of the most entertaining stories about life. Very reasonsable--tells you what to expect for tests (sometimes even gives you the exact same problem to practice on the day before, so take those very seriously), curves if needed, and explains lessons very thoroughly. He tries to help you and your grade as much as possible as long as you're picking yourself up too.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the most sought after pre-cal teacher.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome teacher...really helpfull...tests aren't too bad as long as u do ure hw (of which he collects 1 assignment every 2 weeks)If u need a pre-calc teacher take him!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Warshaw is the best teacher I've ever had at Lowell. He will meet with you after class whenever you need to. He also goes over exactly whats going to be on the test. I wish he was teaching precalc","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I went in thinking that he would be an enlightening math teacher, but he really wasn't... His tests were hard, only because it was easy to lose a lot of points on small details. He's a smart man, but I honestly struggled in that class and I don't know why. Wouldn't take again.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"tells interesting stories. i like him more than Mr.Mana! funny","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Warshaw has to be one of my favorite math teachers. He was always there to help and answer questions, and he tells you exactly whats going to be on the tests. He always lets you do homework in class. If you do the homework you'll do fine on the tests. Hes a funny guy.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is terrible for PC 1 H dont take him he doesnt teach/explain and expects you to know everthing. Take Sulivan easy but borring A. He grades hard and is unpredictable on test grading. Take anyone else.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is an experienced teacher AND student. Pre-cal1H. He knows how to do his job, and he tells us many stories and teaches in plain english. He WILL try to improve the class average if it is low. He grades tests ultra-fast too. Just DO THE HOMEWORK and you will do fine! If not, he tutors as well.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr.warshaw is a really good math teacher!!! he always help us when we needed help and he tells you what's going to be on the test.. take him if you can!!!!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really good teacher . questions on test are from homework. tells you what to study. best pick for advanced alg.!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a good teacher. I enjoyed his class. If you're stuck on a problem, there is always a easy way to guess on his tests. I got a B+","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Warshaw is AWESOME. seriously. he's a good teacher. he's really helpful and if you study, you'll do fine on his tests.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is an Ok teacher. there is HW every day and he goes way too fast to learn. he tends to let kids out a few minutes late and his tests are muck harder than the examples he shows you.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"definitely one of the best math teachers ive ever had. hes just really good. he will go out of his way to help a student understand, and goes over hw in class. tests and grading are very reasonable. awesome stories, and just overall really nice.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's sooo cool. He used to be a professional gambler. haha. he really teaches well, and his class is pretty laid back. he grades on a bell-curve (i think, unless he changed it), so that there will be only a certain number of A's in the class","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Warshaw is nice, but tends to waste way too much time with telling \"Stories\" even though pre-calc is an A-code class, and ends up going over time almost every single day. VERY annoying since i have an important class afterwards. He also writes 3 mod tests even though it's an A code class, and expects us to stay over time even if it's his fault for telling stories or doing too much homework explaining instead of know how long his lessons are. Also grades hard on tests.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he teaches straight from the book. sometimes it`s a little confusing, but overrall, he`s a pretty good teacher.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took him for second semester. He's pretty chill. He definitely prepared me well for the AP Exam. I don't think I would have gotten the same score had I not taken his class. Easy B if you don't slack off too much.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HOW IS TEACHING STRAIGHT FROM THE BOOK GOOD?!? THAT MEANS THE TEACHER CAN'T TEACH. WHY GO TO CLASS WHEN WHAT YOU WILL LEARN IS IN THE BOOK.REMINDS ME OF TOMMANY","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his class is not very interactive. In order to learn, you must ask him the questions. If you say hes a bad teacher because he doesn't explain how to do the homework, you can always ask him how to do it the next day.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a cool teacher. He tells stories sometimes before starting class, pretty funny. He teaches straight from the book...doesn't really show he knows what he's teaching..he gives partial credit on his tests. He assigns homework everyday but only collects 1 homework assignment on each test day, every two weeks, which isn't really a great way of pushing us to learn the material considering most of us do all the homework the day before the test 'cause he never checks it.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Yes, he teaches a lot from the book. But he's a great guy and if you're having trouble, just ask! He helped me so much after class when I didn't get something.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for AA and personally i loved it. He does go fast, but if you just seriously pay attention for the two mods and ask him questions you'll be alright. His tests are okay, but he always puts on one hard question and if you don't get it, you get a \"B.\" I got a B in the class but i learned a lot. Good for AA. He tells great stories.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Too bad he's not coming back next semester, wish u well on your heart surgery. Such a good teacher ;(","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great Teacher. Workload is fair. Tells awesome stories sometimes. Grading is also fair, sometimes even lenient. Goes over homework when even needed and answers questions. * 12/11/10 * 5 * 4 * 4 * Too bad he's not coming back next semester, wish u well on your heart su","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Yeah, His lectures are boring, and he doesn't go over his stuff very well. But he's nice.He's willing to help on his off mods and lets you eat in class/sleep","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"This guy is too good at life. Very good calculus explanations and tells you exactly whats on the tests, no games no tricks. Gives a story every so often about his life adventures like retiring when he was 20 to go live in the woods. Unfortunately only teaches part time. Good luck getting him if u have a bad pick ripSubmitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Warshaw is far and away the most reasonable teacher at Lowell. his class actually makes sense: lecture based, with a chapter test following each unit. he collects homework randomly so that you don't know which ones to skip. it's possible to get away without doing a lot of hw, but i wouldn't recommend it. homework accounts for ten percent of your grade. the rest is quizzes and tests. difficulty depends on your math abilities. he is always happy to help you understand stuff, but don't EVER cut","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His tests are unpredictable. He doesnt teach and expects you to know everything","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"warshaw helped me regain all the confidence in my math abilities after a dreaded semester in sullivan's class. seriously take him for AB. his class is an easy A and i got a 5 on the AB exam.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Practically does your homework for you everyday on the board. Is boring sometimes but seriously ask him to tell u a story about when he was a gambler- VERY FUN!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took him for PC1H. He does teach and I don't see how his tests are unpredictable. Most of the questions are just like the homework problems, but with different numbers. He does go fast sometimes but if he thinks that he hasn't covered the material well enough, he'd teach it again the next day. He goes over the previous day's homework anyways. Just do the homework.","rating":4.2,"version":1}],"rating":4.199999999999998}},"__N_SSG":true}