{"pageProps":{"teacher":{"name":"Lisa Hong","departments":["Math"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Algebra 1","block":"1","semester":"Fall2014"},{"name":"Algebra 1","block":"5","semester":"Fall2014"},{"name":"Geometry","block":"7","semester":"Fall2014"},{"name":"Pre-Calculus","block":"2","semester":"Fall2014"},{"name":"Pre-Calculus","block":"6","semester":"Fall2014"},{"name":"Algebra 1","block":"1","semester":"Spring2015"},{"name":"Algebra 1","block":"5","semester":"Spring2015"},{"name":"Geometry","block":"7","semester":"Spring2015"},{"name":"Pre-Calculus","block":"2","semester":"Spring2015"},{"name":"Pre-Calculus","block":"6","semester":"Spring2015"},{"name":"Algebra 1","block":"1","semester":"Fall2015"},{"name":"Algebra 1","block":"5","semester":"Fall2015"},{"name":"Algebra 1","block":"7","semester":"Fall2015"},{"name":"Pre-Calculus","block":"2","semester":"Fall2015"},{"name":"Pre-Calculus","block":"6","semester":"Fall2015"},{"name":"Algebra 1","block":"3","semester":"Spring2016"},{"name":"Algebra 1","block":"1","semester":"Spring2016"},{"name":"Algebra 1","block":"5","semester":"Spring2016"},{"name":"Pre-Calculus","block":"2","semester":"Spring2016"},{"name":"Pre-Calculus","block":"6","semester":"Spring2016"},{"name":"Algebra 1","block":"5","semester":"Fall2016"},{"name":"Geometry","block":"2","semester":"Fall2016"},{"name":"Geometry","block":"6","semester":"Fall2016"},{"name":"Pre-Calculus","block":"1","semester":"Fall2016"},{"name":"Pre-Calculus","block":"7","semester":"Fall2016"},{"name":"Geometry","block":"2","semester":"Spring2017"},{"name":"Geometry","block":"6","semester":"Spring2017"},{"name":"Pre-Calculus","block":"5","semester":"Spring2017"},{"name":"Pre-Calculus","block":"1","semester":"Spring2017"},{"name":"Pre-Calculus","block":"7","semester":"Spring2017"},{"name":"Geometry","block":"2","semester":"Fall2017"},{"name":"Geometry","block":"6","semester":"Fall2017"},{"name":"Geometry","block":"5","semester":"Fall2017"},{"name":"Geometry","block":"7","semester":"Fall2017"},{"name":"Pre-Calculus","block":"1","semester":"Fall2017"},{"name":"Geometry","block":"2","semester":"Spring2018"},{"name":"Geometry","block":"6","semester":"Spring2018"},{"name":"Geometry","block":"3","semester":"Spring2018"},{"name":"Geometry","block":"5","semester":"Spring2018"},{"name":"Pre-Calculus","block":"1","semester":"Spring2018"},{"name":"Algebra 1","block":"2","semester":"Fall2019"},{"name":"Algebra 1","block":"6","semester":"Fall2019"},{"name":"Geometry","block":"4","semester":"Fall2019"},{"name":"Pre-Calculus","block":"1","semester":"Fall2019"},{"name":"Pre-Calculus","block":"3","semester":"Fall2019"},{"name":"Pre-Calculus","block":"1","semester":"Spring2020"},{"name":"Algebra 1","block":"2","semester":"Spring2020"},{"name":"Pre-Calculus","block":"3","semester":"Spring2020"},{"name":"Pre-Calculus","block":"4","semester":"Spring2020"},{"name":"Algebra 1","block":"6","semester":"Spring2020"},{"name":"Geometry","block":"2","semester":"Fall2020"},{"name":"Geometry","block":"3","semester":"Fall2020"},{"name":"Pre-Calculus","block":"6","semester":"Fall2020"},{"name":"Pre-Calculus","block":"7","semester":"Fall2020"},{"name":"Geometry","block":"2","semester":"Spring2021"},{"name":"Geometry","block":"3","semester":"Spring2021"},{"name":"Pre-Calculus","block":"6","semester":"Spring2021"},{"name":"Pre-Calculus","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-02T16:21:02.678Z","text":"Had her for Algebra 1. Her lectures are very clear and covers everything in that topic. If your group needs help during group work just ask and she'll sit down and cut it up in steps for you. Light homework, will go over every test. Always available outside of class to help, might not be the most interesting class but you learn slightly more than you need, and she has great handwriting and a sweet smile.","rating":5,"version":0},{"timestamp":"2019-11-14T03:14:41.354Z","text":"Have her for pre-calc. She jumps around the chapters a lot but it's not a bad thing. A few days every week she gives these half sheets of paper with problems you need to solve as a group. Tt's actually more fun to me than a lecture, but she does those at least one a week. Homework is collected randomly once a week (except one time she did it twice). She goes a little faster than other teachers, but that's to give us a day to study before tests, and a week before finals to review. She mostly teaches from the book which I think is a good thing. Her tests are actually very hard later on, but if she'll help you if you need it.\nOverall not the easiest A, but if you want to learn a lot I recommend taking her!","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took Ms. Hong for all of my freshmen year. Class was fun the first semester. Her tests can be difficult, but you're fine as long as you study. She can teach kinda fast. If you don't understand something, she'll gladly explain things. Bonus: she listens + gives pep talk. An overall awesome teacher.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Hong is a really awesome teacher! She is pretty easy but she teaches really well. Definitely recommend taking herSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Probably one of the only teachers I'll ever enjoy having at this school. She explains well. Take her.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good teacher, clear and all, test sometimes hard. speeds through chapters pretty fast. overall good teacher","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes a pretty good teacher","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"fun class","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"absolutely love her. explains everything until you completely understand the material. super helpful and hella chill. do youre homework but she gives you time in class. one of the best math teachers","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I can't stand her. She plays favorites a lot and doesn't bother to help anyone. -_-","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had her for both semesters of adv. algebra. really good teacher, explain things very well and if you didnt understand you can ask her to help you afterschool. She is strict and sometimes even intimidating. She is kind of scary sometimes if she is like really serious.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mrs. Hong is a great teacher! Sure she teaches straight out of the book, but if you listen to her in class and take her advice, you'll do well. If you just give up and decide not to do your homework or anything, well (big surprise) you won't do well. She can be kind of intimidating at times but that's only when you don't put in effort. Otherwise, she's really nice and funny.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is a great teacher, and she makes her teaching easy to understand. if you study for her tests it would not be too hard to get good grades","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had ms. hong for geo1. great, clear teaching. fair tests, drops lowest grade. really liked her class.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pretty easy class but your grade depends on your testsHer tests are sometimes tricky","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Ms. Hong for 1 entire year for both semesters and she was amazing. Her tests are kind of hard if you don't study or don't know the material. BUT if you do your homework and pay attention in class, you'll get a B or A for sure! She also always stayed over school to help me with the material I didn't understand and explained it until I knew it! MS. HONG IS A MATH SAVIORSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really nice teacher just read the book and you can get an A in her class","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"im taking her for off semester and she's just great, she will help u and make sure u understand, drops lowest test score and shes super nice and very good at explainingSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Hong is the best. I HATE MATH WITH A PASSION, but somehow, Ms.Hong makes geo really fun. She is super nice and is willing to help clarify topics for you in a class discussion or in a one on one setting. She is so under rated!! I had 12th pick and lucked out when I got into her class with 6 spots left! TAKE HER IF YOU CAN!!Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Hong is an the best teacher I have ever had. After getting a D in my first semester of Geo, I wasn't suppose to be able to take or pass the second semester but Ms.Hong is so clear that if u get anything below a C u must be sleeping in class P.S. The person under me is in my class XD","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She was a great teacher. sad to see her go. Tests were sort of hard, but she was nice.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Okay just wanted to say first of all I'm absolute trash at math. But Ms. Hong explains geometry really well and if you ask her questions or go to the math club on Wednesdays, she is more than willing to help. Her tests are hard, but that's only because she challenges you to think beyond equations and memorization. If you take her class, the department math final will be a breeze. I currently have a B but that's because I moved from Rosales to Hong hahaTake her class!!Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Hong! She's a really good teacher. She'll go over the problems you didn't get, and she teaches well. She's also good at basketball","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a pretty good teacher. Her tests hard hard sometimes, but she does give partial credit. In class, she tries to help out as much as she can. Overall, her class is actually quite enjoyable.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Class is pretty easy. She gives partial credit on tests and drops your lowest grade at the end of the semester. Tests are pretty easy, you just have to study and know the concepts.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She teaches well but your grade is based on how well you take her tests","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think everyone has a different experience with Hong. I found her class incredibly hard & challenging, almost to the point where I was happy with getting Cs on most tests (which I did). It was pretty challenging for me to keep up with her not only because she is super fast but because I was always eating my lunch in her class (5th block). I don't want to say she is horrible because she knows the material, but her tests are so diff than the textbook and what she says. Only good for bad pick.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I really like Ms. Hong. I learn a lot in her class and she is very cool!! She's very helpful and clear! Her tests are easy if you study for them! ;]","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"even though shes a nice teacher she can be unclear with what she is teaching at times. her tests are pretty hard and she actually checks your homework problem for problem and does not hesistate to mark something wrong.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's alright, not very goo dat explaining beyond the book, her tests have problems harder than the ones she did/gives for homework","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"can teach but grade depends on only test","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"her test are challenging. you have to understand the concepts and then apply them. you can't just cram and read the examples. Doing homework is a must. If you have any problems you can ask for help and she will try to help you as much as she can.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Hong’s class is hard. Your grade is only your tests and it’s easy to slip. You have to work at maximum capacity and study problems that are harder than the ones in the textbook. She is a great teacher though— extremely amiable, willing to help and friendly. You will learn in her class even if your grades are relatively low. She is worth it.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Hong is a very good teacher. She teaches from the book but explains well. Her tests are hard but she will drop your lowest grade. Somewhat rude when students ask questions bc she assumes you know it already from a previous math course.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Hong is one of my favorite teachers at Lowell. She is supper nice and friendly. She is very approachable, and you can ask her for extra help any time. She always goes over the homework in class. Her tests are hard, and she gives homework every day. Overall I think she is a great teacher, she really cares about her students.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Miss Hong is awesome; she explains things in a very easy-to-understands way, so you almost always understand the lessons. If you don't understand anything, she has a lot of office time when you can go see her and she will help you until you get it. Her homework is light, and you get time to do it in","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Hong is super sweet and continues to remember my name and greet me in the hallways. I kind of slacked off towards the end of the school year, which hurt my grade but was not really her fault. She rarely collects homework and goes over it in the beginning of class so you can get away with not doing it sometimes.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"LOVE her! she's my reg teacher and my geo teacher. she's amazing, really helps you learn. I will definitely take her again! but, 75-80% of your grade is tests. but with her- no problem acing tests.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a really nice teacher who's definitely not threatening at all. She'll help you when you need help, and answer all your questions. She gives homework everyday, but that's okay because she gives time in class. Tests every other week but she explains well, so it's alright.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I absolutely hated math before taking Ms. Hong's geometry class. Now, when someone asks me what my favorite class is, I instantly say geometry. For such a long time, I've felt dumb for not being \"good\" at math. I'd spend hours crying in frustration over a single problem. Because of her, not only have my math skills gotten much better, I've become more confident in myself. Ms. Hong is also REALLY REALLY COOL. So cool that you will want to buy her a lifetime supply of boba.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Hong is a good geo teacher. She is very nice, and explains the material clearly. Homework everyday, but a pretty manageable amount. Always goes over/explains homework, and tests aren't too hard if you study. She also offers to stay after school everyday to help students with homework if you need. I really recommend her class!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I would highly recommend Ms. Hong. I had her for Algebra 1 and she covered a wide range of topics. She teaches by the book, but also covers many types of problems the book does not discuss. Her teaching style is very straightforward and if you pay attention, you will most definitely learn from her; she leaves nothing out of her lessons! Do the homework every day and make sure you understand all concepts before the tests. If you need help, she is very willing.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy A but can sometimes be cranky, she hates explaining things again so you are scared to ask for help","rating":4.5,"version":1}],"rating":4.5}},"__N_SSG":true}