{"pageProps":{"teacher":{"name":"Lorna Galang","departments":["English"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"English 2 Honors","block":"2","semester":"Fall2014"},{"name":"The Novel","block":"3","semester":"Fall2014"},{"name":"The Novel","block":"7","semester":"Fall2014"},{"name":"Shakespeare","block":"4","semester":"Fall2014"},{"name":"Shakespeare","block":"6","semester":"Fall2014"},{"name":"English 2 Honors","block":"4","semester":"Spring2015"},{"name":"English and European Literature","block":"2","semester":"Spring2015"},{"name":"English and European Literature","block":"6","semester":"Spring2015"},{"name":"Film as Literature","block":"3","semester":"Spring2015"},{"name":"Film as Literature","block":"7","semester":"Spring2015"},{"name":"AP English Literature and Composition","block":"2","semester":"Fall2015"},{"name":"The Novel","block":"4","semester":"Fall2015"},{"name":"The Novel","block":"6","semester":"Fall2015"},{"name":"The Novel","block":"8","semester":"Fall2015"},{"name":"AP English Literature and Composition","block":"2","semester":"Spring2016"},{"name":"Film as Literature","block":"4","semester":"Spring2016"},{"name":"Film as Literature","block":"6","semester":"Spring2016"},{"name":"Film as Literature","block":"8","semester":"Spring2016"},{"name":"Shakespeare","block":"2","semester":"Fall2016"},{"name":"Shakespeare","block":"8","semester":"Fall2016"},{"name":"AP English Language and Composition","block":"3","semester":"Fall2016"},{"name":"AP English Language and Composition","block":"7","semester":"Fall2016"},{"name":"Film as Literature","block":"2","semester":"Spring2017"},{"name":"Film as Literature","block":"8","semester":"Spring2017"},{"name":"AP English Language and Composition","block":"3","semester":"Spring2017"},{"name":"AP English Language and Composition","block":"7","semester":"Spring2017"},{"name":"AP English Literature and Composition","block":"3","semester":"Fall2017"},{"name":"AP English Literature and Composition","block":"7","semester":"Fall2017"},{"name":"Shakespeare","block":"2","semester":"Fall2017"},{"name":"Shakespeare","block":"6","semester":"Fall2017"},{"name":"AP English Literature and Composition","block":"3","semester":"Spring2018"},{"name":"AP English Literature and Composition","block":"7","semester":"Spring2018"},{"name":"Film as Literature","block":"4","semester":"Spring2018"},{"name":"Film as Literature","block":"8","semester":"Spring2018"},{"name":"AP English Literature and Composition","block":"4","semester":"Fall2018"},{"name":"AP English Literature and Composition","block":"6","semester":"Fall2018"},{"name":"Shakespeare","block":"1","semester":"Fall2018"},{"name":"Shakespeare","block":"3","semester":"Fall2018"},{"name":"AP English Literature and Composition","block":"4","semester":"Spring2019"},{"name":"AP English Literature and Composition","block":"6","semester":"Spring2019"},{"name":"Film as Literature","block":"1","semester":"Spring2019"},{"name":"Film as Literature","block":"5","semester":"Spring2019"},{"name":"AP English Literature and Composition","block":"3","semester":"Fall2019"},{"name":"AP English Literature and Composition","block":"5","semester":"Fall2019"},{"name":"The Novel","block":"2","semester":"Fall2019"},{"name":"The Novel","block":"8","semester":"Fall2019"},{"name":"Film as Literature","block":"2","semester":"Spring2020"},{"name":"AP English Literature and Composition","block":"3","semester":"Spring2020"},{"name":"AP English Literature and Composition","block":"5","semester":"Spring2020"},{"name":"Film as Literature","block":"8","semester":"Spring2020"},{"name":"AP English Literature and Composition","block":"3","semester":"Fall2020"},{"name":"AP English Literature and Composition","block":"6","semester":"Fall2020"},{"name":"Film as Literature","block":"5","semester":"Fall2020"},{"name":"Film as Literature","block":"8","semester":"Fall2020"},{"name":"AP English Literature and Composition","block":"3","semester":"Spring2021"},{"name":"AP English Literature and Composition","block":"6","semester":"Spring2021"},{"name":"Film as Literature","block":"5","semester":"Spring2021"},{"name":"Film as Literature","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Galang!! I had her when it was her first semester teaching and had her for two more semesters after that. She's so approachable and will say hi to you in the hallways. One of the best English teachers at Lowell. She really knows how to relate to her students.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Galang is pretty laid back.. but IT'S SO HARD TO GET AN A IN HER CLASS. I've had her for two semesters and it's near impossible..... espeically when she does grammar tests. Also, she may be biased.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's so cool. participation is a must in her class. i got an A- without barely trying...","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"wonderful teacher. can't wait til im in ethniclit 2 & can get her again. 1 of the best english teachers& she is a new teacher. but doesn't matter, lack of experience doesn't show","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Galang is very fun and easy to talk to. Her work is mostly group assingnments and a few essays, which she grades pretty leniently. She gives you all the information you could possibly need for your essay in class, so if you listen and participate, they are a piece of cake.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a pretty hard grader.............her tests and quizzes are really specific so you need to know the material very well.......she had quizzes almost every day.....she made the final a lot harder than she said she would..............she can be nice sometimes but you really have to read the book over again to do well on her end of unit tests.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Galang! Her class is really chill, and she really makes English fun. She's very approachable too.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for Film as Lit. She's ok. Sometimes she has a bit of an attitude, but for the most part, she's a nice person. We had a lot of essays and some small quizzes at the beginning of class. She takes forever to grade everything, but she ends up giving a lot of B's on essays and tests. It was a decent class and we watched a good amount of movies. Even though I didn't even choose to be in Film as Lit, I don't regret staying in this class cuz I was able to learn some cool things about movies,","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty easy, not much hw. pretty easy on grading also. just pay a little attention in class and you'll pass. good english teacher.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mrs.Galang is the best! I learned soooooooo much in her class, and she is super cool! Can't wait for her classes next week!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"plays favorites sometimes, not too much homework, tests can be hard if you don't study","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"says shes chill. shes not. gives alot of homework compared to my other classes","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Okay teacher, plays favorites. She uses Sparknotes. Big time.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"love her. she's just like a student. but smarter.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Although I am about to give her a not so good grade.. she's really cool. I didn't learn in her class though =\\.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My experience with Galang is very different than those of the reviews below. She seems knowledgeable and is an approachable teacher, who is nice and not that difficult (given that you try). She is a rather fast essay grader, & when reading difficult texts, she tries to explain and help students understand as much of it as possible (Shakespeare plays were hell to me, & now they are quite manageable). However, she does give pop quizzes and makes you answer lots of reading questions (busy work imo)Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Uh....sorry but I have to disagree with the bottom guys comment. She IS nice, however....she isn't that easy. Don't underestimate kid. She's harder than you think she is. Although, if you try then it's an easy A of course.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Super awesome teacher! I got an A for the every trimester and the semester. She is so cool and her class isn't boring like the other teachers. Definetly choose her!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mrs.Galang is so AWESOME!Her classes are so much fun, and I just love being in them. Everyone should have her as their teacher.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Galang is a super chill teacher and is an easy A if you do the work, read the book and participate. If you don’t, your grade will tank.Ms. Galang is a super chill teacher and is an easy A if you do the work, read the book and participate. If you don’t, your grade will tank.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is a cool teacher. she is understanding and funny. sometimes she can go off topic, but it's a fun class.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is not as bad as everyone thinks. she gives an appropriate amount of hw, but she can be stressful at times. but other than that, shes an awesome teacher.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"galang is great. she's easygoing, funny, clear, and really knows the material. plus, she's the teacher sponsering family guy club!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took her for 10th English H. I've never hated English this much before.Her tests/quizzes are so detailed, asking you unimportant points from the book. She doesn't give you enough time to do her tests and she doesn't review you for her tests very well","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is alright, her final was hard! she gives a fair amount of hw but she grades kind of hard on the essays! She is nice but could be mean sometimes.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Well you definitely needa work for your A. She makes you act alot so yeah. Pretty nice teacher.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I learned a lot in her class. Although she takes forever and a day to grade essays, her grading system isn't too bad. Participating will only raise your grade and place you on her favorites list. If you don't enjoy participating, there's nothing to worry, it will not lower your grade.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very nice teacher. her quizzes are annoying, but luckily they are not a large portion of your grade. her essays are graded somewhat harshly. her tests are super hard. participation actually doesnt count as much as i thought it would be. her class is really fun, mostly group work. she should curve a bit more though. i learned a ton in this class and had fun doing so.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Galang is one of those teachers where you have to really work for an A, but other than that it's an easy B. Write decent essays, participate, and you'll be well along your way. Bonus points if you're witty.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I AAM SOOOO GALD SHES HERE...so cool very explanitory...loves her dog...we couldn't live without u ms Galang","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Galang has gotten a lot better on her grading. Although she does still take forever to grade an essay (oh, lord), she has realized that her dreaded and impossible multiple choice tests are the bane of her students' existence. BE AWARE OF THE MULTIPLE CHOICE TESTS. Other than that, participation is an easy A, and projects are also easy. Essays are worth 40% of your grade, so be wary while going into the class.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shes nice and brings food in a lot. You should participate because she will like you a LOT more if you do. She is fun and laid back. I have a low A in her class and it's fairly difficult to maintain it.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Galang is not as easy as the comments say below! I have her for 10th English honors and her tests are VERY explicit to detail. Certain details you may think is irrelevant. Read carefully. Homework is relatively simple, and significantly less projects (acting) 2nd semester. I like her, but I wouldn't say she's an easy A.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mrs galangs so chill......... i like having her as my english teacher.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"OMG she is probably one of the best English teachers at Lowell. She hasn't been here long, but she is awesome. She's like one of us, but way smarter. The time and effort she takes to correct our essays is amazing. Her Vocab tests [is she still doing that?] were really hard, but the essay tests were moderate and open book! TAKE HER! You will have a great time in the class just because it's so much fun; but you should participate cuz helps you towards the higher grade if you are on borderline.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think Ms. Galang is a really nice person. She's easy to btalk to and she almost always has a smile. There isn't much homework but her tests are really tricky. She' s an \"easy B hard A\" teacher. She does have pop quizzes so read what she tells you to.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love how Ms. Galang writes comments to you in your essays and journals. She's great.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You haven't experienced hell until you've taken a Galang pop quiz. Guaranteed tears after her tests. Every question is loaded and she plays mind tricks on you. You're gonna lose all the faith you've ever had in your reading abilities. I like her doe.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"if you can write well, you will have an easy time in the class. pay attention in her class, she literally spells out an essay for you in the discussions. overall, i loved her class. and she always tries to make things fun.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My 9th Grade Eng. 1 teacher, I had a pretty bad impression of her because she seemed gloomy all the time. Very insightful, however she has a teenage humor. She makes you act a lot, so be prepared for that. She grades essays pretty strict, but not as strict compared to others.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had her for english 1. super fun class. homework load isnt that bad usually just reading sometimes writing. you do alot of group essays stuff during class. one of my fav classes","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Its a fun class, apart from the whole acting thing","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mrs. Galang ROCKS MY SOCKS!! SHES THE BEST!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms galang is the best english teacher Ive had so far at lowell (2nd sem 10th gr eng honors)Her class is fun and creative and the essays arent that hard graded plus they're pretty interesting topics. She's a lot more interesting than Recht, and easier than InnisThe cons: plays favorites big time,","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome teacher.......pretty fair with grading. Shes definitly one of the best teachers at lowell!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I learn good in xpo class!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Let's start with the eBhA tag (easy B hard A). Classes were mainly group assignments, while the HW was fairly reasonable. Quizzes were kinda annoying, but the final was extremely difficult. The reason: she slacks on her grading of assignments and teaching of new topics, leaving her to pile it all on the last possible testing day. Students like her because they can relate to her outside of class. I would say she is one of the better english teachers in Lowell.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Just got mrs.galang this year.... shes one of the best teachers iv ever had! I love how shes so enthusiastic and fun when teaching her classes. Everyone should be lucky enough to have her as their english teacher!!!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's great! I think she used to be a little stricter (hence the reviews below) but she's certainly changed since. She's super nice, easy tests, easy grading. I love ms. gallang!!! Take her if you can! Especially for film as lit.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP75. 5 on exam. English takes inspiration, so do well in this class by using the handouts/resources and being a good character. Barely made an A in this class. interesting: she has a sense of fashion","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Galang is nice but she doesn't really get important analysis out of the text, and spends class time working on stupid assignments (she had us write a song about the characters in the novel and sing it to the class) or annoying discussion questions which prompted very lacking and boring class discussion. All in all, I gained nothing from this class and hope to never get her again.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"gives too many pop quizzes:( killing my grade, O well. very good teacher, can sometimes go overboard with HW but is easy and good to learn. Must take. also very funny. loves apples","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Galang is a nice lady... but she does not understand the timeliness of grading. There are a lot of tests, quizzes, and essays that I have turned in throughout the semester that I have not yet gotten back, and there is one more week until finals. Also - she really likes discussion questions. She puts you in front of them and does WHO KNOWS WHAT for the rest of the period. I don't get it, but whatever. Also - participation is kind of key at the beginning, but becomes less and less important.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Coolest English Teacher! Sure, she's a little hard, but what do you expect. In class, she is the coolest ever. She makes the stuff really fun, and gets me to get it! TAKE HER!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's an easy grader. Those of you who are complaining about unfair grades are expecting freshman year standards and an easy \"A\". Get over it.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I learned a lot, but worked way too hard. If I could give up some of that knowledge for less work, I totally would. Easy B, hard A.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pros: Good teacher! Very Easy B, kinda hard A. Really nice and helpful. Cons: Takes FOREVER to grade essays, multiple choice tests are IMPOSSIBLE unless you memorize the book.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"one of the best teachers ever, explains everything really well, homework and quizzes is perfect amount (come on it is lowell), GET HER!! plus she is really kool","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Galang. She's funny and very easy to talk to, and she grades fairly. Very easy grader when it comes to creative writing or comics, etc - just put in some effort. Lots of fun in her class! I'm almost never bored.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She makes class fun so you don't fall asleep and she gives helpful handouts. Really down-to-earth and she really reads your essays but hard grader. Watch out for her writing; it can get pretty messy....","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I've had her for honors and AP. She is a great teacher and can be very insightful at times. She also has a very youthful sense of humor that is engaging. But she favors people who talk a lot in her class. I took her the first year she taught AP and she wasn't too experienced. Don't take her for AP.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a great teacher! i got an A in her class for all 3 trimesters and an A for the final semester. She's really nice and makes you do a lot of acting and group work. She also let us watch Twilight and brings snacks. A really good teacher, i definitely recommend!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great class compared to Recht's, you (or at least I) learned aloooot from her class and she's not a hard essay grader so if you're bad with essays take her! Best english class everr!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A teacher new 2 the teaching world, she might be the best teacher I ever had. Her quizs are well-spaced. Explains wonderfully. But essays are strictly graded. [Editted 3/14/06]","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"now that i look back i realize i could have done much better. she's one of the better english teachers and participation doesn't count at all(good for us asians) some essay topics and tests are hard. i wish i could take her again","rating":4.2,"version":1}],"rating":4.199999999999995}},"__N_SSG":true}