{"pageProps":{"teacher":{"name":"Louis Grice","departments":["Math"],"semesters":["Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Algebra 1","block":"2","semester":"Fall2018"},{"name":"Algebra 1","block":"4","semester":"Fall2018"},{"name":"Algebra 2","block":"1","semester":"Fall2018"},{"name":"Algebra 2","block":"5","semester":"Fall2018"},{"name":"Algebra 2","block":"7","semester":"Fall2018"},{"name":"Algebra 1","block":"2","semester":"Spring2019"},{"name":"Algebra 1","block":"4","semester":"Spring2019"},{"name":"Algebra 2","block":"1","semester":"Spring2019"},{"name":"Algebra 2","block":"5","semester":"Spring2019"},{"name":"Algebra 2","block":"7","semester":"Spring2019"},{"name":"Algebra 1","block":"2","semester":"Fall2019"},{"name":"Algebra 1","block":"5","semester":"Fall2019"},{"name":"Algebra 1","block":"6","semester":"Fall2019"},{"name":"Algebra 1","block":"7","semester":"Fall2019"},{"name":"Algebra 1","block":"8","semester":"Fall2019"},{"name":"Algebra 1","block":"2","semester":"Spring2020"},{"name":"Algebra 1","block":"5","semester":"Spring2020"},{"name":"Algebra 1","block":"6","semester":"Spring2020"},{"name":"Algebra 1","block":"7","semester":"Spring2020"},{"name":"Algebra 1","block":"8","semester":"Spring2020"},{"name":"Algebra 2","block":"3","semester":"Fall2020"},{"name":"Algebra 2","block":"3","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-05T21:51:01.313Z","text":"ONLY TAKE THIS CLASS IF YOU ALREADY KNOW ALGEBRA. MR GRICE HAS ABSOLUTELY NO IDEA WHAT HE IS DOING AND I HAVE LEARNED ABSOLUTELY NOTHING FROM THIS CLASS. That said, he is the kindest person ever (if you're on his good side) and it is a very easy A.","rating":1,"version":0},{"timestamp":"2020-05-04T20:23:52.200Z","text":"Mr. Grice is the kindest soul, but he doesn't know what he's teaching. The class is a really easy A. He doesn't check homework and there are quizzes and sometimes tests every week. He spends most of the class making jokes that no one laughs at and solving equations on the board, which might I add, the students often have to correct. Like I said, he doesn't know the material very well. His heart is definitely in the right place, but he's a hard teacher if you didn't already take Algebra 1.","rating":2,"version":0},{"timestamp":"2020-05-02T20:39:26.023Z","text":"Super easy. good for kids who already know algebra but did not take the exam. makes bad jokes and does not teach or in fact, do anything whatsoever.","rating":2,"version":0},{"timestamp":"2020-05-02T00:22:24.180Z","text":"Please do not take him. He can barely even teach and spends most of his classes talking or just showing TED Talks that contribute nothing to the class. He skips at least half of the textbook and sometimes just tests the class on material that he never even mentioned. He grades you based on how much you struggled in the class, and usually only inputs grades when it is inconvenient. If you can self study or are naturally good at math, then you will probably have a decent time as long as you get on his good side.","rating":1,"version":0},{"timestamp":"2020-03-31T20:08:39.721Z","text":"Exams are really easy and the pace is really slow. I learned nothing in his Alg 1 class in my freshman year. Would not recommend, can't teach math. ","rating":1,"version":0},{"timestamp":"2019-12-20T16:26:33.242Z","text":"Best teacher ever!! #lies \nsee the math feel the math ","rating":1,"version":0},{"timestamp":"2019-12-09T03:03:05.422Z","text":"if you took algebra 1 in middle school, this class is an EXTREMELY easy A. otherwise, you're going to have to do a lot of self-studying. terrible explainer, bad grading system, and we often have to correct how he does problems in class! ","rating":1,"version":0},{"timestamp":"2019-09-24T21:01:00.170Z","text":"Not a real teacher; a whole semester on two or three chapters and skipped out on everything else; doesn't grade honestly or explain what goes on with grades.","rating":1,"version":0},{"timestamp":"2019-09-21T18:50:20.567Z","text":"honestly, ridiculously bad grading! deducts points from your actual test scores (he’s says a score he thinks you “deserve”?) and makes it more about self study. a lot of mistakes are made, and he doesn’t really have a way into making the classes enjoyable either. also, the classes he teaches are WAYY too behind.","rating":2,"version":0},{"timestamp":"2019-05-28T06:26:54.461Z","text":"I took his Fall 2018 Algebra 2 class and holy shit, he does NOT know how to teach the math, let alone do the math! He dislikes Synergy and occasionally updates his grades on a Google Sheet. He's consistently chapters behind other classes and expects us to perform on tests I'm certain he borrows from other teachers. He also has a super arbitrary grading scale on tests, and can't even grade them properly, consistently giving less points than you're supposed to get, and not even fixing them! Social studies major teaching math, what could wrong? \n\nHe taught us how to \"see the math, feel the math\" but he didn't teach us how to do the math.","rating":1,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I take his algebra 1 class and I believe he is a new teacher. The class is way too easy and his exams are easy. He does not like synergy but he eventually post grades and uses google classroom. But he’s not knowledgeable sometimes. He saids “hi I’m Mr. grice and you’re not, welcome back to Lowell high school.” Often. It’s funny and annoying.Submitted by a student","rating":2,"version":1}],"rating":1.3636363636363635}},"__N_SSG":true}