{"pageProps":{"teacher":{"name":"Lyudmila Karapetyan","departments":["Math"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Algebra 2","block":"3","semester":"Fall2014"},{"name":"Algebra 2","block":"7","semester":"Fall2014"},{"name":"Geometry","block":"4","semester":"Fall2014"},{"name":"Geometry","block":"6","semester":"Fall2014"},{"name":"Pre-Calculus","block":"2","semester":"Fall2014"},{"name":"Algebra 2","block":"4","semester":"Spring2015"},{"name":"Geometry","block":"2","semester":"Spring2015"},{"name":"Geometry","block":"6","semester":"Spring2015"},{"name":"Pre-Calculus","block":"3","semester":"Spring2015"},{"name":"Pre-Calculus","block":"7","semester":"Spring2015"},{"name":"Algebra 2","block":"1","semester":"Fall2015"},{"name":"Algebra 2","block":"7","semester":"Fall2015"},{"name":"Geometry","block":"4","semester":"Fall2015"},{"name":"Geometry","block":"6","semester":"Fall2015"},{"name":"Pre-Calculus","block":"2","semester":"Fall2015"},{"name":"Algebra 2","block":"1","semester":"Spring2016"},{"name":"Algebra 2","block":"7","semester":"Spring2016"},{"name":"Geometry","block":"4","semester":"Spring2016"},{"name":"Geometry","block":"6","semester":"Spring2016"},{"name":"Pre-Calculus","block":"2","semester":"Spring2016"},{"name":"Algebra 2","block":"1","semester":"Fall2016"},{"name":"Algebra 2","block":"7","semester":"Fall2016"},{"name":"Geometry","block":"2","semester":"Fall2016"},{"name":"Pre-Calculus","block":"3","semester":"Fall2016"},{"name":"Pre-Calculus","block":"5","semester":"Fall2016"},{"name":"Algebra 2","block":"2","semester":"Spring2017"},{"name":"Geometry","block":"1","semester":"Spring2017"},{"name":"Geometry","block":"7","semester":"Spring2017"},{"name":"Pre-Calculus","block":"3","semester":"Spring2017"},{"name":"Pre-Calculus","block":"5","semester":"Spring2017"},{"name":"Algebra 2","block":"1","semester":"Fall2017"},{"name":"Algebra 2","block":"7","semester":"Fall2017"},{"name":"Geometry","block":"2","semester":"Fall2017"},{"name":"Pre-Calculus","block":"3","semester":"Fall2017"},{"name":"Pre-Calculus","block":"5","semester":"Fall2017"},{"name":"Algebra 2","block":"1","semester":"Fall2018"},{"name":"Algebra 2","block":"7","semester":"Fall2018"},{"name":"Geometry","block":"3","semester":"Fall2018"},{"name":"Pre-Calculus","block":"4","semester":"Fall2018"},{"name":"Pre-Calculus","block":"6","semester":"Fall2018"},{"name":"Algebra 2","block":"7","semester":"Spring2019"},{"name":"Algebra 2","block":"1","semester":"Spring2019"},{"name":"Pre-Calculus","block":"3","semester":"Spring2019"},{"name":"Pre-Calculus","block":"4","semester":"Spring2019"},{"name":"Pre-Calculus","block":"6","semester":"Spring2019"},{"name":"Algebra 2","block":"4","semester":"Fall2019"},{"name":"Algebra 2","block":"6","semester":"Fall2019"},{"name":"Geometry","block":"7","semester":"Fall2019"},{"name":"Pre-Calculus","block":"1","semester":"Fall2019"},{"name":"Pre-Calculus","block":"3","semester":"Fall2019"},{"name":"Pre-Calculus","block":"1","semester":"Spring2020"},{"name":"Pre-Calculus","block":"3","semester":"Spring2020"},{"name":"Algebra 2","block":"4","semester":"Spring2020"},{"name":"Algebra 2","block":"6","semester":"Spring2020"},{"name":"Geometry","block":"7","semester":"Spring2020"},{"name":"Algebra 2","block":"4","semester":"Fall2020"},{"name":"Algebra 2","block":"6","semester":"Fall2020"},{"name":"Geometry","block":"7","semester":"Fall2020"},{"name":"Pre-Calculus","block":"1","semester":"Fall2020"},{"name":"Pre-Calculus","block":"3","semester":"Fall2020"},{"name":"Algebra 2","block":"4","semester":"Spring2021"},{"name":"Algebra 2","block":"6","semester":"Spring2021"},{"name":"Geometry","block":"7","semester":"Spring2021"},{"name":"Pre-Calculus","block":"1","semester":"Spring2021"},{"name":"Pre-Calculus","block":"3","semester":"Spring2021"}],"reviews":[{"timestamp":"2019-10-03T04:45:33.803Z","text":"As long as you have a good work ethic, her class is easy. She shows an example of the your homework on the board and makes you do the rest during class. Light work. Just don’t be a bitch and do your hw","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. K's class sucks because it's super hard to get an A. Also, she hates some random students. If you ask her questions, she is helpful and will like you more, but that may not be reflected in your grade. Also, watch out for when you have a sub, because she makes those worksheets equal points as a test without telling you (evil). Some people like her class because when she stamps hw you can use any piece of paper with #'s on it.Submitted by a student","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I learned literally nothing from being in Ms K's class. Entirely self taught, just took my own notes straight out of the textbook and didn't bother listening to her lectures. Everyone cheats on her tests so I guess they're kind of easy. Has mood swings, will yell at the whole class for no particular reason. Her accent is bad but not impossible to understand, the main problem is her inability to explain any of the concepts she is supposed to teach.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms.k is a trick. she is straight up weak. she lost my construction packet and saying that i lost it. next time i turn in work im going to take a picture of me handing her the work.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"isnt very clear or helpful","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. k is very easy for accel. her tests are pretty simple and its very easy to get A's, although she does not give partial credit and one missed problem lowers your grade substantially. teachers from examples in the book, which is kind of helpful because she explains each problem pretty thoroughly.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's awful. the accent isn't TOO bad. but she doesn't explain anything. she's also very nitpickety about what she wants which is ok for teachers who actually teach the material, but she doesn't really do that....she barely explains problems; she just writes them out. also, she's mean. she yells ALL","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms.K! She is very helpful and her tests are easy. If you need help Ms.k will go over material with you. Very approachable and easy to talk to.Submitted by a student","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You can get away w/o doing any kind of homework. horrible accent. she doesnt teach well but you'll do fine if you just read from the book and learn it yourself.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think she is pretty easy, easy tests, easy homework. But, she has a bit of an accent and does not explain her material all that well. But, everything is very straightforward.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You can't quite understand her, when she speaks and talks about the geometry problem. Don't be noisy or don't talk too much in her class, cause she can get a bit angry at you. Oh yeah, everyday you have homework, and sometimes probably pop out a quiz for the class. =/","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easyish for accel, hard for geo. have to self study. she cant explain anything. also for tests, show all work and use her methods. i got a 56 on her first test even if i got everything right. aced the rest because i started using her ludicrus methods on her tests. AVOID!","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is literaly the worst teacher i have ever had in my life. with a whole semester with her i have managed to learn absolutaly nothing. she doesnt get what she is teaching she just copies from the book and when you ask her a question she cant even answer. she is the worst","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"looking for an easy A? this is the class for youlooking for a class that you learn a lot? take mr. sinngood class to take with friends because she doesnt teach so you dont miss anything.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she doesn't even collect hw often, only before a test, and she always tells you ahead of time.she knows geo very well, people just take adv. of her because she's new. she explains each chapter and is willing to help you after class.also her tests and quizzes are easy. many times they're yes/no true/false. and then some algebra. read the theroems!","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she has this accent but she seems like a really nice person, hw everyday....you have to listen really hard to what she says","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shes really not that bad and her tests are super easy!Submitted by a student","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mrs. K has the thickest Russian accent and is very particular about certain details. If you get on her bad side (she has a list of the students she doesnt like) then shell check to see if you got the questions in you homework right. If she likes you all you have to show her are random pages titled the homework assignments and give her a glipse of them and youll get full credit. She really likes people who are smart in math and correct her in class (dont wait until she calls on you she wont)","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had for accel. Doesn't teach very well. She just copies down the example problems on the projector and expects you to understand it. Tests are really easy though, they're just problems for the book. If you are serious about math, don't take her.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i just started her class, so i didnt really have much to say. sometimes a little hard to understand her","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy, but you don't learn the right materials in class.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"grades strictly but is very helpful. She's a good teacher.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I agree with the people below. ms.k is really cool and really does want u to learn. Shes not as bad as people say she is. people tend to lie. ignore those poop heads","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"obsessive with hw. U lose many points for not doing it her way... which sucks. Dont get her u cant even understand her! ugh.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I dont get why people think shes hard.... shes really really ez if your smart. u just gotta learn from the txtbook most of the time and her tests r decently ez","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is really nice and wants you to learn but it is hard to understand her lectures and her tests can be hard but I think that is because excell math is just really hard.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really easy on tests and hw but u dont learn anything, teaches straight from the book","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She uses examples from the book to teach and just talks about how she did them, which isn't really helpful. Just read the book and make sure you understand everything. Also she's one of those really needy teachers who marks you wrong for not doing something she never told you to do. Don't take her.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"every1 knows how lowell works by now.... self teaching and asking around will get u along way here..but like every1 says, u learn nothing lol...","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"get her ONLY if you can teach yourself the material.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Accel 1H: She has an accent and goes really fast, so it's hard to pay attention and take notes. However, most of her notes are right from the book so you can listen. Tests aren't bad, and homework points really help. DO THE HOMEWORK. She checks random problems. She really helps you prepare for final","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"1) if you can teach yourself by yourself (or get a good tutor) then ms.k might be okay for you.....2) if you understand the material then the tests are easy3) she has a heavy russian accent4) she hates messy work---&gt;you might have to do your assignment again (ex: homework)if you have a choice, i would not recommend her","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"doesnt teach, easy tests, nice and remembers your name","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she goes very very slow, which is kind of good.she really does want u to learn.her lectures in class is really boring so find sumthing to occupy yurself in class","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. k is very easy, but she doesnt preoare for the final, but she isnt that bad. i failed my final and i still have a b and im going to geo honors. shes understanding and nice, dont be afraid to ask her questions!!!she isnt that bad, really. i dont know why everyone says she is","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she gave me a 15/50 on a construction project because she THOUGHT I did it by hand, plus she wouldn't tell me how she came to that conclusion. I got an F on my report card because of that. She's alright though, if you come to her for help she'll usually give it to you, and after you get used to her class its easy to pay attention to. Just pay attention and you'll get the grade you want.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"love ms.k, lot of people say that she has an accent but i understood her. tests are easy. you can skip a few homework problems and she wont notice.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ignore anyone who says she's bad. shes trying her hardest and if you have her you are lucky because at least you dont have hunt, costa, or rosales. she is way nice","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's really easy. all u have to do is be smart and learn from the book. she doesnt teach squat but u can learn everything from the book. her tests r easy and she likes u if ur smart... ez A","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. k's not as bad as people say she is. i had her for the entire year in accel. she seems mean, but only b/c she's yelling at the obnoxious boys in class. easiest accel teacher. some self-study, but take over chan. ask her if you have a question! but not \"when's the test\" that's been asked 7 times","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is a nice teacher. she has an accent that is hard to understand, but she wants to help you learn, and doesn't want anyone to flunk. she's a gazillion times better than rosales, costa, or hunt.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a very nice person but her teaching skills aren't that great. But if you don't understand something, you can go up to her and she'll explain it pretty well. Her tests aren't that hard if you somewhat study.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really try to avoid Ms. K. However, if you need a first semester 10th grade geo teacher, she is going to be the best option, but get a tutor! Lessons basically involve her reading the textbook out loud, but the accent is not bad at all. Do not ask her questions, ask your smart classmates and Khan Academy.She gives 5 points for hw every day, so even if you mess up the tests you will get an A if you do homework. Most tests are multiple choice from the back of the book.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's a relatively easy A i suppose but the accent is intolerable. the first of class i sat there and thought she was gargling marbels and talking about syrup when she was actually saying theorem...i think. yeah, i really still have no idea what she's ever talking about. she has really weird standards for grading. my best advice would be to draw, as she would say, \"pretty diagrams.\"","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Almost impossible to comprehend what she's saying, with her heavy accent. Hard to see her work when she uses transparencies on the overhead projector. Get a tutor or teach yourself with the textbook. Tests and quizzes aren't hard. Stay on her good side and you'll be good.Submitted by a student","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she isnt so bad as long as you never listen to anytihng she says. just rely on the book because she cannot explain. her tests are easy (most of it comes from the book, just different numbers), but the homeowrk is torture. about an hour a night and sometimes 2 hours. when you have questions about homework she wont even answer some. shes like \"okay you know how to do that one. it isnt that hard.\" not a good teacher.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she doesn't teach that well, but she gives an effort. her tests are pretty easy. she basically tells you whats on the test if you ask her nicely. i did fine in that class. just be on her good side and you got it good.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you're good at math and just want an easy class, take her! Tests are extremely easy if you understand the concepts, and they are sometimes multiple choice too. Homework is a big part of your grade compared to other math teachers, which is good since all she does is stamp it. If you actually need a \"teacher\" then take someone else.Submitted by a student","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is not too bad. I really like her, she is a really sweet person.Submitted by a student","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the geo department at our school is bad and the only teacher worth taking is Neri, and we've all heard horror stories. Ms.K is one story you dont want to be a part of. If you can get past her inability to teach,random tests,random homework collections that lower your grade, and that you MUST do everything her way, she's still a horrible teacher. If you cant get Neri, do your best to stay away from K, unless you enjoy failing and being yelled at, the other teachers are bad, but she is even worse","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"teaches straight from the book, all her examples literally come out right from the book, so yeah dont take her if you get bored easily","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I hate her. I was just asking her why she calculated my grade 10 points off and she kept insisting I was wrong and that I can't calculate better than her. Then when I'm at choir she calls me out of that class to tell me I was right and that she hates me being hysterical since I can't get an A anyway","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I loved Ms. K's class! As long as you pay attention and work the problems out, you will understand the material. If you need any help, Ms. K will go over the material one-on-one with you. There was no tension with her at all; she is very easygoing and easily approachable. You can ask her as many questions as you want, and she is willing to help!Submitted by a student","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her class is fairly easy. I always get an A+. She's one of those teachers where you have to study out of the book because her explantations are not clear, but once you get it, the work will come easily to you.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she tells u that theres a test right before the day she gives it to u, so get ready!","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's unbelievably clueless. I chose her because I heard she was an easy A. True, but you don't learn a thing in her class. Her explanations are unclear. It's really hard to pay attention in her class. Her accent definitely plays a role in that. But really, all you have to do is study out of the text and ask a few friends.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. K is a really sweet lady who will try hard to help you get the material, but overall it is hard to learn from her. I had her as my Accel Math teacher first semester, and found she could be very confusing sometimes. She's very neat on the board when she's solving a problem, but her verbal explanations aren't the best... an okay teacher, not my first choice; but then again I had her the first semester she came to Lowell. (I got a B average in that class).","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I loved her class. Super easy tests. LOTS of cheating though. You teach yourself. She just copies examples from the book. Act like you're paying attention, do the hw NEATLY, and you'll get an A. She is not hard at all. Her easy tests make up for the lack of teaching. If you want an easy A for preclac, get her. Don't talk too loudly in class or turn in hw late all the time b/c then she'll hate you. Best math class ever.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Precal, Avoid! her tests are okay, but it's her grading, for math there's multiple ways to do problems, but she only accepts one way even if you end up with the correct answer, her accent is heavy, she's hard to understand, and she's definitely not clear. can't negotiate with her, class is boring!","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's really pleasant and nice. But once you get past the accent, she still is a horrible teacher. If you can teach yourself the material (she doesn't) then it's a pretty easy A.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"doesnt teach anything. her accent isnt too bad, but her teaching is often directly from the textbook. her tests are easy compared to other accel teachers, but her classes are so far behind the other classes and dont expect to do well on the final","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you expect to learn anything, DO NOT take her class. I pretty much self taught myself by youtubing every topic. All she does is writes down the examples in the book and solves it on the board without explain how she got to the solution. Last I checked, I can read a book just fine all by myself without a teacher. And it's quite a sad thing that I have to youtube every topic because of her lack of explanation. And when I do ask for help, she said there are many ways to get help such as youtube.Submitted by a student","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's nice but cant teach. she tries to teach you but you probably wont learn anythingg from her. you gotta teach yourself geometry. all grades are based on tests. tests are like 8 questions. so if you dont get anythingg your screwed.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"GREAT! Test are very easy and are almost from the book. just like the examples. homework u only do odds which are in the back of the book. she does problems for u if u ask. she does get angry often, but its fine u get used to it. but u must get A's on almost all tests to get A final, final is hard","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"homework everyday and she assigns like around 40 problems to do everyday, her hw takes me at least 1-2 hrs to do. homework has to be done her way not your way! shes really nice though. Has an accent hard to understand. Definatly only take her if u can teach yourself. she tries really hard to help you though.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You don't learn anything. Teach yourself or youre screwed.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is horrible! She ruined my first year in high school. I can't believe she's been teaching for 40 years. She is incapable of teaching due to her stupidity and lack of compassion.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. K is the best math teacher I've had at Lowell so far. You MUST take her for the first class that she teaches in order to have her teach. For example, she will teach Pre-Calc. 4/5 but not 6/7. Why? Because she only likes explaining stuff once.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's nice but if you get an answer wrong on a test, you get no work points. hw random quizzes = easy points. unless you want to learn, DON'T take ms. k.. sadly enough she only had 1 accel class last semester (aka us), and apparently we got the lowest final scores. -____-\"","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher if you look past the accent. its not that big of a deal","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she may have an accent, but i don't think it's that hard to understand, well, i did. her tests are pretty straight to the point, and she does most of the hard questions out for you.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Horrible. You have to do things HER WAY in order to get full points. HW everyday, pop quizzes that never make sense, according to her own diagrams.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a hecka good teacher! Easy A! however very unclear.","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"well she is a nice teacher","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Accel Math 1H- She's really nice and is happy to help you answer any questions. She goes a little fast, so take notes quickly. Also, her accent makes it hard to understand sometimes. You may have to do some independent studying to fully understand the material, but she explains it thouroughly usualy","rating":2.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Uses the examples from the book, which is okay. Just read the book. If you don't do a problem on a test her way, prepare to get the whole thing marked wrong. This will lower your grade by a metric ton. I highly discourage you to take her class.","rating":2.8,"version":1}],"rating":2.828947368421056}},"__N_SSG":true}