{"pageProps":{"teacher":{"name":"Matthew Bell","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"United States History","block":"5","semester":"Fall2014"},{"name":"United States History","block":"8","semester":"Fall2014"},{"name":"World History","block":"2","semester":"Fall2014"},{"name":"World History","block":"3","semester":"Fall2014"},{"name":"World History","block":"7","semester":"Fall2014"},{"name":"AP European History","block":"6","semester":"Spring2015"},{"name":"AP European History","block":"8","semester":"Spring2015"},{"name":"United States History","block":"5","semester":"Spring2015"},{"name":"United States History","block":"8","semester":"Spring2015"},{"name":"World History","block":"2","semester":"Spring2015"},{"name":"World History","block":"3","semester":"Spring2015"},{"name":"World History","block":"7","semester":"Spring2015"},{"name":"World History","block":"2","semester":"Fall2015"},{"name":"World History","block":"8","semester":"Fall2015"},{"name":"AP European History","block":"4","semester":"Fall2015"},{"name":"AP European History","block":"6","semester":"Fall2015"},{"name":"World History","block":"2","semester":"Spring2016"},{"name":"AP European History","block":"4","semester":"Spring2016"},{"name":"AP European History","block":"6","semester":"Spring2016"},{"name":"World History","block":"8","semester":"Fall2016"},{"name":"AP European History","block":"2","semester":"Fall2016"},{"name":"AP European History","block":"4","semester":"Fall2016"},{"name":"AP European History","block":"6","semester":"Fall2016"},{"name":"World History","block":"8","semester":"Spring2017"},{"name":"AP European History","block":"2","semester":"Spring2017"},{"name":"AP European History","block":"4","semester":"Spring2017"},{"name":"AP European History","block":"6","semester":"Spring2017"},{"name":"World History","block":"8","semester":"Fall2017"},{"name":"AP European History","block":"2","semester":"Fall2017"},{"name":"AP European History","block":"6","semester":"Fall2017"},{"name":"Ethnic Studies","block":"4","semester":"Fall2017"},{"name":"World History","block":"8","semester":"Spring2018"},{"name":"AP European History","block":"2","semester":"Spring2018"},{"name":"AP European History","block":"6","semester":"Spring2018"},{"name":"Ethnic Studies","block":"4","semester":"Spring2018"},{"name":"Ethnic Studies","block":"2","semester":"Fall2018"},{"name":"World History","block":"8","semester":"Fall2018"},{"name":"AP World History","block":"4","semester":"Fall2018"},{"name":"AP World History","block":"6","semester":"Fall2018"},{"name":"World History","block":"8","semester":"Spring2019"},{"name":"AP World History","block":"4","semester":"Spring2019"},{"name":"AP World History","block":"6","semester":"Spring2019"},{"name":"Ethnic Studies","block":"2","semester":"Spring2019"},{"name":"AP World History","block":"2","semester":"Fall2019"},{"name":"AP World History","block":"6","semester":"Fall2019"},{"name":"AP World History","block":"8","semester":"Fall2019"},{"name":"World History","block":"3","semester":"Fall2019"},{"name":"AP World History","block":"2","semester":"Spring2020"},{"name":"World History","block":"3","semester":"Spring2020"},{"name":"AP World History","block":"6","semester":"Spring2020"},{"name":"AP World History","block":"8","semester":"Spring2020"},{"name":"AP World History","block":"2","semester":"Fall2020"},{"name":"AP World History","block":"4","semester":"Fall2020"},{"name":"AP World History","block":"5","semester":"Fall2020"},{"name":"World History","block":"8","semester":"Fall2020"},{"name":"AP World History","block":"2","semester":"Spring2021"},{"name":"AP World History","block":"4","semester":"Spring2021"},{"name":"AP World History","block":"5","semester":"Spring2021"},{"name":"World History","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-06T17:44:38.233Z","text":"Definitely one of my favorite classes, Bell’s lectures are super informative and also incredibly entertaining. He loves to crack jokes and really cares about his students. He wants you to succeed but does expect you to put in effort. If you’re not willing to do that, than I wouldn’t recommend you take his class, especially AP. If you are willing to try, I highly recommend, you will love this class and learn a lot. ","rating":5,"version":0},{"timestamp":"2020-05-06T17:39:51.197Z","text":"Any Bell class is more about the process and critical thinking than anything else. If you are honest about how you work and come into the class willing to put the grade in the back of your mind to focus on content, you will do well and have a great experience. The bottom line is, the class is fun, and you will learn tons if you don't get too 'Lowell' about it. But since I know that's why you're here... If you are a freshman taking him for World, the class is a guaranteed A and will probably be your most enjoyable class. If you are taking him for an AP, you will be incredibly prepared for the AP test because not only will you know the format; you will know the content like the back of your hand (assuming you are an engaged student in class). More or less, for AP's the class is a B for average effort, you have to work for an A. As a whole, he doesn't give a lot of homework, but you should make sure to put in the effort when he does.","rating":5,"version":0},{"timestamp":"2020-05-06T09:48:28.535Z","text":"Mr. Bell is one of the most amazing teachers you will have. His lectures are super useful and informative while still entertaining. He will make fun of anyone he sees, but mostly his favorites. He is super straight up and honest with his students, and you can tell he genuinely cares about his students and their well being. He hates phones, and he will get very angry about it if a couple beeps go off during class. Overall, he is a great teacher, so take him and you will not regret it. You do need to have a somewhat good time management though if you do not want to be stuck staying up doing notes the night before they are due.","rating":5,"version":0},{"timestamp":"2020-05-02T00:58:14.707Z","text":"Mr Bell has no filter and is 100% honest. He's not afraid to make fun of anyone so he also has a lot of inside jokes with his classes. Mr Bell cold calls on people all the time but I think it's really helpful since if you don't know the answer, Mr Bell forces you to think for the answer. But Mr Bell has very little patience, especially with phones. Don't let him see or hear a phone in class otherwise you might as well be dead. Overall, he's very engaging and funny. Would recommend ","rating":4,"version":0},{"timestamp":"2020-03-19T10:42:47.368Z","text":"Student: Phone goes off\n\nMr. Bell: ...\n\nAll hell breaks loose","rating":1,"version":0},{"timestamp":"2020-01-29T17:45:22.299Z","text":"Although he may seem intimidating at first, Mr. Bell does his absolute best to make his class an interesting and challenging environment where you can’t help but learn loads. He challenges you to try your hardest and pushes you to do your best. His sense of humor makes his class even more fun. ","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Bell is an amazing teacher!!! Definitely knows his stuff, but you also learn life lessons and advice for the future. A bit tough, he barely gives homework but the wisdom you gain is so much more than just a history lesson. you should 100% take him, by far one of the most interesting and funny teachers here.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I never appreciated mr. Bell before, but I now realize that he prepared us very well for the AP exam (despite teaching an AP course for the 1st time). He stayed afterschool for extra prep which was so nice and the weekly SAQs were very helpful. Easy B, must show effort for an A. I got an A both semesters despite mostly getting B- on tests. I hated the damn multiple choice tests but all that prep were what got me a great score. So thanks. I hope he teaches AP gov/Econ next yearSubmitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Was very unhappy to take him for world history S'14, but I had last pick and no choice. However I loved it and continued to take his AP euro class. He seems to care for his students even if he comes off as intimidating/moody. World history was entertaining, but AP euro is a bit more lecture based although it's still fun. I guess. Would recommend for both. Easy B but you've got to read in order to get an A.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Bell is a polarizing character, but despite his quirks, he is an objectively good history teacher. I overall felt very prepared for the AP Euro test, and we covered a lot of interesting historical theories and topics (not just the basic stuff). He is a self-aware better tutor than teacher, so take advantage of meetings outside of class and extensions on assignments. That being said, he definitely has favorites, so early on in his class participate a lot and have sense of humor.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I'm pretty late to the party but I took mr. bell during 2015-16 and was in his block 8 class. he was a hella chill teacher like 80% of the time. He even gave me the nickname money. I did learn a lot but if ur gonna take him just stay on his good side.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he knows his stuff! if you actually want to learn then take him! if you are a slacker then don't.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Mr.Bell! His class can be a little stressful sometimes because of the workload (in AP euro at least) but if you ever have a problem, he will do his best to help you solve it. He jokes a lot during his lectures, which makes class fun. His tests and assignments are focused on thinking rather than memorization, so you really have to understand the topic to succeed in his class. Really knowledgeable about what he teaches. Take him!Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Me.Bell is a wonderful teacher. He makes you read a lot though. But if you ever need someone to talk to not just school related he's the one to go to.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Bell is extremely deep and socially aware (although not as much as he thinks he is). I would recommend him in freshman year as he is quite funny and deep but in AP Euro, he is quite moody at times and the work load is a lot.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Honestly, Mr. Bell knows about history. Problem is, he doesnt know how to teach it. We should be reviewing the chapters of our textbook of what we are learning instead of listening to his lectures. His lectures dont even relate to our hard exams he gives us. Hes basically setting us up to fail, unless we work twice as hard as any other student, we have to teach ourselves. And i thought that was a teachers job to do? I guess not for Mr. Bell","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"No idea what those 1 stars are saying. They're just salty/bitter. He wouldn't have a reason to dislike you unless you waste class time. He rounded my grade from a B to an A a few times which was very nice of him as he didn't need to. He can be moody but he's aware of it. Honestly my favorite history teacher out of the 3 I've had.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Bell prepared me extremely well for the AP Exam. His class is pretty interesting. We went well beyond the basic things in AP Euro. Mr. Bell can be strict, so show up on time and NEVER use your phone in his class. I have to say, he's a better \"tutor\" than teacher. Take advantage of his office hours. He'll definitely be of more help there than during regular class time.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's really funny and tries to get the shy students to talk, but he never means to insult people. Tbh he has mood swings and can be scary. Has several map tests and one major test per grading period. Homework is usually reading and taking notes from the textbook but that's about once a week","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes a pretty decent teacher as far as actual content goes. I just feel as if he gets a bit sidetracked sometimes, overall still a pretty good class IMO at least.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a teacher that helpful but not all that great. He tries to focus on the thinking instead of memorizing so you don't learn as much from him as other history teachers. His unconventional method of teaching is not recommended to your learning.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him both semesters of freshman year for World History, kept a solid A all the way through. He gives you everything you need to know, but pay attention and take good notes in class. He tries to get you to think more versus memorising \"2 + 2 = French Revolution\", so be assertive and use your brain.Feel free to talk to him during his office block (6th), he's fair and is nicer outside of class.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Right now, he is making his econ classes write a three page, or 1000 word cost benefit analysis of policy analysis. Frankly, I don't appreciate that he did not really explain how to do the chart, which we have to include in our analysis.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"As a person who was neutral on the scale of hate Bell and Bell is ok, Mr. Bell is ok. Just check your paper on a different plagiarizing site before turning it in. If you act like you're paying attention, take notes, don't waste time, and participate a little, you should get at least a B. He's usually willing to talk and negotiate and he's nice about it if you've been a good child. People don't like him because they get scolded but it's your fault for pissing him off. SRS DO NOT PISS BELL OFFSubmitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Considering this school year is his first one at Lowell High School, he is already popular among the student body. He is SUPER funny and a great teacher. He may pick on students, but only to be funny, not to hurt anyone. He gives open note quizzes occasionally and his tests are multiple choice. Homework consists of reading/note taking. In class, he gives lectures that are quite interesting. Overall, he is a good teacher. If you want a teacher that's not hard nor easy, take Bell! He's hip!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr. Bell only one semester for freshman year '13, sadly, but he has been my favorite history teacher of all of the ones I've had at Lowell. I also had him as a mentor for a competition, and inside and outside the class, he's very thoughtful, kind, and insightful in the fields he's studied in (in this case, history). Any question you have, don't hesitate to ask him, because he is certainly more than happy to answer. His lectures are actually enjoyable too. I'd definitely recommend him.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's awesome & I'm so sad that he won't be my history teacher again. Lectures can be boring but he has a special glare that motivates you to stay awake. Learned a lot of good information however it was not used in the exam. It's not his fault as the exam was completely revised so no one knew what was coming but I probably got a 2. But Bell is the only Euro teacher so good luck. He seems mean but he just teases & cares about his students. Fair grader Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a good teacher, fun class, funny guy. Makes you think. Make him like you and don't treat the class like a joke and you'll get an A. He talks about life a lot which is cool but he makes too many generalizations about being a Lowell student that make me want to punch him in the face. Rare homework rare tests. Can be rude to kids he doesn't like but overall a cool and nice guy. Most people will love him but he pissed me off.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP Euro - heavy homework, a fair amount of tests. overall quite good. i was a student in his first ever euro class and despite that he prepared me well enough to get a 5. it's certainly not the easiest class but i definitely recommend itSubmitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You wont regret it!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher. Not always the most approachable (at times), but he will apologize for his mistakes and correct them, and he respects his students. Knows his stuff, knows how to teach, and engages with everyone. Reaches out to students outside of school and the classroom. Overall, helpful, knowledgeable, and a fantastic teacher. Don't take him for an easy A, take him because you love history. But if that's the case, he's one of the best teachers you can take.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes a good teacher you'll learn so much. He wants u to think and reason (go deep in the topic) not to memorize it, his humor makes the class feel a bit less stressful and his hw is mostly reading about 5-9 pgs and taking notes and reviewing the vocab and typing why is this vocab important, why does it matter? take him, its so much fun and u learn which is what is expected","rating":4.3,"version":1}],"rating":4.2749999999999995}},"__N_SSG":true}