{"pageProps":{"teacher":{"name":"Matthew Magsanay","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Government and Comparative Politics","block":"7","semester":"Fall2014"},{"name":"AP World History","block":"1","semester":"Fall2014"},{"name":"AP World History","block":"3","semester":"Fall2014"},{"name":"AP World History","block":"5","semester":"Fall2014"},{"name":"AP Government and Comparative Politics","block":"7","semester":"Spring2015"},{"name":"AP World History","block":"1","semester":"Spring2015"},{"name":"AP World History","block":"3","semester":"Spring2015"},{"name":"AP World History","block":"5","semester":"Spring2015"},{"name":"AP World History","block":"1","semester":"Fall2015"},{"name":"AP World History","block":"3","semester":"Fall2015"},{"name":"AP World History","block":"5","semester":"Fall2015"},{"name":"AP World History","block":"7","semester":"Fall2015"},{"name":"AP World History","block":"1","semester":"Spring2016"},{"name":"AP World History","block":"3","semester":"Spring2016"},{"name":"AP World History","block":"5","semester":"Spring2016"},{"name":"AP World History","block":"7","semester":"Spring2016"},{"name":"AP World History","block":"1","semester":"Fall2016"},{"name":"AP World History","block":"7","semester":"Fall2016"},{"name":"AP Human Geography","block":"3","semester":"Fall2016"},{"name":"AP Human Geography","block":"5","semester":"Fall2016"},{"name":"AP World History","block":"1","semester":"Spring2017"},{"name":"AP World History","block":"7","semester":"Spring2017"},{"name":"AP Human Geography","block":"3","semester":"Spring2017"},{"name":"AP Human Geography","block":"5","semester":"Spring2017"},{"name":"AP World History","block":"1","semester":"Fall2017"},{"name":"AP World History","block":"5","semester":"Fall2017"},{"name":"AP World History","block":"7","semester":"Fall2017"},{"name":"AP Human Geography","block":"3","semester":"Fall2017"},{"name":"AP World History","block":"1","semester":"Spring2018"},{"name":"AP World History","block":"5","semester":"Spring2018"},{"name":"AP World History","block":"7","semester":"Spring2018"},{"name":"AP Human Geography","block":"3","semester":"Spring2018"},{"name":"World History","block":"5","semester":"Fall2018"},{"name":"World History","block":"7","semester":"Fall2018"},{"name":"AP World History","block":"1","semester":"Fall2018"},{"name":"AP World History","block":"3","semester":"Fall2018"},{"name":"World History","block":"5","semester":"Spring2019"},{"name":"World History","block":"7","semester":"Spring2019"},{"name":"AP World History","block":"1","semester":"Spring2019"},{"name":"AP World History","block":"3","semester":"Spring2019"},{"name":"AP World History","block":"1","semester":"Fall2019"},{"name":"AP World History","block":"3","semester":"Fall2019"},{"name":"World History","block":"5","semester":"Fall2019"},{"name":"World History","block":"7","semester":"Fall2019"},{"name":"AP World History","block":"1","semester":"Spring2020"},{"name":"AP World History","block":"3","semester":"Spring2020"},{"name":"World History","block":"5","semester":"Spring2020"},{"name":"World History","block":"7","semester":"Spring2020"},{"name":"AP World History","block":"1","semester":"Fall2020"},{"name":"AP World History","block":"7","semester":"Fall2020"},{"name":"World History","block":"3","semester":"Fall2020"},{"name":"World History","block":"4","semester":"Fall2020"},{"name":"AP World History","block":"1","semester":"Spring2021"},{"name":"AP World History","block":"7","semester":"Spring2021"},{"name":"World History","block":"3","semester":"Spring2021"},{"name":"World History","block":"4","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-06T06:36:46.243Z","text":"I think mr mags is a really good teacher. he cares about his students and helps you figure out the answer if you get called on. as long as you pay attention in class and ask for clarification if you don't get something, it is possible to get an A in his class. he really does help you prepare for your next ap history class or exam. if you like history take him","rating":5,"version":0},{"timestamp":"2020-05-03T01:20:23.939Z","text":"He's a great teacher if you want to really learn in depth.  I didn't really understand history before I took his class, and he always asks if there are questions after a lecture.  Be prepared to take a lot of notes on readings and lectures, but they really help when it comes to the quiz/short answer. ","rating":5,"version":0},{"timestamp":"2020-05-02T20:51:14.268Z","text":"mags is a good teacher. consistent and pretty flexible if you’re ever having an issue. there is a lot of work- but he basically gives you all the answers in class if you take notes. the tests are always multiple choice, usually abt 20 questions. sometimes you have to write short answers. i usually study for 20 minutes for the test and im fine. i would recommend him- you learn a lot ","rating":4,"version":0},{"timestamp":"2020-03-04T18:43:59.638Z","text":"Mr. Mags is a good teacher. He explains things very well and goes in depth with what we actually need to learn. His work is okay. It wont be that hard if you just listen and take notes in class. We have like 2 quizzes and SAQ’s ( a test where he gives us a question and we answer in paragraph form ) per unit. Though he is very good at teaching us, he can be fairly moody and strict at times. He is very strict with phones and he gets kinda mad when we dont listen or do things that he doesnt like . but overall, he is a good teacher. ","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i have him for ap world and hes pretty easy going. he can be funny without meaning to be it. his tests are pretty hard but he lets you redo some of the questions that you missed. if you go to him after class he explains things well and hes really nice","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I've had Mr. Magsanay for two whole years at Lowell, and I definitely recommend taking him. He may seem like he doesn't like you, but I'd say he's been one of my favorite teachers. He makes the topic really fun, and I learned so much in his class. He's organized, helpful, and clear. If you are taking him for AP World, he does give a lot of work, and his tests are pretty challenging. The key to taking his class is time management. Don't feel intimidated in approaching him--he wants to help.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a really good teacher. yes you have to do notes and homework, but at the same time you're learning in a way that's entertaining. take him, he's awesome.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His behavior sucks.....but he's known as a great teacher for Modern World.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"We managed to get a lot of prep for the AP Exam throughout the school year but I felt that we could have upped the ante towards the crucial month before the exam. He's a very knowledgeable teacher. His lectures can be boring and at times I felt like we strayed off from APWH material but I'm sure Mr.Mags knows about this and will prepare his students even better in the future. He's been pretty grumpy this year but don't be afraid to ask him questions after class, he's very welcoming. GL!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"lol he's very strict on work and tardiness but you'lll learn a lot","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good for MoWo. He explains stuff pretty clearly. Just do your share and work hard. Really hard for AP World though.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really funny only because he didn't make fun of me and instead I made fun of him, I connected with Mr. Magsanay through jokes. Not an easy teacher, you have to study REALLY hard for test because they're hard. His homework is really boring, but he explains everything REALLY well in class.he's a hater","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome teacher... challenging but fun.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Mags is a wonderful APW teacher. He is knowledgeable, gives clear but sometimes boring lectures. Tests are reasonable. It is not hard to get an A in his class, but you need to put effort in studying and pay attention in class. Preps you for the AP exam. No doubt very moody, but it is bearable. I definitely recommend taking his class.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"prepared us for the ap test but i hate him. has a bad attitude all the time and takes it out on the students, esp his last class of the day. i ahve a feeling he likes to teach the material but he doesnt like kids....... good luck in ap world history","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I encourage you to take him for Modern World, but not AP Wolrd. The class is not very challanging, although he might get harder next year. You will get an A if you read/ skim the chapter,listen, participate,joke and ask questions.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Once you get past his rough exterior, he's really a great teacher!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Mags is a very good teacher. teaches the writing formats really well so your prepared for the ap exam. not much hw, just lots of reading. his class isn't that Borin either.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"there's something to be said about younger teachers, they really know how to talk to their students on a level they can relate making them interested in learning and at the same time learn something too. most of his homework involves reading where he will give you a 5Qs checkup quiz","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's an awesome teacher...he comes up w/ really fun activites for us to do in class...the homework is mostly like taking notes for the sections & stuff then he gives u a quiz a couple of days later but u get 2 use ur notes & stuff...great teacher overall, can relate 2 us kids lol","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Modern World was pretty enjoyable. He lectures before the test using interesting drawings and his tests are pretty easy since most of the important questions are repeated.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's alright. Don't get on his nerves or else he'll get mad. He's enjoyable to watch when he's mad and makes you laugh but he's cool.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had him for modern world and he was GREAT! his tests are VERY decent and his lecturing involve talking about star wars! and did i say that he plays DEUCEs with students!?","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for MoWo this semester and think that he is one of the best teachers I've had so far. Funny, explains everything really well and actually tries to make you like history.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's honestly one of the best teachers I've had. Sometimes he's rather moody or is a bit nosy when it comes to students' personal lives, but other than that he prepares you really well for the exam. He understands students' personal struggles and his lectures are in-depth, and not boring at all. Classes involve a lot of discussion, and often times, he will randomly call on people. As are not too difficult to get as long as you pay attention in class, do the assignments he asks, and participate.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mags is an awesome AP world teacher. I was lost when we did DBQs and essays in class during the year, but towards the end of the year, he broke it down and made sure you understood the format of the essays and how to organize and such. He breaks down the material read in his lectures which may be kind of boring, but participate! His tests are really easy, but prepares you really well for the AP test, especially the essay part. He's funny in a nerdy way and EXTRA CREDIT!! great teacher overall.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome teacher brings up fun in all lectures","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really fun teacher and allows notes on quizzes","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"coolest mowo teacher ever. i've had jazyeri","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Mags lectures everyday and all the information is based upon the reading due that day. His quizzes require you to memorize the specifics of everything you've learned that entire week and sometimes includes questions from the week before as well. He's a pretty difficult teacher, and it's usually no use to argue or disagree with him. You must try really hard to earn a B in his class, and only a few people have A's.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a very salty person. As salty as a potato chip, no lie with that crunch. I would totally recommend him because he's very kind, approachable, and very knowledgeable. If you are reading this and taking AP World at the same time, I pray for you. That class was hard but it was worth the stress. Thanks to all the religions we have learned from Jainism, to Islam, to Buddhism, to Christianity, and to all the other religions for making me pass this stressful class. But still thanks Mr. Mags!!!Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Magsanay has his perks as said in other reviews, but if you can get past his moodiness and sassy replies, you can learn to like him as a person. The exams and assignments are no doubt hard...they're not meant to be easy. However, he goes over how to solve issues that most students run into, and if you have other difficulties with anything you're learning, set up an appointment with him to go over it because he is super approachable in that way.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I've had his class for 2 school years now and let me tell you, you learn a lot in his class. Very straightforward rubric. Always tells you future assignments in an outline. Grades: a good and reasonable combination of tests, essays, and assignments. A lot of people don't like his lectures but really, everything you copy down will 100% help you on the test. Funny jokes here and there. Get's kinda moody esp. in the afternoon. He's not an easy A, but you are prepared more.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"magsanay is a cool teacher. i had him for AP world last year and i learned a lot. his tests are pretty difficult but that made the real AP test hella easy. it was awesome how we went over an essay prompt that was just like one of the AP essay prompts we got on the real AP exam. he can be a nerd but","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I've had Mr. Mags this past year for AP World and I can honestly say that he prepared me well for the AP test. He may seem intimidating at first, but once you get to know him he's actually cool, funny, & approachable. He gives a lot of work, but it's good because it gives you chances to bump up your grade. As for tests, I found them a little difficult, but he lets you earn up to 5 points back if you meet with him and discuss the questions. Be sure to participate! It's an easy way to earn points.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for MoWo and AP World. I would definitely recommend taking him. Very helpful lectures, not too much work, decent tests, and prepares you very well for the AP exam. He also has an interesting personality which makes class more fun in my opinion.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I ABSOLUTELY LOVE MAGS. He is the best teacher in the Social Science Department as far as I can tell and is just so helpful in all sorts of ways. Sure, he's super sassy and kind of a meanie sometimes, but it's his personality, so you can't really change that. He seems standoffish and mean at first glance, but he's actually a really down to earth guy who's a little bit clueless sometimes when the topic is not his expertise. He doesn't mean to be funny but he is. Great teacher and super clear!Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My favorite teacher at Lowell. Always look forward to his class. He teaches extremely well and can be moody at times but only to students who annoy him. Mags is such a helpful teacher and although he has no emotions towards anyone, he does care enough to prepare his classes for the ap exam. He’s also super nerdy but at times can be funny. I passed his class with a B unweightedSubmitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think Magsanay is a great teacher. Sure he like to pick on some students but he's only joking around. His tests are pretty easy if you study for it, and plus he's pretty good at telling jokes. I recommend taking his class for Mowo.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Mags is a really good teacher, but is extremely difficult. Im barely passing his class and if you don't stay on top of your work consistently you will have an extremely difficult time passing his class just like i did. He's a really kind person but very moody. I recommend Mags for anyone that is really smart and is not a huge procrastinator. If thats not you then don't take him.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great for MoWo. Hard for APWorld. Trust me.He explains things pretty well and assigns the fair share of homework. Hard work will get you an A, relatively easy B.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he tries too hard to act like a sophisticated teacher, and then he goes into talking about comics and star wars. tests are fairly simple but have questions which we didnt cover and MANY questions are horribly worded with horrible choices.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a good teacher. Explains concepts very well and most of the time knows the answers to your questions. However, he is VERY moody. Gets angry at students when they do something annoying. Obviously anyone would get angry, but he gets very irritated and you can see this through the things he says. Tries to contain it, but you can tell through his tone of voice. He is a good, but if you're going to take AP HuG, take Johnson. Forced participation. Calls on you by choosing cards at random.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"APHUG - the pickiest teacher I have ever had. This is my 8th AP class and none have required the amount of detail he wants. He grades the FRQs way too harshly. I've taken APUSH, psych, world - none were as hard or required the amount of specificity with this class. Mags is a good teacher and can be funny but I'd take Johnson over him for APHUG, simply because he asks for too much for a \"baby\" AP. I'm struggling to stay above 90% for what should be a simple classSubmitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hard. Like tuasen. Lotta work too.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a really good teacher. He's nice, funny, and kinda acts like a kid sometimes so we can relate. But he still gets the point across in a fun way and clearly too. I love it when he makes comics or Star Wars references. He also showed Band of Brothers when we were learning about WW2 which was cool.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's kinda intimidating, but he's actually pretty nice. Homework is easy. If you want an A on his tests, pay attention in class. Makes the reading easy to understand. Take notes.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"people either really like mags or really don't like him. i'm neutral, but i have to say if you work hard in his class, it pays off. he can be annoying at times, but if you can tolerate that it's okay.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Even though it's his first year teaching AP HUG, I would definitely recommend Mr. Mags. Yeah, he can get a bit moody at times, but he's really good at explaining concepts and clarifying anything confusing. Just make sure to keep up with the notes and study hard for the multiple choice tests and FRQs (ESPECIALLY the FRQs) and you should at least end up with a B.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good MW teacher. funny and explains concepts very humorously and visually ( pictures flow charts ). Only omplaint is that he is sometimes extremely picky about your thesis statements (this rarely affects gades in an extreme way)","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome teacher, you must take him if you are taking AP world. I'm not that good at history but after i took him, i learned so much more. He prepare us really really well for the AP exam. Great teacher must take Easy A/B.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Magsanay is a great teacher. His AP World class was clear, structured, and really prepared me for the AP test. Mr. Mags taught me how to write great essays, which helped for APUSH as well. The textbook was used moderately, but most of the info came from his lectures and discussions. I would highly recommend him!Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Although moody and strict about tardiness I think he is a good AP world teacher. He knows his stuff and has good lectures. As long as you pay attention in class you'll be fine. I never studied for tests but just payed close attention in class and always got A's on them. He always curves them too. Prepares you well for the AP exam.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I learned a lot from mag's ap world class. He is a very knowledgeable teacher. Reading is not essential to doing well on the ap exam because his lectures are so in depth.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a cool teacher. He relates the material in a way teens can understand. Yeah, it's weird hearing a teacher talk like us, but at least we're learning . He was really cool for MoWo. Freshies, take him if possible. Although, most of the social studies teachers are pretty cool.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Magsanay is a GOD. 200 characters is simply NOT enough for me to describe his godliness.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"How could you hate him? I learned so much in his class.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Mags is an absolutely an amazing teacher! Although his class is hard, and you may hate the work load at times, but at the end is all worth it. He prepares you for the test really well, and his lectures are pretty interesting as well.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ok teacher. but i just dont like the way he makes us do notes. he allows you to use notes for quizes so pretty much everyone takes notes on every section just in case theres a quiz. but sometimes he doesnt give qquizes so the notes are for nothing. i like how he does current events, it kills time.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he curves on tests . so cool.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had him all freshman year for mowo and he was really easy, his tests are straightforward, u can use notes on his quizzes, and he grades essays fairly, sometimes he even gives ec! class was laidback and fun","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a really good teacher. At first I really liked him, and then I really didn't, and now I do again.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"horrible teacher. I learned nothing.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I'll be honest- I completely hate Mr. Mags. He clearly dislikes the majority of his students, has a terrible attitude, and is highly judgmental and sour. However, he is undoubtably a very good teacher. Barely any work and tests are easy (if you literally just show up to class you will be prepared). AP test is a breeze with minimal studying.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"magsanay's really nice. he always makes jokes and let us listen to music and watch movies. his tests are mainly multiple choice. you have to take a lot of notes in his class though and you never know when he gives a quiz. overall he is a great teacher to take.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I loved class with Mags because he taught so well and the content was interesting (AP World) and he made sure we understood everything (checking in with groups). You can answer a question completely wrong and he'd be patient with you and help you figure out the right answer. Participation plays a pretty big role in your grade so I suggest that you raise your hand. He is a bit snappy and moody at times. Also he's pretty emotionally detached from us but I'm still going to miss him as a teacher.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tests are alright and don't count for all your grade since assignments also factor into your grade. He gives class notes and we have discussions. Also offers extra credit each grading period","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Mags is a great teacher! I took his class for both AP World & AP HUG. Both were the best classes I have taken at Lowell. You really learn so much in this class. As long as you do your reading & take notes during class, you will be fine on the tests. For me Mr.Mags gives off a vibe that really does care about his students and wants them to succeed. Overall great teacher!Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have him for mowo and i think he's great he makes his classes fun but still gets his points accross. I also really like that he uses activities, movies and outside readings to solidify what he's talking about. Great teacher! Hope to get him for AP World next year! :)","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"People say that he's a pretty difficult teacher, but I was totally prepared for the AP test today. Just pull your own weight and learn. Another thing: he was right about the essay prompt. *clap clap*","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good teacher but moody sometimes. Not ez to get an A but this is an AP class soo u know. If i had a choice to choose him again or some other teacher,i would chose him again NO DOUBT","rating":4.4,"version":1}],"rating":4.419718309859154}},"__N_SSG":true}