{"pageProps":{"teacher":{"name":"Matthew Furey","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP United States History","block":"5","semester":"Fall2014"},{"name":"AP United States History","block":"7","semester":"Fall2014"},{"name":"World History","block":"1","semester":"Fall2014"},{"name":"World History","block":"3","semester":"Fall2014"},{"name":"AP United States History","block":"5","semester":"Spring2015"},{"name":"AP United States History","block":"7","semester":"Spring2015"},{"name":"World History","block":"1","semester":"Spring2015"},{"name":"World History","block":"3","semester":"Spring2015"},{"name":"World History","block":"1","semester":"Fall2015"},{"name":"World History","block":"7","semester":"Fall2015"},{"name":"AP United States History","block":"3","semester":"Fall2015"},{"name":"AP United States History","block":"5","semester":"Fall2015"},{"name":"World History","block":"1","semester":"Spring2016"},{"name":"World History","block":"7","semester":"Spring2016"},{"name":"World History","block":"8","semester":"Spring2016"},{"name":"AP United States History","block":"3","semester":"Spring2016"},{"name":"AP United States History","block":"5","semester":"Spring2016"},{"name":"United States History","block":"6","semester":"Fall2016"},{"name":"United States History","block":"8","semester":"Fall2016"},{"name":"AP United States History","block":"2","semester":"Fall2016"},{"name":"AP United States History","block":"4","semester":"Fall2016"},{"name":"United States History","block":"6","semester":"Spring2017"},{"name":"United States History","block":"8","semester":"Spring2017"},{"name":"AP United States History","block":"2","semester":"Spring2017"},{"name":"AP United States History","block":"4","semester":"Spring2017"},{"name":"United States History","block":"2","semester":"Fall2018"},{"name":"United States History","block":"4","semester":"Fall2018"},{"name":"United States History","block":"8","semester":"Fall2018"},{"name":"AP United States History","block":"6","semester":"Fall2018"},{"name":"AP United States History","block":"6","semester":"Spring2019"},{"name":"United States History","block":"2","semester":"Spring2019"},{"name":"United States History","block":"4","semester":"Spring2019"},{"name":"United States History","block":"8","semester":"Spring2019"},{"name":"AP United States History","block":"4","semester":"Fall2019"},{"name":"AP United States History","block":"8","semester":"Fall2019"},{"name":"World History","block":"2","semester":"Fall2019"},{"name":"World History","block":"6","semester":"Fall2019"},{"name":"World History","block":"2","semester":"Spring2020"},{"name":"AP United States History","block":"4","semester":"Spring2020"},{"name":"World History","block":"6","semester":"Spring2020"},{"name":"AP United States History","block":"8","semester":"Spring2020"},{"name":"AP United States History","block":"4","semester":"Fall2020"},{"name":"AP United States History","block":"6","semester":"Fall2020"},{"name":"AP United States History","block":"8","semester":"Fall2020"},{"name":"Economics","block":"2","semester":"Fall2020"},{"name":"AP United States History","block":"4","semester":"Spring2021"},{"name":"AP United States History","block":"6","semester":"Spring2021"},{"name":"AP United States History","block":"8","semester":"Spring2021"},{"name":"Economics","block":"2","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-02T05:00:46.994Z","text":"Oh man I hated him so much. He thinks he's the best and is so full of himself I wanted to die in his class. He thinks he can speak literally every language and he thinks he knows everything about everything. He makes fun of the JROTC students and will call you out in front of the class for every single mistake in your power point presentations. Not to mention he's tried to actually teach the students' presentations. . . Overall, yeah I learned stuff from him, but he is very difficult and I do not recommend unless you have a lot of patience","rating":1,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a really good teacher, he doesn't teach from the book but his work is organized/not confusing. right before the test he gives you study sheets which are REALLY helpful. typical homework is to write 20-25 sentences on a prompt he gives you, but as long as you do it, you're guaranteed an A for ho","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Furey is a fantastic lecturer, chooses good material for the class to do worksheets on, and shows informative movie clips in his class. He has some funny stories to share with the class, provides lots of laughs, and likes to encourage the class with a few motivational phrases daily. Although he's not willing to spend much time helping you outside of class, Modern World and APUSH are not impossible to succeed in. I would take Furey's class if you want a fun class!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"After taking the APUSH test last year I realized just how well Mr. Furey prepared the class. His tests and the actual exam are very similar. If you pay attention you will probably end up with a 5Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is in general an okay teacher, and finds way to have fun in class. He makes you watch these documentaries and do papers that can be boring, but is a good teacher nonetheless.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Although highly underappreciated by many students in his APUSH classes, Mr. Furey is a very successful teacher in helping his kids really learn the material in the class. He really prepares you well for the AP Exam if you put in YOUR effort in as well. His teaching style is lecture-based with scheduled MC Exams and LEQ's/DBQ's. His teaching style is one of the best within the school and really helps you remember the information. If you read \"Make It Stick\" by Peter Brown, you'll know what I meanSubmitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i don't see why all these negative comments. while i don't love everything about this class (mainly homework) i think he's a good teacher. he knows a lot about history, he makes you think and his tests are fair, plus he gives you study questions. I like Mr. Furey.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"at first, i really didnt like this class. i knew he wasnt trying to make class bad but maybe it was just what i thought of him. but then i realized that he actually does try to teach although it might not always get to us. this is still not my fav class but i dont dread going to it anymore. no hw on","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Furey was the funniest teacher I have had at Lowell. I always enjoyed going to his class and watching his mid lecture entertainment videos when the class would get bored of the the class content. I would highly recommend Mr. Furey for APUSH. He has weekly exams and DBQ's on Fridays, but other than than there is no homework or notes that he collects.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good man, awesome laid back classSubmitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not a lot of homework but exams are kind of hard because some of the questions are very specific. He's a cool guy though. Pretty funny too.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he clearly cannot count. his grading of homework is ridiculous. i should make my periods the size of raisins so he can see them. *frustration","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I like this class. He knows his stuff and is different than some teachers. He doesn't favor me, but I am the quiet type and I appreciate his easy going attitude. I don't get what these comments are saying, Mr Furey obviously loves history and that is important in a teacher.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My main problem is how he picks on certain people. Also, he has unfair methods such as some people not having to do current events. Mixing these 2 problems together, that means the few people Furey picks on would have to present 3 times, while the others would usually be 2. I hope he chooses people","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST TEACHER EVER!!! HAD HIM FOR USH THE ENTIRE YEAR. HE TELLS A LOT OF STORIES ABT HIS PAST AND THEY'RE PRETTY FUN, MAKES A LOT OF JOKES. YOU EASY B, IN ORDER TO GET AN A DO GOOD ON TESTS. POWERPOINT PRESENTATIONS EVERY GRADING PERIOD WITH PARTNER OF YOUR CHOICE. HAD HIS CLASS 19/20 ALWAYS LET US EARLY! REALLY NICE. ONLY CLASS I LOOKED FORWARD GOING TO","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Jedi Master, Ninja Warrior, a \"master\" in every sense of the wordSubmitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You can pass his class if you do the homework. Homework=40%, Tests=45%, & PP=15% He doesn't teach well. Had him for MoWo F'14. He is really boring so make sure to bring a pillow and blankets. Talks in a monotone voice. Finished with an A because he messed up on the final. His tests are confusing. Some things on the test that I have never heard him say either because he never said it or I wasn't paying attention. Tries to be funny but makes me hate to class even more. PPs are easy.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is very intriguingSubmitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"in his democracy class he doesn't just stick to the textbook, but focuses on specific topics. good lectures and mostly interesting class discussions.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have him for US History. He's a horrible teacher. His tests are ferocious. The way he teaches is different from others, covering a large topic, which will make it harder for me to switch teachers, as others teach by chapters. He claims he's not a hater, but he's been picking on me already. When wr","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pretty chill class. Easy B, and an A isn't too hard. Tells jokes and stories in class. In class handouts and videos can be boring, but still a fun teacher.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's always interrupting when people are doing current events or power points. It's really rude of him to do that. He also says he's there to \"lead you in the right direction\" but he's always forcing his opinions on everyone.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Furey is a super awesome teacher. I've learned so much from him.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he only calls me bud. don't sit by the door or he'll make you get the door and the lights.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took a little getting used to his teaching style, but he knows a lot about history and makes it interesting. Not super easy, but if you do the assignments, you'll do fine. Good class.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Doesn't accept late homework so make sure to be on time!Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Furey's lectures are a bit confusing and he tends to stutter a bit, but otherwise, I feel that he's a pretty good USH teacher. Knows his stuff, easy homework every other day, and tests are doable, with mostly A-B range. Good humor, interesting facts, knows his stuff. Study out of the book for te","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"chill and funny class. pretty cool teacher. connects with students really well","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is knowledgeable and it is evident that he tries his best. However this is his first year in aPush so the road is still a bit bumpy.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take him during second semester of USH - once he gets into his local history unit, he really knows that kind of stuff. Interesting class discussions. He should actually start up some local history courses","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had him for American Democracy.Mr. Furey was a much better teacher than I expected. Even though he can be boring and repetitive sometimes, he's still pretty cool, and his class is easy. He mainly does a lecture, then we look at some handouts, and maybe watch some videos. There's barely any hw, and there's only a few powerpoints/current events presentations you gotta do, The tests are also hella easy too. If you can't take Steele, take Furey. You won't regret it.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him freshmen year and he was hilarious during power point presentations and slightly obsessed with his Mexican wife and Spanish itself. He's basically a white guy trying to be Latino but he's funny and respectful of the culture. He makes test guides that are extremely helpful and take a lot of notes during presentations.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a really cool teacher I like him but he uses the textbook only for hw and tests. If you dont like lectures, don't take him. We do a lot of worksheets. The tests are passable as long as you STUDY and look at the study guide. If you try to just wing it you won't get a good grade. The study guides are sort of long, but I do them and I get A's so...All in all, I like him but he does come off a little strange at first.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The amount of homework is fair. He gives out a term sheet that has everything that will be on a test, which is helpful. He's a decent lecturer and seems knows the topics we're learning about pretty well. Mostly uses video clips and worksheets to teach from. Weekly Current Events are pointless and a","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He does not know his history. He just doesn't. No, George Washington was not a co-founder of the Federalist party. He also over uses terms \"marianate/Squirrley/cat in the hat\". His powerpoint presentations are baised to how much he likes you. I almost got into an argument with him before he gave me","rating":3.8,"version":1}],"rating":3.719999999999998}},"__N_SSG":true}