{"pageProps":{"teacher":{"name":"Mei-Ling Portugues-Brennan","departments":["Math"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016"],"classes":[{"name":"Algebra 2","block":"3","semester":"Fall2014"},{"name":"Algebra 2","block":"7","semester":"Fall2014"},{"name":"Geometry","block":"2","semester":"Fall2014"},{"name":"Geometry","block":"4","semester":"Fall2014"},{"name":"Pre-Calculus","block":"6","semester":"Fall2014"},{"name":"Algebra 2","block":"5","semester":"Spring2015"},{"name":"Geometry","block":"2","semester":"Spring2015"},{"name":"Geometry","block":"4","semester":"Spring2015"},{"name":"Pre-Calculus","block":"3","semester":"Spring2015"},{"name":"Pre-Calculus","block":"8","semester":"Spring2015"},{"name":"Algebra 2","block":"2","semester":"Fall2015"},{"name":"Algebra 2","block":"4","semester":"Fall2015"},{"name":"Geometry","block":"8","semester":"Fall2015"},{"name":"Pre-Calculus","block":"3","semester":"Fall2015"},{"name":"Pre-Calculus","block":"5","semester":"Fall2015"},{"name":"Algebra 2","block":"4","semester":"Spring2016"},{"name":"Geometry","block":"2","semester":"Spring2016"},{"name":"Geometry","block":"8","semester":"Spring2016"},{"name":"Pre-Calculus","block":"3","semester":"Spring2016"},{"name":"Pre-Calculus","block":"5","semester":"Spring2016"},{"name":"Algebra 2","block":"2","semester":"Fall2016"},{"name":"Algebra 2","block":"6","semester":"Fall2016"},{"name":"Algebra 2","block":"8","semester":"Fall2016"},{"name":"Geometry","block":"3","semester":"Fall2016"},{"name":"Geometry","block":"7","semester":"Fall2016"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is actually 1 of the best geo teachers. It may take a while to get used to her class and teaching styles, but her class always average 85 on tests and do the best on finals. Class is mainly going over hw problems in groups and taking notes. Tests aren't that hard, and hw is light. She may be hard to understand b/c of her accent and how fast she talks but she does her best to make sure you get it. Recommend but guarantee she will mess up your name in some hilarious way","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a lot of people say that she is a horrible teacher when she is actually pretty good. people complain that she goes to fast but if you actually think about she is right on time when it comes to what chapter the class should be on. she really does try to help students understand like she literally wont move on until everyone understands so its your choice if you choose to ask questions. overall shes a good teacher.Submitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's alright, her teaching style is mostly reviewing hw and a bit of lecturing. She breezes through things super super fast and isn't very good at answering questions in class. Also, her grading system makes no sense andthe only thing that makes up your grade are tests. Once you get yourself down in a pitfall, its quite hard to get back up. However... good news is that she is very helpful one on one if you go to see her in the math officeSubmitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is actually not that bad. I hear really bad comments about her but tbh she is not bad at all. Her classes move fast but we learn a lot. She makes classes more fun by telling her little stories and acts. Sometimes I don't understand why people say she is bad or horrible, tbh she is not as bad as other people think.Submitted by a student","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"These other people don't like ms p because they mess around in class","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms P is actually severely underrated. Her class can be frustrating or tedious at times, for the reasons aforementioned, but in the end you learn a lot and are well prepared. Her class consistently does the best on finals and the CLA (our geo class tied with her other one for top CLA score in the district,) and she curves or designs tests so the average is an 80. She's friendly enough but I hear it's hard to arrange tutoring--just ask questions in class and she'll go in depth.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. P is an alright person from my experience but she could use some help teaching. She's just another robot like most math teachers at Lowell aside from a select few.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mrs.p is an ok teacher. you have to teach yourself the material, but you can ditch or do hw in class.","rating":3.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MS. p. is ok. alot of peoplemight think shes not great, but dont go out of your way to not take her. She is nice and never really checks homework she just goes around signing it, and if she assigns like 20 problems you can just do the first side of a page and you get 100% because she doesnt look at it much. Her tests are manageable, and she will take late work sometimes. she isnt the best at explaining but not horrible","rating":3.6,"version":1}],"rating":3.6000000000000005}},"__N_SSG":true}