{"pageProps":{"teacher":{"name":"Meredith Santiago","departments":["English"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"English 2","block":"2","semester":"Fall2014"},{"name":"English 2","block":"4","semester":"Fall2014"},{"name":"English 2 Honors","block":"1","semester":"Fall2014"},{"name":"English 2 Honors","block":"5","semester":"Fall2014"},{"name":"English 2 Honors","block":"1","semester":"Spring2015"},{"name":"English 2 Honors","block":"5","semester":"Spring2015"},{"name":"English 1 Honors","block":"2","semester":"Spring2015"},{"name":"English 1 Honors","block":"4","semester":"Spring2015"},{"name":"English 2 Honors","block":"1","semester":"Fall2015"},{"name":"English 2 Honors","block":"5","semester":"Fall2015"},{"name":"AP Research","block":"4","semester":"Fall2015"},{"name":"English 2 Honors","block":"1","semester":"Spring2016"},{"name":"English 2 Honors","block":"5","semester":"Spring2016"},{"name":"AP Research","block":"4","semester":"Spring2016"},{"name":"English 1","block":"2","semester":"Fall2016"},{"name":"English 1","block":"6","semester":"Fall2016"},{"name":"English 2 Honors","block":"3","semester":"Fall2016"},{"name":"English 2 Honors","block":"5","semester":"Fall2016"},{"name":"English 2 Honors","block":"3","semester":"Spring2017"},{"name":"English 2 Honors","block":"5","semester":"Spring2017"},{"name":"English 1","block":"3","semester":"Fall2017"},{"name":"English 1","block":"5","semester":"Fall2017"},{"name":"English 2 Honors","block":"2","semester":"Fall2017"},{"name":"English 2 Honors","block":"6","semester":"Fall2017"},{"name":"English 1","block":"3","semester":"Spring2018"},{"name":"English 1","block":"5","semester":"Spring2018"},{"name":"English 2","block":"2","semester":"Spring2018"},{"name":"English 2","block":"6","semester":"Spring2018"},{"name":"American Literature","block":"3","semester":"Fall2018"},{"name":"American Literature","block":"5","semester":"Fall2018"},{"name":"English 2","block":"2","semester":"Fall2018"},{"name":"English 2","block":"6","semester":"Fall2018"},{"name":"English 2","block":"2","semester":"Spring2019"},{"name":"English 2","block":"6","semester":"Spring2019"},{"name":"American Literature","block":"3","semester":"Spring2019"},{"name":"American Literature","block":"5","semester":"Spring2019"},{"name":"American Literature","block":"3","semester":"Fall2019"},{"name":"American Literature","block":"5","semester":"Fall2019"},{"name":"English 2","block":"2","semester":"Fall2019"},{"name":"English 2","block":"6","semester":"Fall2019"},{"name":"English 2","block":"2","semester":"Spring2020"},{"name":"English 2","block":"3","semester":"Spring2020"},{"name":"English 2","block":"5","semester":"Spring2020"},{"name":"English 2","block":"6","semester":"Spring2020"},{"name":"English 2","block":"2","semester":"Fall2020"},{"name":"English 2","block":"6","semester":"Fall2020"},{"name":"English 2","block":"3","semester":"Fall2020"},{"name":"English 2","block":"5","semester":"Fall2020"},{"name":"English 2","block":"2","semester":"Spring2021"},{"name":"English 2","block":"6","semester":"Spring2021"},{"name":"English 2","block":"3","semester":"Spring2021"},{"name":"English 2","block":"5","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-06T09:41:30.767Z","text":"you will not regret taking her, but beware she runs out quickly. everyone loves her and you will never hear anyone complaining about her class. she is super chill and understandable. an easy A if you do the work, but you will still get good feedback on your work. honestly, one of the best english class you will ever take, in all aspects.","rating":5,"version":0},{"timestamp":"2020-05-02T03:35:55.204Z","text":"Great teacher super chill you won’t do to much work very discussion based... notes are not enforced usually... but they are recommended. TAKE notes or you will be blindsided when the one big essay comes around and you can’t rember what happened because you didn’t participate enough.","rating":5,"version":0},{"timestamp":"2020-05-01T23:56:23.735Z","text":"This class is probably the most chill English class that you will ever take. She always asks her students how they feel about her workload and she is very conscious about giving personal feedback for everyone. She is very understanding and also does not care what you do in class as long as you are paying attention to the work. She is a good person, and also very funny. If you want to have a good time while still getting good feedback on your writing, then this is a good class to take. You will not regret it.","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My daughter has Ms. Santiago for 9th grade English and she is her favorite teacher. She encourages and challenges her, and creates an overall very positive learning environment. We are very grateful that our daughter has her - this is the best part so far of her being at Lowell.Submitted by a Parent","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE HER AND HER CLASS","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"most chill teacher in existence. we had a 10 minute presentation project and she let someone's be only 4 minutes long. if you ever stress about something being due, don't worry about it because she will probably extend the due date by like 2 weeks. on most days she just sits at her desk and looks like she wants to die, so we just leave her be. we love her though. (summary - chill, easy a, you'll like her)Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Santiago's class is extremely chill","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Santiago is so awsome!She really teaches you things and she is very easy.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Avoid!! She doesn't help you with your personal statements at all!! SHE DROPPED EVERYONE'S GRADE BY A FEW PERCENT FOR NO REASON! And she's not even as easy as an A as people make it to be either...","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is the nicest woman alive and i dont think i have ever loved a teacher as much as her. her class is fun and she is very understanding and relaxed. her class is very refreshing after having a bunch of boring teachers. i strongly reccomend her and think she is a great person! DEFINITELY TAKE!!!!!!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Santiago's class is great. She can be a tough essay grader, but she's clear what she wants and she'll answer questions about essay structure and how to get a good grade on it. Overall her class is easy and low-pressure, but you actually learn stuff in it. Discussions are very interesting and help to understand concepts from literature. She's also open to suggestions about the class. There is also very little homework.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My 9th grade daughter has her and LOVES her!!! She is a very good teacher.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the best","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is amazing. I have her for English now and she is really nice. She's wiling to help you print out your homework everytime and she teaches really well. TAKE HER! :)","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best teacher ever! She's so relatable and funny, and understands that we all have lots of work from other classes. Super fun class, very chill, I actually look forward to her class!Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"super easy. had her for 10th gr. eng 1. really nice. way easy A. take her.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Have her for reg, so I can't say much about her teaching ability. She's chill though, only asks for your attention when it's absolutely necessary. We goof off a lot in reg.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Ms. Santiago for English Honors, and absolutely loved her class! The homework load is low, the discussions in class are engaging, the book choices rock, and she is super understanding and helpful. I definitely learned a lot about essay structure and analysis. She is a hard essay grader, but is honest and clear about it (no \"vague\" statements) and really helps you grow as a writer. Plus her essay prompts are great. I looked forward to her class each day and DEFINITELY recommend it.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"just do your work at some point. she grades pretty straight forward, but sometimes she might forget or make a mistake on a test or essay so you get a bad grade. very little homework","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Overall great teacher. Her class is very chill and she doesn't assign much homework. Ms.Santiago reviews before she gives out the test, if you pay attention, you would totally ace it!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. santiago is awesome! i am so glad i took her class =). her homework assignments aren't hard nor confusing, and her class is actually really interesting. must take her!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Santiago is very relatable and honest. She does fun projects and I love her personality and as a teacher.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is literally my favorite teacher ever. I had her for 9th grade english. There are never tests and she always extends the die dates to essays and projects. Rarely assigns homework. Take her!!!Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"We don't even use a textbook, you can basically do whatever you please in this class. Gives us weeks to do an assignment that should take at most 2 hours. Really easy grader, and practically a free ASubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you want an easy teacher take her. She is really nice, but not too interesting. Easy A, almost too easy. She is very understanding and you can sometimes get out of homework.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Santiago is the easiest English teacher I've ever had and I had her for English Honors as well. She's very flexible and understanding. Her class is one of those that you look forward to since she is such a great person. I still learned a lot without being completely overloaded with work. Her tests are fair and she is extremely flexible to listening to your opinion about if her test questions are valid or not.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I loved Ms.Santiagos class. There are no tests, the grade is based off of essays, in class assignments, and participation. Essay due dates are always extended and you usually get most of class time to work on them. There's lots of group work and you can choose groups so I recommend taking this class with friends. Pretty much an easy A. Ms.Santiago is also super chill and funny. I would 100 percent recommend.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"LOVE HER","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Chill class. She's helpful and understands the stress students have. She's getting tougher at grading but take her!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes great","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Santiago is really really cool! I just don't understand why she dropped a lot of people's grades from an A to a B just because of the final... -___-","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easiest English honors class ive ever taken in my entire life. I wrote my third and final essay in 1 hour and got an a-. really nice lets you use your phone and funny. EASIEST A OF MY LIFESubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Santiago is a super nice teacher. If you say hi to her before class and make some small talk she'll be very nice to you and that's a good thing to have happen. She sometimes isn't very clear in her class, but she's my favorite english teacher so far at lowell. I took her for english 2 hSubmitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easiest teacher ever. take her for expo.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Santiago is the best teacher at Lowell, hands down. She is super laid back and nice, while still teaching us. She lets you eat and use your phones in class and be really loud and talk (with a limit). She also lets you skip class during finals which is great.Submitted by a student","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The rumor about Ms. Santiago being harder is not rue at all. More than 70% has an A and the other people have a B. She is so chill and not a lot of homework. An easy A!","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's awesome but I think she's making the grading harder. )': I wish she would be a little easier. :D","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I honestly believe she is amazing. Very understanding and helpful. And if you get to know her a little, she's actually really funny. We do a fair amount of classwork and there's barely ever homework. She grades fairly! Just make sure you do the assignments and you'll be fine.","rating":4.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's cool :) but she could be picky on essays, even though we didn't write that many.","rating":4.6,"version":1}],"rating":4.630769230769228}},"__N_SSG":true}