{"pageProps":{"teacher":{"name":"Michael Ambrose","departments":["Math"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Algebra 1","block":"7","semester":"Fall2014"},{"name":"Algebra 2","block":"2","semester":"Fall2014"},{"name":"Algebra 2","block":"4","semester":"Fall2014"},{"name":"Pre-Calculus","block":"1","semester":"Fall2014"},{"name":"Pre-Calculus","block":"5","semester":"Fall2014"},{"name":"Algebra 1","block":"7","semester":"Spring2015"},{"name":"Algebra 2","block":"2","semester":"Spring2015"},{"name":"Algebra 2","block":"4","semester":"Spring2015"},{"name":"Pre-Calculus","block":"1","semester":"Spring2015"},{"name":"Pre-Calculus","block":"5","semester":"Spring2015"},{"name":"Algebra 1","block":"3","semester":"Fall2015"},{"name":"AP Statistics","block":"2","semester":"Fall2015"},{"name":"AP Statistics","block":"4","semester":"Fall2015"},{"name":"AP Statistics","block":"6","semester":"Fall2015"},{"name":"Algebra 1","block":"3","semester":"Spring2016"},{"name":"AP Statistics","block":"2","semester":"Spring2016"},{"name":"AP Statistics","block":"4","semester":"Spring2016"},{"name":"AP Statistics","block":"6","semester":"Spring2016"},{"name":"Algebra 1","block":"1","semester":"Fall2016"},{"name":"Algebra 1","block":"7","semester":"Fall2016"},{"name":"AP Statistics","block":"3","semester":"Fall2016"},{"name":"AP Statistics","block":"5","semester":"Fall2016"},{"name":"AP Statistics","block":"3","semester":"Spring2017"},{"name":"AP Statistics","block":"5","semester":"Spring2017"},{"name":"Algebra 1","block":"1","semester":"Fall2017"},{"name":"AP Statistics","block":"3","semester":"Fall2017"},{"name":"AP Statistics","block":"5","semester":"Fall2017"},{"name":"AP Statistics","block":"7","semester":"Fall2017"},{"name":"Algebra 1","block":"1","semester":"Spring2018"},{"name":"AP Statistics","block":"3","semester":"Spring2018"},{"name":"AP Statistics","block":"5","semester":"Spring2018"},{"name":"AP Statistics","block":"7","semester":"Spring2018"},{"name":"AP Statistics","block":"1","semester":"Fall2018"},{"name":"AP Statistics","block":"3","semester":"Fall2018"},{"name":"AP Statistics","block":"5","semester":"Fall2018"},{"name":"AP Statistics","block":"7","semester":"Fall2018"},{"name":"AP Statistics","block":"1","semester":"Spring2019"},{"name":"AP Statistics","block":"3","semester":"Spring2019"},{"name":"AP Statistics","block":"5","semester":"Spring2019"},{"name":"AP Statistics","block":"7","semester":"Spring2019"},{"name":"AP Statistics","block":"1","semester":"Fall2019"},{"name":"AP Statistics","block":"3","semester":"Fall2019"},{"name":"AP Statistics","block":"5","semester":"Fall2019"},{"name":"AP Statistics","block":"7","semester":"Fall2019"},{"name":"AP Statistics","block":"1","semester":"Spring2020"},{"name":"AP Statistics","block":"3","semester":"Spring2020"},{"name":"AP Statistics","block":"5","semester":"Spring2020"},{"name":"AP Statistics","block":"7","semester":"Spring2020"},{"name":"AP Statistics","block":"1","semester":"Fall2020"},{"name":"AP Statistics","block":"2","semester":"Fall2020"},{"name":"AP Statistics","block":"5","semester":"Fall2020"},{"name":"AP Statistics","block":"7","semester":"Fall2020"},{"name":"AP Statistics","block":"1","semester":"Spring2021"},{"name":"AP Statistics","block":"2","semester":"Spring2021"},{"name":"AP Statistics","block":"5","semester":"Spring2021"},{"name":"AP Statistics","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-04T15:56:29.003Z","text":"super nice teacher. lets you take tests at a later date if you ask. never grades hw and gives time in class to do hw and all slides are on google classroom. \n","rating":5,"version":0},{"timestamp":"2020-05-01T23:35:37.325Z","text":"Easy to get an A/B if you do your homework and understand it before the test comes. Exams are weighted 75% while homework/participation is 25%. It's basically the same weighting as every other math course where whatever you get on your tests average out to be your grade in the class. His explanations to questions somehow confuse me even more, but it's okay because you can easily figure out how to answer your own questions in the textbook or on youtube. Nevertheless, it's a really fun class if you're next to your friends, and he's chill but enjoys roasting students (in a funny way) while students roast him back. Definitely the type of teacher you'd want to visit again after graduating","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is okay for geo. never checks hw. i like how we get time to do hw in class and ask him if we dont get it. cool guy","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's pretty easy if you know how to teach yourself. He doesn't mind if you eat or sleep as long as you're caught up with your work. He's a really nice teacher, too! Just do well on his tests and you'll be fine. If you need help, he''ll be there to help.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class is only easy if you don't actually need a teacher that explains things with patience. He answers questions in a condescending way, and is bad at explaining. He is not accessible for help outside of class either. He mostly teaches by powerpoint and you need to make sure you take all the notes. Homework is optional but you should do it for practice. The tests can be very hard because often the problems are not like the ones in the book. I have had a very bad experience in his class.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"seriously, he's an okay teacher. doesn't explain well enough in lectures. not exactly an easy class either. grade depends solely on tests and since you aren't exactly going to do well if he doesn't teach the stuff. okay teacher, but if you have another choice, don't pick him.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"for geo 1, he didn't really explain how to do proofs that well and you pretty much have to try to understand them by yourself. but for geo 2, he was a great teacher","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His explaining is fine and he helps you more when you're doing our hw. He's a bit hard though.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He teaches pretty well. His class is very laid back. You need to try really hard on each test for an A. An A may be hard to get, but it's possible. This is general advice: Don't slack off at the end of the year if you want an A.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i feel he forgets that we are only students and he is suppose to teach us everything. he isnt the best explainer but does help.just study your but hard and trust me the tests are not that bad","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he doesn't explain the assignments we do. we just finish it in class. no teaching skills,and your grade mostly depends on a chapter test and 2 quizzes.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hes cool...cant teach well though...n i hate the way he grades!!!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a nice teacher. hw is not worth a lot, but the tests are hard and count a lot towards your grade, so know the material!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For someone who actively pays attention, asks questions, and does the homework (that he doesn't collect), the class should be a breeze. For someone who doesn't do the homework nor ask questions when confused, the exams will obviously be difficult. Your grade basically depends on test scores. He is straight-forward and quick with his teaching, so a successful experiences requires students to reach out to him. He'll gladly answer any questions. He's a generally chill person.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a nice guy, but like everyone else said, he can't teach well. Very little hmwrk, but hard tests. STUDY! He sometimes bumps your grade up for no reason. =)","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ambrose is one cool dude. He is assigns very little homework and usually does not collect it. His tests are hard, but he always lets you know what will be on them.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a laid-back teacher that you can kid around with. You don't have much homework, but his tests can be challenging. It's a little hard to actually learn in his class, but he's a good teacher overall.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"one of the WORST math teachers. he gives a lot of hw although he doesnt always grade it. the tests are very hard and his wording is awful. never offers to give retakes even when the entire class fails. allocates half the class for us to work on hw. THEREFORE he doesnt spend an adequete time actually teaching. dont take him if you like to cut class or are late habitually because he will take it out on you with a vengence. has a horrible attitude when u ask him for extra help kinda mocking.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ok, honestly if you don't get math just like THAT, don't take him, but Ambrose is so chill about hw and he's the greatest. Some think he's condescending and he might be, but he's so great. If you actually sit in your seat and listen to him lecture, he'll like you and be really nice to you. He just ignores everyone else.. BUT HE'S ALMOST MY FAV TEACHER AT LOWELL","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I really dislike him. He's laid back, but I've learned nothing, and math is already a nightmare for me -- I didn't need a lazy teacher on top of it. Tests are almost all of your grade, nothing else can bring your grade up when it falls.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He talks for maybe 10 minutes and then gives you the homework. He goes over what you'll see in the homework. His tests aren't super hard like everyone says if you do the homework and ask questions.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had him for geo and advanced algebra 2. much better for advanced alg-actually did some extra stuff not in the book. fair with grades, curved the last test because it was way too hard!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My favorite teacher! Nice, funny, and helps you in class if you ask. Some tests are hard some aren't so bad and sometimes he'll tell you what's on it. Only thing I don't like is no opportunity to make up a bad test score. He LOVES basketball.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had Ambrose for Pre-Cal 2 He doesn't collect HW and gives you 1/2 the class to do it. Tests are like 80% of your grade, but easy if you do HW in the 20 mins of class he gives you to do it in. He lets you talk in class and has a warm personality. He teaches like he wants you to learn. Pretty Easy A","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his tests are way too hard and he doesnt actually teach anything","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's really nice. He made his tests easier because he knew it was hard for his past students. he doesn't like noises that disrupts his teaching. He assigns projects, but they're fun and you get to show off your creativity.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for Geo 1.6 and 2.6. Really nice but can be confusing sometimes. A good teacher to take if you can learn from the book and through examples he puts on the board. Be sure to do your homework because he sometimes chooses those questions for tests.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr ambrose is so cool. hes really nice and funny. people say hes boring but hes not.. math is just kinda boring in general. he rarely checks hw and tests arnt that hard if u actually study.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i LOVE MR MICHAEL AMBROSE <3 !! TAKE HIM for sure!! he`s really easy to talk to and easy to get along with.. just dont get on his bad side !! GO PISTONS & MR AMBROSE !! (;","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Ambrose is a good teacher and even nicer guy. He really cares about the students. Tests are basically the same type of questions he goes over in the beginning of class. Homework is optional, but helpful. If you let him know you're trying hard, he may round your grade up due to participation pnts","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy easy lazy","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool teacher. teaches well but the tests can sometime be a little hard so you gotta really know the material. other than that, pretty cool guy.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not bad as far as math teachers go, pretty chill and he NEVER checks homework, which I love. Not the most amazing teacher in the world, but not the worst either, and considering other math options, i'd take him again.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's pretty reasonable. some tests can be hard, but as long as you're pretty smart, you'll be able to get an okay grade. just don't be stupid","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Probably the easiest math class that has ever existed. Although, slacking off too much means you fail the tests.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I've had him like 4 times. He's nice and patient and explains more and more the higher you go. Tests are ok, just have to be ready for them because he won't give make-ups.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Every school has bad teachers. Personal dislike, confusion, favoritism... but this one just DOESN'T teach.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ambrose is tight. I took him for Adv Alg and Pre Calc and got A's for both courses. Hes fun to joke with and the class is very laid back. As far as his teaching goes, he wasnt too clear when explaining material. Everytime he would try to help me, I would be more confused. So basically, I flourished throughout his classes from learning from classmates and reading the book, not really from him. Dont skip his exams. His make up exams are so much harder. Take him if u want a chill class.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool teacher. true can't really teach but he let's u do ur own stuff during class, sorta like study hall. another great thing is that the classwork is the HW.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a great guy. I only had him once for Precalc, but I did really well in the class. Just copy down what he writes on the board and you should be okay. If you're still confused, you can keep asking him until you get it. People say he's not good for the other math subjects, though. I thought he was great for Precalc.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he spends a lot of time going over hw or having you do hw so not a lot of room for actual teaching. you dont really learn that much but his tests are relatively easy and he's really nice. really easy b. pretty easy a.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Ambrose is so nice. his class is pretty easy too. he teaches for first half of the class then we get time at the end to do our hw. his tests are pretty easy too. if you're a math genius, then u should get easy A's without studying. =)","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ambrose is cool, he's totally helpful, all you need to do is ask, and he'll let you come in during his free mods. Cool dude too","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is a cool teacher. can't realli teach dat well. um... his test is hella hard.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"GOOD TEACHER take him if u can. GO TO CLASS DO NOT CUT LIKE ME or u will get a C or Fail. anyway tests are easy if u go to class and pay attention. sacramento Kings fan so start hating on the Lakers if u were you","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's not bad........ but pretty nice cant really teach though","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is really nice and generous about grades but tests are killers!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"my favorite teacher!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's great. just write down everything he puts on the board and know it. totally fair grader very patient and always so nice about helping in class. and great atmosphere for a math class! but he's not teaching precal this semester..arrgh!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr.ambrose is really nice and the whole atmospohere of his class is laid back. his tests are pretty hard but he is doing better at explaining. average amount of hw and sometimes you gotta rely on the other kids to help you out. also he really wants everyone to pass and raises your grade/doesnt count it as much if the whole class did badly on a test.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's an o.k. teacher but it's hard to learn in his class. [Pros] Doesn't collect homework, don't have to participate in class. [Cons] He goes over the material too fast and only gives like 1 or 2 examples in each chapter, then expects you to know everything on your own. If you read through the examples in the beginning of the chapter, you might understand it better. His tests contain only the hardest possible problems though. But he's a good guy and a major basketball fan.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"not a particularly great teacher, but compared to the others, id take him again. its not that he doesnt teach you the stuff, he just doesnt explain it in great detail. anyway take him if you can grasp concepts really easily. oh and test are a killer x_x","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"So he's laid back and real nice. is that not what lowell kids need? would you really rather have another class that adds to your other homework? well personally, i think he's cool and teaches you the core of the material you need to learn. while we figure out the other stuff, if it's too hard, he'll always help.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Overall, he's a a pretty cool teacher, but is easily annoyed. You can tell he has a sense of humor, though. He realli likes basketball, and won't fail you unlee","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's an ok guy, plain, simple, just needs to explain things more so that the students can understand","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"super easy class. take him","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"for adv alg: doesnt collect hw, really nice, tests arent really hard like people say, just study. gives you free hw points even though you don't have to turn it in. in class, he teaches for 20 minutes, and the rest of the time is for doing your hw in class. if you're kind of lazy then take his class, but just study for tests !","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easiest math teacher ever. had him for three semesters and got all As. test are similar to homework problems. ask if you need help.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Explains what you need to know then you start working. I like him because he dosn't waste time. Easy-going and good atmosphere for a math class.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's nice and all but he doesn't really teach. you have to read the stuff yourself and learn it yourself..when you have questions he let's you do it yourself and doesn't help.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's nice. not good at teachin tho. he doesnt kno his own subject th well. he cant explain. all bookwrk. hw erday but very lil n u can do it and finish in class","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He just goes by the book but take his class cuz he's nice...he let's you do the math HW during class!!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you normally get A's in math, then it would be a little harder getting an A in this class. If you're a B student, expect B's or even C's. Homework isn't worth anything so it may be a little harder to get an A. Ambrose doesn't teach the best and half of class is doing homework.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is helpful when you work on assignments in class and he does review the hard hw problems. tests are not easy and he doesn't curve.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's nice. But, he does not teach at all. He gives you the homework when class starts and expects you to know it. When you ask for help, he will just give you the answer.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He goes over the hw everyday so he does explain. Sometimes in class he only gives hints because he wants you to think.Avoids long boring lectures. His system worked great for me.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"not a great math teacher. i learned everything from the book because he can't teach well. his lectures are very slow but i feel little stress in his class. little homework, tricky tricky tests. know the material! well!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is not as hard as everyone says! his tests are hard only for geometry, but for adv. alg, its so easy! i havent gotten an A in math since like freshman year and this time i got an A easily. his teaching is very good and does his own notes, because not everything in the book is needed for the semester i guess. He also neverrrr checks homework. Take his notes because his tests might have a problem that he lectured in class. He always gives at least 19-15 minutes to do homework at the end of clas","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"dont take him for geo. he isnt very helpful and he doesnt explain things he just gives you problems to do for the whole class and his tests are very hard. and he seemed to take great joy in handing back tests when people failed.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"loved his class! he's nice and cool and all like everybody says but i actually really liked his teaching. learned more this semester and his tests are not bad if you know how to do the problems he assigns. always goes over those problems if you ask him to the next day. definitely taking him for precalc.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I actually look forward to go to geo with him as the teacher.. We all work together on the HW which he never collects anyways.if we are quite, theres something wrong. We <3 ambrose","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really easy n cant teach","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Honestly and truthfully do not take mr. Ambrose if u ur a student that likes to not do hw since he does not check hw u therefor choose not to do it and since HE DOES NOT TEACH AT ALL u will fail horribly also besides not teaching at all he does not care what u do in class he literally walks around the classroom and stares at us using our phones or doing other classes hw he is so chill he does not care if u just sit there on ur phone // AGAIN HE DOES NOT TEACHSubmitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ambrose is a cool guy. not the best teacher, but if you ask him questions, he'll answer them. he tests for geometry are hard (i always got Cs).. never checks homework..lectures for about 10 mins and he gives you like 30 mins to do your homework.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Depending on who you are, Ambrose is a good teacher. 80% of your grade is tests. The other 20 is free. You don't have to do hw, but it helps you to understand. Tests are usually based on hw.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He has a really cool, chill personality, but he doesn't teach as well. I still had fun in this class though.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Mr. Ambrose.. Enough said... And I got a C in his class..","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Ambrose was probably my favorite teacher freshman year. I took him 1st period and everyday class was super chill. He might seem hard or like he doesn't teach very much at first but if you ask questions and do the work he assigns (he doesn't check it) you should be prepared for the test. 10/10 would take againSubmitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he never went over anything in our class.we had to ask each other to explain the hwk. the whole class barely passed with a C. classwork was hwk so we talked a LOT.tests are hard because you have no idea since he doesn't explain. geez.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Never take Mr. Ambrose...you'll never learn anything because his tests are way too easy, and he does not know how to teach!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Super Chill class. I like how he only teaches the material that we need to know, unlike other Adv Alg. teachers that go way beyond the lesson.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best math teacher I've had in a while, possibly one of the best at Lowell. You'll have to pay attention and do homework; it'll help you do better on tests. Ask for help too! He nice guy.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is really funny because the kids in class makes funny jokes about him and how he gives us a look when we do something stupid.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's really straight forward and doesn't get side tracked with teaching you random stuff! Super nice to his students and helps you with any questions you have. Homework is basically optional since he doesn't check it but it's good to do it so you understand the material. His tests can sometimes be hard and he can deduct a lot of points for just one question. Your test scores are basically your grade. I didn't get an A in his class but I did learn a lot!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"haters say he doesnt teach but thats because they dont pay attention. SUPER chill class.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"DUDE! Ambrose is the bomb! Honestly, he's a really good teacher.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"EASY!! just pay attention in class.... which isnt that hard guys....NO HOMEWORK FOR GEO 1!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Chill homie. Hard but chill. If you pay attention and read the textbook you will get an a. Really helpful and gives practice tests which is very helpful. Power points are straight forward and NEVER checks hw","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. ambrose is a really really nice teacher hes very helpful when you ask him for help he lets you on cocurricular day etc., and his tests are not so bad but it helps if you do the homework and pay attention in class when he teaches. oh yeah did I mention he's really nice!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's hella cool and a reasonable grader, but somehow my grades just dont seem to work out. If you mess up on one test kiss your A goodbye because you are NOT getting it back, sad but true. And NEVER cut on a test day unless you can get a re-admit that can convince the devil himself...","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The class atmosphere is laid-back and tests are pretty easy, though I suggest not taking Ambrose if you have a hard time with math. Mostly, you'll be learning from the textbook.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. ambrose is not a good teacher. the geeks like him because THEY UNDERSTAND THE MATH ALREADY. he's not good if you don't get it at all. bad with explaining","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Personality is laid back, but he has favorites. Most of the time you have to self teach yourself because his lectures don't really explain. 85% of your grade is based on test grades. His class is also boring, but he lets you do homework in class.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's really cool & nice... but honestly... you're better off just teaching yourself from the textbook...his tests are pretty tricky but fairly easy if you study..like..really study and understand the material... he loves proofs by the way. so be prepared to love them too. and he doesn't fail kids. the only way to get an F in his geometry class is to cut class. other than that..he gives you a D if you're barely passing..like i was..HAHAHAH.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a reallie nice teacher.. but he can't teach tho. but hes ALOT easier than merlo!! most of his tests are hard!! theres onlie 2 tests for each grading period","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Like everyone says, Mr. Ambrose is soooo nice but hes not the best teacher. He's just a naturally good hearted person and is always willing to help. But he is kind of boring when it comes to class and doesnt know how to brighten up the room, so basically my class is kinda dead.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes the guy to take if you want less homework...but be sure to study for tests!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's really fair, like the person below me said. he also cares about students, so if you like do well, but all of a sudden totally bomb a test, he'll ask you about it (in a nice way). he's also a bit hard, if you're not ready for whatever he's teaching. just try hard, and you won't do poorly in his class.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"It's defininely a LOVE HATE relationship, but he is so cool and so nice.. and his class is so chill, but you have to have self-control, like doing homework on your own. He doesn't like lecturing, which is good, so just ask him if you need help. But he's hella tight","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for Goemetry 2.6. His tests were hard for me even though I studied for hours...so make sure you really KNOW the material. Also, study all the (hard) problems that he assigns for homework. He hardly ever checks homework but do the homework (it'll help on the tests). He also assigns (fun) projects that can raise your grade and his quizes are sometimes easy. He might raise your semester grade even if your tests/final's results are bad.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Ambrose is a good Geo teacher. He's probably the best of the few, actually. She let's you do homework in class, and he explains it pretty well.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his class is easy. just be prepared for his test. those guys can get sticky. u really have to study and know the material for his test. but overall, he's cool","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"definitely take him for algebra 2B! he's actually really helpful as long as you do work in class. I like his tests better this semester than last one. Hoping he's teaching precalc.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's an awesome guy. Really laid-back class- he'll explain the section at the start and then give the rest of the class for homework. He'll help you with the questions if you need help. 80% of the grade is tests.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"lets you do hw in class moves around and always helps if you ask..easy to talk to. good class.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool teacher, get to do hw in class and you can always ask him questions then for pre cal. tests are not hard as long as you know the hw well.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's pretty cool, but don't expect to learn anything from him. You basically have to teach yourself everything and his tests are very hard. Study a lot. Be nice to him, get on his good side.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Well, Ambrose is a pretty cool teacher... First, you read the book, try to figure it out, and if you can't he'll explain it. He's really nice...","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him this past fall and I didn't learn anything from him. I just got further and further behind and he wasn't there to help me. I am now moving on the the second semester of Geo, but not very sucessfully.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome teacher! i love his class, even though im sure i have a C in the class. i love it! he brough scones for 1/2 class on co-curricular day yo!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He doesn't explain things really well. And I hate the way he grades on tests.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes a chill teacher. chill class. easy A. :)Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He smiles a lot, even though kids make fun of him in a nice way.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he was really nice and cool...his tests are real hard i got Cs the first two grading periods (for geo 2.6) and then an A in the third and came away with a B for the semester. his tests were hard for me but somehow everything clicked in the end and i finally figured out what he was looking for. great class, great teacher, and he doesn;t care about the hw that much! but do it anyways, you;ll need to in order to know the material","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's so chill. i seriously adore math class because of his attitude.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Ambrose's class has a really laid back atmosphere. He's always willing to help or reexplain a concept if you don't understand it. Sometimes, he's not very clear, but that's why you should ask. His tests are pretty easy if you pay attention in class and do the homework.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Ambrose is awesome! Very nice, extremely helpful, and a good basketball player to boot!","rating":3.8,"version":1}],"rating":3.8119658119658193}},"__N_SSG":true}