{"pageProps":{"teacher":{"name":"Michele Winter","departments":["Visual Performing Arts"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017"],"classes":[{"name":"AP Music Theory","block":"5","semester":"Fall2014"},{"name":"Orchestra 2","block":"8","semester":"Fall2014"},{"name":"Orchestra 3","block":"3","semester":"Fall2014"},{"name":"Orchestra 1","block":"2","semester":"Fall2014"},{"name":"AP Music Theory","block":"5","semester":"Spring2015"},{"name":"Orchestra 2","block":"8","semester":"Spring2015"},{"name":"Orchestra 3","block":"3","semester":"Spring2015"},{"name":"Orchestra 1","block":"2","semester":"Spring2015"},{"name":"AP Music Theory","block":"5","semester":"Fall2015"},{"name":"Orchestra 2","block":"8","semester":"Fall2015"},{"name":"Orchestra 3","block":"3","semester":"Fall2015"},{"name":"Orchestra 1","block":"2","semester":"Fall2015"},{"name":"AP Music Theory","block":"5","semester":"Spring2016"},{"name":"Orchestra 2","block":"8","semester":"Spring2016"},{"name":"Orchestra 3","block":"3","semester":"Spring2016"},{"name":"Orchestra 1","block":"2","semester":"Spring2016"},{"name":"Piano Lab 1","block":"6","semester":"Spring2016"},{"name":"AP Music Theory","block":"5","semester":"Fall2016"},{"name":"Orchestra 2","block":"8","semester":"Fall2016"},{"name":"Orchestra 3","block":"3","semester":"Fall2016"},{"name":"Orchestra 1","block":"2","semester":"Fall2016"},{"name":"AP Music Theory","block":"5","semester":"Spring2017"},{"name":"Orchestra 2","block":"8","semester":"Spring2017"},{"name":"Orchestra 3","block":"3","semester":"Spring2017"},{"name":"Orchestra 1","block":"2","semester":"Spring2017"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really nice teacher. She's easy, fun, and not to mention always happy. She'll work with you one on one to improve your playing skills as well as work with the class to improve her teaching skills and techniques. She's clear with instructions and really helpful.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"How does she do it? She has this special magic that makes me enjoy her class and how she teaches. I have her for Orchestra, and she takes the time to help you if you need it. She is very knowledgable and understands her students. Ms. Winter is also very nice and is weird sometimes but in a good way. If you like music in the slightest, you HAVE to take Ms. Winter!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's nice and all, but very suspicious when it comes to absences...other than that, really cool","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I like her, and believes she would do wonders if she taught both band and orch.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes the best","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Orchestra is super easy and fun, but she was not that great in music theory. Bring on the dislikes, but have YOU taken AP music theory?? Sure, it was easy, but she did not prepare us. I basically self studied for the AP exam and got a 4. I recommend the Barron's book which the class provides. Super insightfulSubmitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MS. WINTER! For AP music theory, it was suchhh an easy class and I passed with a high A. She preps you pretty well for it and I passed with a 4. She's super nice and always let us out early on long days. TAing for her is also the best, because it's super easy and she lets you off the hook if you need to do something important. Make sure you take her!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really makes you want to enjoy music !","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Winter is awesome! Although her class could be sometimes boring, and the musics are sumthings boring..but other dan that..she's kool..VERY nice! funny!!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very nice n helpful, esp. when learning a new instrument. not the most exciting music, but easy A","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very nice...one of my favorite teachers","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE THIS WOMAN.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really awesome teacher. She's really really nice and funny at times. She's always there to help you. :]","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Absolutely amazing teacher! Only gets mad at people who aren't serious about music and slack off in her class A LOT otherwise you're fine. MUST TAKE!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Nicest, caring, and most lenient teacher you'll find on the campus. Passionate about music and will take time to assist students struggling with music.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i hate the way she teaches, if she even does. her method is stupid because it doesn't work. her auditions are not that at all. the music is yucky.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes easy and all, but the music is too easy,. its like middle school stuff.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"How can you not like her?","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Winter is such a genuine and sincere teacher! She truly cares about her students and wants us to get better. She is always calm and has a unique sense of humor. Her class is a guaranteed A. It's impossible to hate her and impossible to get in trouble in her class. You can be tardy too.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is pretty good, but when she tunes the orchestra, she always tunes the e string way too highSubmitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Winter is just amazing. She's nice, funny, caring, and knows how to teach music. She encourages learning and uses technology well. Simply put, she's great. Easy A as well.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very nice, very friendly, very good teacher.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"love ms winter. i have her for orchestra but the music is waaaaaaaay to easy!!!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is an amazing orchestra teacher. she teaches with enthusiasm and passion and loves her kids. shes kind and fun to talk to.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very nice, willing to help at anyytime. Very well planned and organized person. Just wants to make music. Gradewise, easy A.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She really dam wants you to succeed... and best teacher ever!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's real nice and is super modest. altho the class can be boring but she's cool.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love ms winter!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Winter is the nicest person I've ever known. She knows what she's doing and she's always helpful and in a good mood. Really easy A in her class, and she is very friendly to talk to.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Beautiful amazing person!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She truly cares about all her students.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i LOVE WiNTER!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She makes you love music not just your instrument and playing music. She makes the music come alive.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You're better off self studying AP music. She doesn't have a proper grading system and grades based off of musical ability and how much she likes you. I have no idea why she tossed me a C. She only prepped us properly for the FRQs. Lots of the MC was vocab which we barely went over during the 1st semester & that was never brought up in the 2nd semester. You could self study in a month. Mr. Wagner probably would've been a teacher.Submitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy if you're somewhat good, very very helpful, very clear, really nice, practicing might get boring after awhile","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The nicest and most sincere teacher in Lowell. Ms. Winter is the best!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's a very nice person and very easy. but she makes music so boring. there's no creativity in the way she conducts and she likes to crack really lame jokes ): she's really really easy tho. take orchestra for a grade bumper upper(=","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had her for 3 yrs when she taught at hoover, then 1 more when she taught at lowell. very cool and very nice","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms.Winter","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best teacher ever! ;D","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes' really really nice & will work with you if you're having troubles. she's really fair except sometimes the students that she have test the rhythm at the beginning of the year arent, oh well just hold a grudge agains them in your own time","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take her for AP music! She is soooo friendly and will help you get through any struggles. You learn a lot and it is a very fun class. You really have to enjoy music to be in that class. She's great.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She really cares about you learning music. She is a really good teacher and you can tell she loves music. She is such of a sweet lady in general! [:","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is a good teacher. it is easy to pass her class. do well in the audition and if you dont just see her and work on the problems and she will boostupyourgrade","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP music theory with Ms. winter is probably the easiest AP class offered at Lowell. You'll need to have prior musical knowledge to take it, but she's extremely helpful and there's no homework! Really chill class, although I get a bit bored sometimes. 1-2 tests/grading period. It's not hard to get an A, but you can't be absent often bc she teaches new material everyday.Submitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really easy. all u have to do is just play and do ur thing","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Winter is an awesome teacher. She's friendly and easily approachable and will help you if you need help. Though i have noticed that she does play favorites a bit, it's easy to get on her good side, and it doesn't really affect your grade that much. She gives you so many chances to get an A anyway. She really wants you to do well and learn in her class.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best teacher ive ever had in my life. very nice lady.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i got only two words to say...... AWESOME TEACHER!!!!!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher, although her classes can be a lil boring sometimes.. and the music is a little \"yucky\" sometimes","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Sweetest lady ever. Was my reg teacher the past 4 years, I got lucky. Great orchestra teacher too. Very passionate about what she does. Always prepared for anything.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's really nice","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's really into music. If you show effort in your playing, she'll praise you so just give it your all! Friendly and frank.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She puts you before herself cause she CARES about her students! :D","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A, very nice, I have her for orchestra and she is very good.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Learned more stuff from her in a couple of months than some of my old teachers in a couple of years...","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really nice, very helpful, easy A cause she teaches orchestra","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"=D ms winter is AWESOME!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's such a sweet teacher! No one could ever truly hate her. If you have her, she's strict on attendance and readmits.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"im in orchestra, she has nothing to grade you on. nice person. just show up and play music, easy a and fun if u like music","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes REALLY NICE, & shes able to help you when you need need help..i don`t get why people say th musics boring,cus if you dont like th music,obviously shouldnt hav joined orchestra","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a wonderful conductor AND THE NICEST TEACHER IN LOWELL!!!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice person for orchestra. how is she for the ap class she teaches? music theory i think? anyways, shes really good at what she does, for orchestra at least.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is very friendly although very business-like she really helps you improve","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MS WINTER!! AP music theoryyyyy <3 she's so cute. and sweet.","rating":4.8,"version":1}],"rating":4.800000000000006}},"__N_SSG":true}