{"pageProps":{"teacher":{"name":"Michelle Trimble","departments":["Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Chemistry","block":"6","semester":"Fall2014"},{"name":"Chemistry","block":"7","semester":"Fall2014"},{"name":"Chemistry","block":"8","semester":"Fall2014"},{"name":"Organic Chemistry","block":"4","semester":"Fall2014"},{"name":"Chemistry","block":"6","semester":"Spring2015"},{"name":"Chemistry","block":"7","semester":"Spring2015"},{"name":"Chemistry","block":"8","semester":"Spring2015"},{"name":"Organic Chemistry","block":"4","semester":"Spring2015"},{"name":"Chemistry","block":"4","semester":"Fall2015"},{"name":"Chemistry","block":"5","semester":"Fall2015"},{"name":"Chemistry","block":"6","semester":"Fall2015"},{"name":"Chemistry","block":"3","semester":"Spring2016"},{"name":"Chemistry","block":"5","semester":"Spring2016"},{"name":"Chemistry","block":"6","semester":"Spring2016"},{"name":"Chemistry Honors","block":"6","semester":"Fall2016"},{"name":"Chemistry Honors","block":"7","semester":"Fall2016"},{"name":"Chemistry Honors","block":"8","semester":"Fall2016"},{"name":"Organic Chemistry","block":"4","semester":"Fall2016"},{"name":"Chemistry Honors","block":"6","semester":"Spring2017"},{"name":"Chemistry Honors","block":"7","semester":"Spring2017"},{"name":"Chemistry Honors","block":"8","semester":"Spring2017"},{"name":"Organic Chemistry","block":"4","semester":"Spring2017"},{"name":"Chemistry Honors","block":"2","semester":"Fall2017"},{"name":"Chemistry Honors","block":"3","semester":"Fall2017"},{"name":"Chemistry Honors","block":"6","semester":"Fall2017"},{"name":"Chemistry Honors","block":"7","semester":"Fall2017"},{"name":"Organic Chemistry","block":"4","semester":"Fall2017"},{"name":"Chemistry Honors","block":"2","semester":"Spring2018"},{"name":"Chemistry Honors","block":"3","semester":"Spring2018"},{"name":"Chemistry Honors","block":"6","semester":"Spring2018"},{"name":"Chemistry Honors","block":"7","semester":"Spring2018"},{"name":"Organic Chemistry","block":"4","semester":"Spring2018"},{"name":"Chemistry Honors","block":"2","semester":"Fall2018"},{"name":"Chemistry Honors","block":"3","semester":"Fall2018"},{"name":"Chemistry Honors","block":"4","semester":"Fall2018"},{"name":"Chemistry Honors","block":"6","semester":"Fall2018"},{"name":"Chemistry Honors","block":"2","semester":"Spring2019"},{"name":"Chemistry Honors","block":"3","semester":"Spring2019"},{"name":"Chemistry Honors","block":"4","semester":"Spring2019"},{"name":"Chemistry Honors","block":"6","semester":"Spring2019"},{"name":"AVID","block":"7","semester":"Spring2019"},{"name":"AVID 2","block":"4","semester":"Fall2019"},{"name":"Chemistry Honors","block":"2","semester":"Fall2019"},{"name":"Chemistry Honors","block":"7","semester":"Fall2019"},{"name":"Chemistry Honors","block":"8","semester":"Fall2019"},{"name":"Organic Chemistry","block":"5","semester":"Fall2019"},{"name":"Chemistry Honors","block":"2","semester":"Spring2020"},{"name":"AVID 2","block":"4","semester":"Spring2020"},{"name":"Organic Chemistry","block":"5","semester":"Spring2020"},{"name":"Chemistry Honors","block":"7","semester":"Spring2020"},{"name":"Chemistry Honors","block":"8","semester":"Spring2020"},{"name":"AVID 3","block":"4","semester":"Fall2020"},{"name":"Chemistry Honors","block":"2","semester":"Fall2020"},{"name":"Chemistry Honors","block":"6","semester":"Fall2020"},{"name":"Chemistry Honors","block":"7","semester":"Fall2020"},{"name":"Chemistry Honors","block":"8","semester":"Fall2020"},{"name":"AVID 3","block":"4","semester":"Spring2021"},{"name":"Chemistry Honors","block":"2","semester":"Spring2021"},{"name":"Chemistry Honors","block":"6","semester":"Spring2021"},{"name":"Chemistry Honors","block":"7","semester":"Spring2021"},{"name":"Chemistry Honors","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-06T09:44:54.233Z","text":"all the reviews are true. she doesn't lecture too well, and you will have to rely on youtube videos, but if you study a bit for her tests, and do your notebook work, you will get an A. she's very chill and you can do whatever you want in her class. as a person, she's super nice and amazing, but as a teacher she doesn't teach very well. she does answer your questions with more questions so beware, but you'll usually end up finding your answer on google anyways. i recommend her if you don't mind self-learning. you will meet a couple new friends in her class too.","rating":4,"version":0},{"timestamp":"2020-05-05T21:13:11.126Z","text":"Seconding all the other reviews about how: (1) Ms. Trimble does not lecture well, (2) not an active teacher, and (3) you will need to do a lot of learning on your own. \nHer grading system goes: 100%, 87%, etc. There is no in between. Make use of the retakes and her one-on-one tutorials, though they are not particularly useful. You will have to ask variations of the same question to get all the pieces of the actual answer. \nMake friends with your table group. You will only get the opportunity to change at the beginning of next semester, and she leaves the class alone to work through the material on their own most of the time. \nShe is very nice about writing letters of rec. Also nice in general. ","rating":4,"version":0},{"timestamp":"2020-05-02T15:23:16.586Z","text":"She plays favorites definitely, whenever I ask questions, it’s hard to get a clear answer out of her. Her class is very awkward, and her teaching style is difficult to follow. Do a lot of self learning by watching YouTube videos. Keep your notebook up to date and organized, or it will ruin your grade.","rating":2,"version":0},{"timestamp":"2020-05-02T15:21:41.207Z","text":"She makes simple concepts very complicated. Whenever she lectures, it’s difficult to follow. On tests, she’ll often throw in random stuff that was barely talked about in class. Luckily, she allows retakes, but even then, I found it was difficult to keep my grade above an A because she weights it down so it can’t go about 90% if you have a test grade of M","rating":2,"version":0},{"timestamp":"2019-12-17T08:23:50.993Z","text":"Spends a few minutes at the board \"teaching\" by turning a simple chem concept into a complicated metaphor, sits back down at her computer doing god knows what for the remaining 40 minutes of the block while the class teaches each other. If you have a question she'll answer you with another question or tell you to ask your table, unless she likes you (which is very rare) then she'll answer your question.","rating":2,"version":0},{"timestamp":"2019-05-28T01:43:15.800Z","text":"Really bad at lecturing and does little teaching. She allows you to retake any tests and is actually pretty helpful if you go in after school, but don't expect to be prepared for AP Chemistry.","rating":3,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She has not actually taught anything in her class. She is also extremely unhelpful you don’t learn anything in her class.Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Trimble is a pretty hard teacher. I am not very good at chemistry and i am highly struggling in that class rn. If you ask her a question in class she will make you feel like the dumbest person on earth and will make you not want to ask her a question ever again. But i learned that if you go to her after class with an appointment she will be much more understanding and helpful. Her tests are miserable i hate every part of it. Your grade is basically only the tests (quizzes not graded) & lab nbSubmitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Confusing, unhelpful. Your entire grade in her class is composed of her extremely difficult tests, which are typically around 200 to 300 points, and occasionally lab books.Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Trimble is a teacher you want to take if your taking Honors CHem instead of Martin. She knows how a teach, she just doesn't unless you push her to. She doesn't give alot of hw so that gives you time to teach yourself, unlike with doctor Martin - she is much better then him. No matter how much she sucks you can hate her just she is also such a nice person. If you has her for help she might get alittle annoyed, BUT STILL ask she can really help.Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I regret taking her class so much. Ms. Trimble DOES NOT KNOW HOW TO TEACH. I despise her teaching style. She doesn’t count homework in your grade. Everything is based on her CONFUSING, exams. I as well as my previous classmates knew the material very well but her tests are simply terrible and hard to interpret. I did not learn anything nor did I receive high remarks in this class. Leave before it’s too late, for you’re own sake. Joining her class is one of my biggest regrets for high school.Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Trimble does teach her students, you just have to be brave enough to go up to her and ask. She is very knowledgeable and her tests are not that hard. Her multiple choice might be a bit confusing, but its really what she teaches you but reworded. Even if you don't do your homework, you can always study before the test. Because, she doesn't lecture as much, just go on Youtube to do a bit of self-study and you can land yourself an EZ A.Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I kinda like Ms. Trimble. Yes, I'm failing her class but she's not awful.She teaches us by making us read of the textbook and occasionally she gives a little lecture as to clarify. I've been failing all the test. I guess you could say it's because I don't study, I think that if you study really hard then you would get a passing grade in the test (which means a passing overall grade).I tried getting some help for her, she explained it again obviously irritated, won't ask 4 help again.Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tests are garbage. Doesn't teach. Don't fall behind in homework and I think you'll be okay. Most learning is from group work, and sometimes she doesn't give you a straightforward answer when you ask her a question. Definitely would take trimble over marten for chem honors.Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Trimble is a teacher who does not care whether or not her students are learning. She rarely teaches (maybe once a month), and her tests are typically based upon information she has never mentioned or mentioned for one brief second. Be prepared to study for yourself. Her class is an easy B but you need to have prior knowledge in Chemistry to get an A in her class.Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Much less work than Marten. Most of your grade is on tests. She doesn't check homework so you don't have to do it if you don't feel like doing it. Homework quizzes don't count. Don't be afraid to ask questions, even if she gets annoyed by them, since she can explain.Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Trimble's alright... She's smart but her teaching style isn't fun if youre not a \"learn it yourself\" type of person. She hardly ever gets up in front of the class to lecture, but when she does, it's well done. Not super approachable and tends to answer your question with more questions, forcing you to do a lot of leg work. Her tests are hard, so know your stuff!Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i mean ms trimble is a really nice teacher like theres retakes every test which not much lowell teachers do the only complicated thing is she barely teaches but at the same time chemistry in general so hard you gotta be pretty smart if you want to have a good gradeSubmitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Trimble is an awful teacher, she has almost no lectures and you have to completely self study. But I prefer her over Martin.Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Trimble assigns HW every night and doesn't go over it. Tests are your only grades. She doesn't teach and has very hard testsSubmitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You don't learn in her class and you have to teach yourself everything because she doesn't teach at all. One of the worst teachers I've ever had. Do not recommend at all.Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her personality/attitude isn't bad but she's an awful teacher. We read from the textbook and do the book's easy problems. Has a horrible taste in music. Test time comes and there's a bunch of long word problems and hard multiple choice questions that don't make sense. Best part - your grade is your test grade!!!!!! She doesn't teach. She sits at her desk and watches eagles and grades tests. That's it.Submitted by a student","rating":2.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She answers your questions with more questions. She's more thought provoking so if you're into that, but she doesn't teach. Its more of a self taught class, for organic chemistry in particular, WHICH IS BAD bc chemistry needs a TEACHER.... GENERALLY SPEAKING, SHE ISNT TERRIBLE TERRIBLE. I mean if you can squint into the future and see the little faint light that is the chance for you to get an A, you can see it if you squint really really hard or use binoculars. Be prepared to self teach a LOTSubmitted by a student","rating":2.4,"version":1}],"rating":2.5130434782608684}},"__N_SSG":true}