{"pageProps":{"teacher":{"name":"Milton Axt","departments":["Physical Education"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018"],"classes":[{"name":"PE 2","block":"2","semester":"Fall2014"},{"name":"PE 2","block":"3","semester":"Fall2014"},{"name":"PE 2","block":"4","semester":"Fall2014"},{"name":"PE 2","block":"7","semester":"Fall2014"},{"name":"PE 2","block":"8","semester":"Fall2014"},{"name":"PE 2","block":"2","semester":"Spring2015"},{"name":"PE 2","block":"3","semester":"Spring2015"},{"name":"PE 2","block":"4","semester":"Spring2015"},{"name":"PE 2","block":"7","semester":"Spring2015"},{"name":"PE 2","block":"8","semester":"Spring2015"},{"name":"PE 2","block":"2","semester":"Fall2015"},{"name":"PE 2","block":"3","semester":"Fall2015"},{"name":"PE 2","block":"7","semester":"Fall2015"},{"name":"PE 2","block":"8","semester":"Fall2015"},{"name":"College and Career","block":"4","semester":"Fall2015"},{"name":"PE 2","block":"2","semester":"Spring2016"},{"name":"PE 2","block":"3","semester":"Spring2016"},{"name":"PE 2","block":"4","semester":"Spring2016"},{"name":"PE 2","block":"7","semester":"Spring2016"},{"name":"PE 2","block":"8","semester":"Spring2016"},{"name":"PE 2","block":"2","semester":"Fall2016"},{"name":"PE 2","block":"3","semester":"Fall2016"},{"name":"PE 2","block":"4","semester":"Fall2016"},{"name":"PE 2","block":"7","semester":"Fall2016"},{"name":"PE 2","block":"8","semester":"Fall2016"},{"name":"PE 2","block":"2","semester":"Spring2017"},{"name":"PE 2","block":"3","semester":"Spring2017"},{"name":"PE 2","block":"4","semester":"Spring2017"},{"name":"PE 2","block":"7","semester":"Spring2017"},{"name":"PE 2","block":"8","semester":"Spring2017"},{"name":"PE 2","block":"2","semester":"Fall2017"},{"name":"PE 2","block":"3","semester":"Fall2017"},{"name":"PE 2","block":"4","semester":"Fall2017"},{"name":"PE 2","block":"7","semester":"Fall2017"},{"name":"PE 2","block":"8","semester":"Fall2017"},{"name":"PE 2","block":"2","semester":"Spring2018"},{"name":"PE 2","block":"3","semester":"Spring2018"},{"name":"PE 2","block":"4","semester":"Spring2018"},{"name":"PE 2","block":"7","semester":"Spring2018"},{"name":"PE 2","block":"8","semester":"Spring2018"},{"name":"PE 1","block":"2","semester":"Fall2018"},{"name":"PE 1","block":"3","semester":"Fall2018"},{"name":"PE 2","block":"6","semester":"Fall2018"},{"name":"PE 2","block":"7","semester":"Fall2018"},{"name":"PE 2","block":"8","semester":"Fall2018"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"This inspirational man has changed my life. Never before have I been able to grasp the concept of holding a tennis racket until now. \"Swat the fly, and say goodbye\" is pure genius, and Mr. Axt will continue to inspire and lead a great example for all athletes.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him F04/S05/F05. I think we sat in a classroom listening to him talk more than we actually went outside and did PE-type stuff. No one really listens to him and he doesn't actually make you exercise. Take that as you will.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST TEACHER EVER!!! We barely ever did anything. If you complain that something is a safety hazard, he'll change it right away. It seems that he's afraid of being sued cuz he went over a 2-week \"orientation\" so he couldn't get sued for failiure to warn. He tries to help you \"refine your technique\" and he thinks he's actually helping.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easiest P.E. teacher. Just \"participate\" and it's all good cruisin with an A. If you're cool to him, he'll be cool to you.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a nice guy, has strange things to say, can be lenient on uniform but has days when he'll serach for those not dressed. Easy A.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a great P.E. teacher if you hate working out. Really boring but an easy A. No test or portfolio, you just have to participate .","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"most kindest pe teacher ever. really understandable. you do nothing in his class. He has really inspirtational ideas to say if you pay attention to his class. you never run or anything you kinda have fun only if you have friends in that class.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HES THE BEST","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is one of my favorite teachers. As long as you don't cut, you're guaranteed an A, even if you don't particilate. He tells a lot of stories that are totally random. Really nice class if you just want to hang out with your friends","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"this guy is just hella funny. take his class just to laugh at him, he doesnt care.talk to him aabout funny bones and kneecaps and he uses up like an entire mod thats FUNNY. just go to his class, listen (its entertaining anyways) and dress and you have an A","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's great! He's very understandable, and if you just look beyond his age, he's a great person. His stories are pretty boring, but it's not as bad as people make it. I like his class! It also depends on the people in your class.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is sooo easy!! we do NOTHING hard in his class. the easiest a ever.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the greatest high school football coaches in California history. How many of you knew that?","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Quote: \"Something's not clicking here.\" He talks a lot. When he says said quote, he talks... a lot. You can cut or be totally late and you can be like \"Sorry, Mr. Axt, the 29 bus was late.\" And he'll be like complaining...about the bus and he'll get way distracted, while you get way off the hook. I'd die of boredom in his class if I wasn't a human mp3 player. Memorized so many songs... I'd suggest you do the same...","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Axt is a really knowledgeable teacher - you can find him reading books on personal growth and development. He's a teacher that wants to motivate and inspire his students to do great things.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pretty cool, really easy. Goes for n excuse u give him","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Axt is soo easy! But one bad thing is he talk too much! too much lecturing. And he's always late. But i guess thats a good thing. u never have to worry about being late.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Wonderful man!! I loved being in his class! He's a very kind and understanding person. He clearly cares about the well-being of his students and he lets u leave if u have to study!","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Just take him. End of story.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Oh Mr. Axt. He makes me so sad, like why are you still teaching? He should be resting! He cares so much about his students even though most of them don't feel the same. Great guy.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"first day of his class i was 1 mod late but he was later than me 8) real nice guy, easy A, easy to cut :X","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"axt is koOL...geeze sort of borin tho, but he is nice.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hahahahahha oh mr axt! he's been here forever!!","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SO BORING. he caught my friends leaving class without permission and took it really seriously so i advise you not to leave class early, especially if a lot of other people do cause he can tell when there are like 7 people missing. anyways he's SUPER SUPER SUPER boring and weird. mhmm peace out g.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Axt is the most boring PE teacher ever. Most days you have to listen to him talk about sports for half the class. But he doesn't make you run. And, it's an easy A if you show up and dress. So if you want to do nothing during PE, Mr. Axt is the absolute best choice.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lol, he's nice but he's really boring. His rage kinda makes me laugh tho. Anyways, easy A= win. So...but if you really wanna exercise, get someone else.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I feel bad for mr axt. the guys like 80 and nobody gives him any respect. gradewise- everybody gets an a. theres nothing physicall about his PE class, u learn to walk, walk some more, and sometimes u get to play ball.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A = fine by me. People hatin him cuz he's boring. That's all.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's very grumpy but you are basically guaranteed an A. He reads off notecards for a lot of the class, which is extremely boring, but I would take him if you don't like physical exercise.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He tells awesome stories.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Axt was my PE teacher. He is very nice and grades by particpation. teach students about warming up. He is the best PE teacher in Lowell!","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's easy, but talks a lotttt and warm up is just walking so theres no excercise going on","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the man, the legend, the axt.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Axt is AWESOME.. really easy A as long as you dress and participate.. and i mean.. who doesn't want to take advantage of an easy A at LOWELL?? haha his stories are long.. but his class is FUN FUN FUN.. just don't make him mad, and you'll defin","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hahahah very good teacher i mean it he doesnt make you do anything i took him as my pe teacher freshman fall and spring and sophmore fall and spring very very good man very good damn hes good.... just dress and you get an A he got a little harder on the dressing thing especially if hes in a bad mood...also very funny here it is: when we were in room 23 he suddenly rubbed his side and said ,\"boy, those graham crackers and milk..\" hahauahuahuhauhauhauuaaahuauhuahahuuahauhauhah","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A very relaxed old man. Loves sports. He sometimes shows us random pictures of athletes with \"good\" stances. He sometimes talks about random things and we would have a few minutes to play. Very easy A even if you just stand there.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hahah best PE teacher ever!!! wouldn't have survived PE without him!!! hahah","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"First of all, Axt is so the coolest PE teacher. Here's a tip: if you take his class, always have a small notebook handy to write down some of the things he says. I guarantee that later when you're sitting in chemistry or another boring class, and you read those quotes, you'll wet yourself laughing so hard. Believe me, I've been there. Enjoy.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Axt gives inspirational speeches even though no one listens. He honestly makes me so depressed. Sometimes he cares about us students, sometimes he doesn't. He still tries to teach us, even though he knows that we'd all rather be somewhere else (and comments on it often). If I live to be that old and decide to be a high school PE teacher, please kill me. Easy A, but so depressing.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A. There's really nothing much to do in his class. Appreciate and be patient with him; listen to his lectures.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. axt is pretty cool cause you could get an easy A in his class without doing ANYTHING! though he does tends to talk about random stuff that deals with \"sports\", and does get cranky if someone interrupts, and does like to show his \"shooting basketball hoop\" skills. he's still awesome! and you could totally get an A!!!!!!!! everyone gets it. (: take him if you want a really easy A, and want a little \"story time\"!","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MR.AXT. Honestly he is boring, but hey, its better than running a mile every week and do exercises everyday if you're lazy like me. He talks almost every other day, but he is old so he might not hear you talking in the back. If you are a rowdy one he may remember your name but i doubt he knows anyones name in his classes. Don't need the change often cause he doesn't really care.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Worst class ever. BORING.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i accidentally cheated on a test, he saw it, he didn't care. very cool teacher!","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Surprisingly he remembers a lot about down to the exact time even though he's old. It's hard not to feel bad for him once you actually listen to his many stories though. Yes he's old and has been through a WHOLE LOT of stuff.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is sooo cooooooooooool","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy but will expect you to actually do your excersises if your an athlelete.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"EASY...we just had to show him the front page of the portfolio; doesnt go through it. just change and never EVER sit down. otherwise, very easy...and fun","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"axt is easy, yes, but its pititful how people always take advantage of him... if you're one of those who hate exercise, take him, he doesnt care. and please just be friendly to him, remember that he has taught for MANY years.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"we were supposed to play frisbee n we played football the whole semester ahaha","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr.axt is cool. his class is an easy A.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took him for two semester... ALL WE DID FOR THE WHOLE YEAR IS TENNIS! He cares more about our \"grips on the racket\" than anything else. Easy A though.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SUPER BORING, too easy and we don't do squat! The only time we ever had an actual workout was when we play real sports for a long time or do fitness testing.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He taught us how to walk in his class. He's a good teacher if you don't like to exercise. Just pretend you're actually exercising. He probably won't know your name anyway. Really boring. He always gives 10 minute lectures at the beginning of class.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BORING!","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Coolest teacher in the school. Still in his prime. I wish he would teach other subjects, or that 4 years of PE were mandatory.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"if u just wanna chill take his class! but when he talks he cant stop and his class can get really boring","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best PE teachers I've ever had. Easy grading, just show up in your PE clothes. Sometimes boring but if you have friends in the class, he usually wont notice if you talk to them. He doesn't grade on your athletic ability, which is amazing. He lets you control what you want to do, which acts as an incentive in itself for you to actually do the activity and have fun.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes always talking about random things and hes so lazy it seems like and he thinks he knows everything but can be cool sometimes","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"arrive, stand on ur number, stuff n autobio n a couple of newspaper clips in ur porfolio, n u got an A for the semester. dont actually LEARN sport n he's BORING","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"GAS GRADE ATITUDE SAFETY. get ready to hear that every day. he follows the rules, doesnt let people out early. easy A if you just dress and show up. never does any real pe, more like a history class. but also never gives assignments. i you dont want to do anything take him.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is sooo easy ... to take advantage of! lol .. jk. he really is boring - he kept us in classrooms talking about profiles for a week and didnt let us go outside! we have fun during PE though even though he doesnt really tell us what to do...","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"you should take him if you never want to do anything but laze around and listen to comedy for 2 mods or if you just want to take a break. he'll let you off for any excuse, and he is hilarious...ahahahaha. oh man. take him. definitely.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"When you're deciding whether to take him, it really depends if you don't want to do any work or if you actually want a fun and interesting P.E. class. His class is an easy A and no work. However, he gives the most boring lectures ever about football coaches and the right attitude and doing it the \"Georgia way\" and stuff.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"LECTURES ARE HORRIBLE. But they're handy sometimes.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i don't think he's lazy. i think he's trying to teach us stuff. even though he may be boring at times... other PE teacher won't even talk to their students.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hes boring, but very easy. Gives you a life story/takes roll/ and your free to do what ever the rest of the class. He will lecture u often!","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hella easy a","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Everybody says he's way too old to still be teaching, which is totally true. He has a lot of stories to tell about football, which can get really boring. Easy A. Just show up.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Axt is the BOMB! He's so funny and weird, but really easy and easy to talk to. Fun to be around, fun to be in his class.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Classes taken: PE 1, PE 3. I'm an athletic person who loves to play sports, so based on other ratings you might think I would hate his class. Well here's why I don't: Mr. Axt will not force you to do anything, but you can be active if you want to. Also, his stories are EPIC and hilarious.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"if u want to do absolutely nothing take him but his classes are extremely boring","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MR. AXT IS THE COOLEST TEACHER EVER TO STEP INSIDE OF LOWELL HIGH SCHOOL.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Being in Mr. Axt's class is a defining part of every Lowell student's career. Yes, he is boring, ancient, and crotchety, but his class provides a perfect easy option for us nonathletic kids. Every day he lectures about motivational sports stuff and then lets you spend the rest of the time doing something like tossing a ball back and forth. As long as you follow his basic rules (like not bringing your phone to class and not skipping) you can get an A in PE by doing practically nothing.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easiest class of my life. Don't cut (but it's easy to slip out of class once he takes attendance) and dress. You can just talk the whole time. The only anoying thing is he talks forever about football","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A in class! Boosts your grade to go to university!","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Axt has his lifetime stories now and then, but he is really nice. Automatic A even if you don't do anything.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"axt is awesome for PE haters like myself. we barely do anything and he makes the fitness tests super easy. you almost never have to run and it's nearly impossible to get below an A in his class. just show up, and you'll do fine. the best thing is, he doesn't do portfolios.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A, but you aren't active much.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is arguably the easiest teacher I have ever had at Lowell. He also tells the most epic stories, many of which have absolutely nothing to do with physical education. But that's only if you strain yourself REALLY hard to pay attention to his soporific voice.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MR. AXT IS A FREAKIN' G. His class if incredibly easy, and he doesn't mark you if you dress or not. He does teach though, it's just nobody really pays attention, and his stories are HILARIOUS. I LOVE MR. AXT.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's the EASIEST A ever. You have to go to class but it's SOO easy to ditch. Just dress...go to roll...then leave. he lectures a lot sometimes though. whatever.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really easy A. just dress n NEVER sit down. hardly even lookt @ the portfolios. lectures sometimes n its lyk AARRGH cuz he got a BORING monotone man, nice","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy easy easy","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"omg i seriously do nothing in his class. STRAIGHT A's. i stand around and act like im doing stuff.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i swear his lectures are supremely boring and have absolutely nothing to do with what your playing. Spent 35 min of class explaining the wrong way how to play basketball while we all shivered in the cold. Take donohue - you will have a much better time.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"axt is pretty much ok and really easy tho. i myself wouldnt take him cuz he neva really makez u work or makez u betta... he still iz a nice guy but dont get him mad","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MR. AXT IS MY HERO!!","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Probably the EASIEST teacher you can get in your LIFETIME, because we dont do anything, if you have him, get used to room 23, cause you'll practically be there at least once a week or so...If you talk to your friends, he'll shush you, but then again..he sometimes shushes even when no one is talking (because everyone's asleep) Easiest A ever, and the one thing you can always enjoy in his class is that you can WALK your mile, and make up any random time, just as long as u make it reasonable.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Super nice. Super chill. Just show up and dress every so often. Oh and if you make a one handed football catch, he will love you for forever.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"totally entertaining and easy. sooooooooooooo cool","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The easiest and most amusing teacher at lowell. He is late everyday so you can be. You don't have to excercise if you dont want to.Occasionly he'll let you out to study if you need","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"listen to him when he talks, i think he's hilarious, lets u study during class","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THIS GUY IS HELLA BORING. He always talks about stuff he'd seen in his time, and he always yammer on about stuff people barely know. He never gives tests, and that's good, but be ready for a bore. He's funny (unintentionally) sometimes, though. One time, I even heard him say \"Off the chain\". I don't think he cares much if u skip his class. Take him if you're bored with life and have nothing to do.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My schedules at Lowell have been based around this man. He's such an understanding man with an interesting story to tell. If you aren't the most physically active person, he's the right teacher for you. I also adore him for reg. Ask him how to dodge a bullet, talk to him about the 29 bus, and just enjoy his company.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"TAKES ATTENDANCE. never did before but now he does. other than that, easy A. Doesn't help you stay in shape at all.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's an sure A if you dress, play, and come to class everyday. But, he has really long lectures and you barely exercise.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really moody, obssessed with safety, & gets mad at random things. dont piss him off or be late (even though he usually is). what are u ppl talking about? we DO do stuff! its only up to the students to actually listen and do stuff. 1st semester i was stuck with a class of kids who weren't willing to do anything. 2nd semester i was with ppl who actually wanted to play and i ended up having a lot more fun. mr.axt means well, he just wants u to have good form so u dont end up injuring urself xD.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"boring lecture but really easy A","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He cracks me up. This one time he started talking about 'energy vampires' it was really funny. he talks about the most randome stuff. It's an easy A.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"OMG. boring lectures. i cut his class when i dont feel like listenning to him but he likes me so i dont care. his lectures which are daily has nothing to do with p.e but are sometimes interesting if u strain to listen. really easy too.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is the easiest teacher ive ever had. though his lectures are boring.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easiest A you'll ever have just show up and dress. Super-boring on certain days of the year when he starts reading through quotes.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"haha, his pe class is a joke. could just stand around and he gives you an A for it. don't even have to wear the uniform.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a really effusive person, even if others dont really enjoy his lessons and stories. But i think that he is really a nice man when he needed to be.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Totally easy A! Easy final too. You don't even have to work that hard for his class or like participate that much because he's always talking about technique and stuff, you better be careful when he is really mad. It is not pretty...","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"As a football coach at Poly Hi he was excellent. Soft spoken, not easily provoked, knew how to coach. Sounds like some of these students are spoiled. Not very good students in other subjects. The ones that excel keep their derogatory comments about others to themselves. Tally Ho, Lowell ..Chas","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lazy? Take him.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"decrepit old man. be nice to him. just take his class as the easy A everybody wants. kinda mean sometimes, but that doesn't matter. you should be able to get through his class without being there mentally, though you should show up physically.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"don't take advantage of him. he likes to hear his own voice. He's strict on attendance, but if you have to go study, he might understand (once or twice)","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hella old, i pity himSubmitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SOOOOOOOOOOOOOOO BORING! but a REALLy easy Atake him if you're lazy. often mumbles about pretty much nothing and may yell if people dont wear tennis shoes (if he's in a bad mood) but again, REALLY easy A","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ok, get this straight, if you're one of those competitive types who love to run laps during class then don't take him. Mr. Axt is for those people who just want to have fun in PE. He won't force you to do anything, and he's really into safety. When I took him a lot of the time was spent playing sports. But his lectures are boring. But he does give them because he wants us to be aware, so you can't really be too critical of that. He's only trying to help.","rating":3.7,"version":1}],"rating":3.6999999999999926}},"__N_SSG":true}