{"pageProps":{"teacher":{"name":"Naomi Okada","departments":["Foreign Language"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Japanese 2","block":"2","semester":"Fall2014"},{"name":"Japanese 2","block":"8","semester":"Fall2014"},{"name":"AP Japanese Language and Culture","block":"5","semester":"Fall2014"},{"name":"Japanese 2","block":"2","semester":"Spring2015"},{"name":"Japanese 2","block":"8","semester":"Spring2015"},{"name":"AP Japanese Language and Culture","block":"5","semester":"Spring2015"},{"name":"Japanese 1","block":"6","semester":"Fall2015"},{"name":"Japanese 1","block":"8","semester":"Fall2015"},{"name":"Japanese 2","block":"2","semester":"Fall2015"},{"name":"Japanese 2","block":"4","semester":"Fall2015"},{"name":"Japanese 1","block":"6","semester":"Spring2016"},{"name":"Japanese 1","block":"8","semester":"Spring2016"},{"name":"Japanese 2","block":"2","semester":"Spring2016"},{"name":"Japanese 2","block":"4","semester":"Spring2016"},{"name":"Japanese 1","block":"7","semester":"Fall2016"},{"name":"Japanese 1","block":"8","semester":"Fall2016"},{"name":"Japanese 2","block":"2","semester":"Fall2016"},{"name":"Japanese 2","block":"3","semester":"Fall2016"},{"name":"Japanese 2","block":"2","semester":"Spring2017"},{"name":"Japanese 2","block":"3","semester":"Spring2017"},{"name":"Japanese 3 Honors","block":"6","semester":"Spring2017"},{"name":"AP Japanese Language and Culture","block":"5","semester":"Spring2017"},{"name":"Japanese 2","block":"2","semester":"Fall2017"},{"name":"Japanese 2","block":"3","semester":"Fall2017"},{"name":"Japanese 3 Honors","block":"8","semester":"Fall2017"},{"name":"AP Japanese Language and Culture","block":"5","semester":"Fall2017"},{"name":"Japanese 2","block":"2","semester":"Spring2018"},{"name":"Japanese 2","block":"3","semester":"Spring2018"},{"name":"Japanese 3 Honors","block":"8","semester":"Spring2018"},{"name":"AP Japanese Language and Culture","block":"5","semester":"Spring2018"},{"name":"Japanese 2","block":"2","semester":"Fall2018"},{"name":"Japanese 2","block":"3","semester":"Fall2018"},{"name":"Japanese 3 Honors","block":"8","semester":"Fall2018"},{"name":"AP Japanese Language and Culture","block":"5","semester":"Fall2018"},{"name":"Japanese 2","block":"2","semester":"Spring2019"},{"name":"Japanese 2","block":"3","semester":"Spring2019"},{"name":"Japanese 3 Honors","block":"8","semester":"Spring2019"},{"name":"AP Japanese Language and Culture","block":"5","semester":"Spring2019"},{"name":"AP Japanese Language and Culture","block":"5","semester":"Fall2019"},{"name":"Japanese 2","block":"2","semester":"Fall2019"},{"name":"Japanese 2","block":"3","semester":"Fall2019"},{"name":"Japanese 3 Honors","block":"8","semester":"Fall2019"},{"name":"Japanese 2","block":"2","semester":"Spring2020"},{"name":"Japanese 2","block":"3","semester":"Spring2020"},{"name":"AP Japanese Language and Culture","block":"5","semester":"Spring2020"},{"name":"Japanese 3 Honors","block":"8","semester":"Spring2020"},{"name":"AP Japanese Language and Culture","block":"5","semester":"Fall2020"},{"name":"Japanese 2","block":"2","semester":"Fall2020"},{"name":"Japanese 2","block":"3","semester":"Fall2020"},{"name":"Japanese 3 Honors","block":"8","semester":"Fall2020"},{"name":"AP Japanese Language and Culture","block":"5","semester":"Spring2021"},{"name":"Japanese 2","block":"2","semester":"Spring2021"},{"name":"Japanese 2","block":"3","semester":"Spring2021"},{"name":"Japanese 3 Honors","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took her for drivers ed and college and career. Although we had like big projects and fair amount of homework. Her class was like the easiest class ever. It was fun, not stressful and you get rewarded for your efforts. If you put in alot of effort for your projects and such, it will pay off","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"said to be easier than takemoto,but for me its not the case. she goes slower and gives a lot less homework,but i mess up all her oral tests because they are on such short notice.Her binder checks are a lot easier than takemoto's though. too bad the oral test counts for 25% of your grade and the written ones together is only 20%=(if you suck at orals,i sugguest you don't take her. she also counts participation way to heavily(20%)participating is hard cuz the whole class raises their hands so fast","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"okada sensei is nice and is willing to help when asked. her ap class isn't as stressful, but i feel that okada sen'sei taught everything she could in order to help us prepare. she even had lots of time leftover for projects (were fun imo)","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pretty mutch what you look for in a perfectly unbiased teacher, her standards are well and ridgly defined, although sometimes annoying it adds a wonderfull layer of objectivity to the learning process that is hard to find in language teachers. Works hard and is there to help her struggling students, take her.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Amazing teacher! Okada-sensei is extremely nice and she always grades fair. Her directions are very clear and you'll always know what to expect in her class. She is very organized and it makes me sad that I can no longer be in her class :( !","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes one of those pplz that are hard to get to know. she has an intersting way of teaching, lots of in class partner readings. the homework is pretty easy, except i'm worried about next year with takemoto.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice but hate the oral tests. marks off points for speaking too low.. happened to me couple of times","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"What can i say about okadasensei....well, she is definitely very kind and willing to help her students, but i admit, her tests are always moments where everyone in the class panics and studies to teh best of their ability and even then, the tests usually have some sort of material that hasn't ever been covered (particularly oral exams), though the material she does teach stays within your head...well, she does make japanese a little fun to learn wit the games and such","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Okada is one of the nicest teachers. She's understanding and will help you if you need it. She does activities every once in a while, & they're pretty fun. If you want to take things slow, take Okada over Takemoto.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"her directions are clear and easy to understand because they are in English. oral tests are awesome because they are so easy. participation is a pain. you will never see people nudging other people to make sure they understood the directions","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took Japanese 2. Strict but nice. Be super meticulous to avoid point deductions on homework. A lot less skits than Japanese 1 (Yoshimura) in class. Skits were more prepared and are considered to be projects. Grading- 25% each for participation, homework, tests/quizzes, and projects.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she doesn't know a lot of ppl's names...i was in her class last sedmester and in the beginning of this one she didn't know my name =/ and she keeps calling elaine wendy. um shes ok but she makes us turn in hw in her hw basket BEFORE class. i mean, thats not her time D= and she stares at the clock b4 class starts and closes the door right when its time for class. sometimes i'm late just walking half a hallway because of all the traffic =/ oh and if you're late like 3x in one semester,u get a \"U\"","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I may not have her for Japanese but then for driver's and college and carreer. Even though I'm saying its an easy A, you have to put a fair amount of effort for projects but as long as you do ur best and don't slack off. You're good to go! She is super super super super nice. I got like D's on her tests for c/c and aced the final so then I got an A-, participation..i barely raised my hand and still...that A-. In driver's, we do fun acitivites to help us study for tests coming up.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's different than Takemoto. If you are looking for a teacher that takes things relatively slow and does not teach straight from the book, Okada is the one to take. She often plays little games in class (which can be embarrassing) but fun. Her homework is bearable and she makes it clear what she does/does not want. If you study in her class, you will do fine. A's are hard in Japanese, regardless if it's Takemoto or Okada, so don't expect the class to be cake.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SUPPER COOL TEACHER!!! she is soo nice and is understanding. she doesnt get mad if u dont understand. she does give lots of homework and tests but at least she is not strict.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Okada Sensei is nice. Yes. But, I if you really want to learn, take Takemoto Sensei. Takemoto is tough. She is relentless and a perfectionist. You will not \"get by\" in her class. You will put in your best effort everyday and leave knowing more Jpanese than any other program can teach without full immersion. I went to Jpan and was incredibly grateful to have had Takemoto as my teacher.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she isnt that bad of a teacher, nor is she that good. i think she gives too little time on preparing for the oral exam even though you should already know all the sentence patterns and vocab. i also \"failed\" (low Cs) most of the translation tests since the \"sentences\" are more like \"paragraphs\". occassional games are fun and final was pretty easy. i should've chose takemoto over her even though takemoto didnt really \"fit\" into my schedule.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"okada is a cool teacher. she's nice & understanding.she do give a lot of test & quizzes, but if you study for them, you'll be fine","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i took her for drivers ed/college career and she was SOO easy and nice. partcipation counts as 30% of your grade, but you only have to raise your hand like, twice, to get an A in her class...that is, if you do all your homework and projects she assigns. its not that much work, actually","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's ok, I guess. Homework is fairly easy. Oral tests would be a lot easier for us if the third part was written like a script. Instead, it's all in paragraph form. Get ready to learn kanji FAST. You watch her write the first kanji, copy it down, and she's already more than halfway through the second one. Kinda hard to read her writing sometimes. You're stuck with her if you plan to take 4th year Japanese. She's really nice, though.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes makes class interesting because we learn about more than just the language and some more practical stuff and its a fun class because shes pretty understanding..","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she likes improvement. she's really nice...however, her classes work slower than takemoto, so it's up to you whether you wanna take her.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she like does binder checks and what not...not the best..i hate her test things...but she is nice...","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Too little homework, that's bad. Tests are pretty easy, that's good. Oral exams are annoying as heck and worth 25% of your grade. Skits might be added on to oral exams, and that's a pain. You spend a week of valuable time working on a stupid skit about one thing, and no one actually gets it in the end. Waste of time. Too much partner work and too little instruction going on. Goes way too slow...I can teach myself faster too. In-class games are pretty cool once in a while. She's nice, but yeh...","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"so far okada sensei seems very helpful. She is very young and organized.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"wow, she's kinda different compare to takemoto, she's easier and not as strict, she's very nice and dosent give pressure.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is completely useless overall, and its really boring. You learn almost absolutely nothing from her, and if you already know japanese, you realize that she shouldn't really be a teacher. Lowell should've gotten a better teacher than her.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's nice, helps when you need to ask something. doesn't teach as much as takemoto, goes over stuff a lot, she reviews the previous lessons before moving on. she tries to make it fun, hw are mostly one page assignments that could be finished in less than 30 minutes, pretty obvious. clarifies a lot.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fun class overall. Native speaker of both English and Japanese. Very consistent. Strict but her rigidity makes her assignments predictable. Very clear about what u should expect AND what she expects from u. HW is 1 wksheet daily w/ the occasional report or group project. Double check answers on HW and tests to avoid minor details (incorrect heading, overly-messy handwriting, missing kanji/furigana, etc) being marked down. ALWAYS take notes on lectures, study the textbook, and you're good. 頑張って!!Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Eh. A lot of people thought they weren't doing well but the end of the semester came and whoaaa we all got a tiny overall bump. I guess that's reasonable... otherwise only one person would've had an A. She's kinda hard but bearable. I don't really look forward to class. It's just 'eh' all the way.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her class is boring and I'm not learning much from her class. She is also very rigid about everything. She deducts a point if we write a wrong date.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I enjoyed having Okada-sensei as my Japanese teacher. She was nice, taught us pronunciation carefully and Japanese culture. For me, I had no hard time with studying because I'm a fast learner but I recommend you study for her class and ORAL tests. She's very patient and always remember to greet her in Japanese when you see her outside of class.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ok...first day, and all i can say is ez!! haha...i won't have to worry about takemoto until JPN 4!! she uses english so much that you'll ferget that its a japanese course...seriously. but anyhow, she seems like a really cool teacher. totally EZ","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She doesn't really teach, but it's not hard to get a decent grade in her class. Basically, she treats everyone like middle school students, with lots of rather pointless-but-fun activities and very little substancial work.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"most patient and hard working person ive met. you will learn to love Japanese.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i took her for college and career and i actually learned a lot. the homework is kinda easy, and theres big projects. but its a little bit boring.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she was a good teacher,butwhat was up with those quizzes? Everyone wus so confused. Her class is kinda embarassing too.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very strict, but her class is interesting and she makes sure to lay out all standards before a test.Submitted by a student","rating":4,"version":1}],"rating":4}},"__N_SSG":true}