{"pageProps":{"teacher":{"name":"Ning Zhang","departments":["Foreign Language"],"semesters":["Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Chinese 1","block":"4","semester":"Spring2018"},{"name":"Chinese 1","block":"6","semester":"Spring2018"},{"name":"Chinese 3","block":"3","semester":"Spring2018"},{"name":"Chinese 3","block":"7","semester":"Spring2018"},{"name":"Chinese 3 Honors","block":"1","semester":"Spring2018"},{"name":"Chinese 1","block":"2","semester":"Fall2018"},{"name":"Chinese 1","block":"6","semester":"Fall2018"},{"name":"Chinese 3","block":"1","semester":"Fall2018"},{"name":"Chinese 3","block":"7","semester":"Fall2018"},{"name":"Chinese 3","block":"5","semester":"Fall2018"},{"name":"Chinese 1","block":"2","semester":"Spring2019"},{"name":"Chinese 1","block":"6","semester":"Spring2019"},{"name":"Chinese 3","block":"1","semester":"Spring2019"},{"name":"Chinese 3","block":"7","semester":"Spring2019"},{"name":"Chinese 3 Honors","block":"5","semester":"Spring2019"},{"name":"AP Chinese Language and Culture","block":"1","semester":"Fall2019"},{"name":"AP Chinese Language and Culture","block":"2","semester":"Fall2019"},{"name":"AP Chinese Language and Culture","block":"7","semester":"Fall2019"},{"name":"Chinese Native 3","block":"5","semester":"Fall2019"},{"name":"AP Chinese Language and Culture","block":"1","semester":"Spring2020"},{"name":"AP Chinese Language and Culture","block":"2","semester":"Spring2020"},{"name":"Chinese 3 Honors","block":"6","semester":"Spring2020"},{"name":"AP Chinese Language and Culture","block":"7","semester":"Spring2020"},{"name":"AP Chinese Language and Culture","block":"1","semester":"Fall2020"},{"name":"AP Chinese Language and Culture","block":"3","semester":"Fall2020"},{"name":"Chinese 3 Honors","block":"7","semester":"Fall2020"},{"name":"Chinese Native 3","block":"5","semester":"Fall2020"},{"name":"AP Chinese Language and Culture","block":"1","semester":"Spring2021"},{"name":"AP Chinese Language and Culture","block":"3","semester":"Spring2021"},{"name":"Chinese 3 Honors","block":"7","semester":"Spring2021"},{"name":"Chinese Native 3","block":"5","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-20T23:12:18.815Z","text":"She's super nice but her class can be kinda hard. Plus I feel like she barely teaches speaking. She does show a lot of movies though.","rating":3,"version":0},{"timestamp":"2020-05-17T15:57:07.970Z","text":"I have her for AP. She assigns completely random assignments that aren't very useful. Doesn't really teach you to get better at reading, you have to do that on your own. Overall I'm really unprepared for the AP test.","rating":2,"version":0},{"timestamp":"2020-05-08T01:42:16.891Z","text":"I took her for AP chinese this year and shes the best teacher ever. She does nice presentations and her movie studies are cool. I would reccomend if you want a fun and easy class but if you're not good at chinese do not take her","rating":5,"version":0},{"timestamp":"2020-05-06T06:59:43.211Z","text":"ms zhang is a nice teacher. she uses english a lot to explain the work so you can understand. weekly homework so you can do it over the weekend. biweekly quizzes that are not hard since its just vocab. lots of ec provided for her class. super easy A if you're fluent at Chinese. I wouldn't say she is a good AP chinese teacher since its her first few years teaching. Otherwise, take her for Chinese 3 or 3h","rating":4,"version":0},{"timestamp":"2020-05-05T16:23:48.320Z","text":"She's super nice, but her work is extremely confusing, fast paced and doesn't teach you much. I took her for Chinese 3, and I expected it to be pretty hard in terms of learning, and the class was easy, but the homework isn't graded on completion, which is really annoying because she doesn't teach you everything on the homework. I'd say maybe take her for chinese 3 but definitely not AP.","rating":3,"version":0},{"timestamp":"2020-05-05T08:33:47.867Z","text":"had her for chinese 3 and i really liked her class. she was pretty chill in my opinion. she assigned weekly homework which was easy. she’s very caring if you’re a good student i guess. definitely would recommend her. ","rating":5,"version":0},{"timestamp":"2020-05-05T05:03:06.223Z","text":"She is terrible at teach ap. Don't take her in general. \n","rating":1,"version":0},{"timestamp":"2020-05-04T23:39:41.790Z","text":"I love ms.Zhang, literally the nicest and funniest teacher ever. Plus she like Kun.","rating":5,"version":0},{"timestamp":"2020-05-04T19:41:51.347Z","text":"Took her for Chinese 3 freshman year. She has an easy-to-follow curriculum, involving a weekly homework packet, weekly movie/listening exercise, and daily \"useful phrases\" (new vocabulary students present in relation to the unit). Requires the use of a notebook a lot. Unit tests on writing a short excerpt from drawings, memorization of vocabulary, or multiple choice questions. Speaks in English a little more than Chinese.","rating":3,"version":0},{"timestamp":"2020-05-01T23:32:22.762Z","text":"I like her as a person. But I don't think she knows what she's doing as an AP teacher. Lesson structure is hard to follow, I can't tell what's important information or not, and overall the class is a little chaotic. She also assigns a lot of busy work and makes us watch movies on our own time that as a whole don't contribute very much to our cultural understanding of China. It's nice that she offers a lot of extra credit to cushion your grade (it's not hard to get an A even w/o the EC) but I was personally more concerned with what I was learning. You don't learn a lot of Chinese language in this class, and the culture points that you learn are quickly forgotten without reinforcement. But if you're good at Chinese and well-versed in the culture then you're chilling.","rating":3,"version":0},{"timestamp":"2020-04-02T20:27:35.549Z","text":"Trash teacher. Gives hella hw over coronavacation and has a bad attitude. Do not take her for AP Chinese. She gives work that doesnt even help on the ap exam. ","rating":1,"version":0},{"timestamp":"2019-12-08T05:58:19.983Z","text":"Her class is OK. It is her first year teaching AP but it's still pretty unorganized. Has a snarky attitude that can be funny but also unprofessional.","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very professional and teaches well. Very hilarious and her English pronounciation is funny. Her exams aren't too hard but aren't easy. Gives extra credit a lot so there is no excuse to get a bad grade. Fairly easy A if you know your stuff. One of the best Chinese teachers at Lowell.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Zhang was born in China, so she is very knowledgeable and fluent in Chinese. She does teach in English though, because most of us suck. But if you know Chinese she will talk to you in it. She mostly teaches vocabs out of the textbook, and her tests are easy. She gives out so much extra credit most people get over 100. If you want an easy A then take her.Submitted by a student","rating":4.3,"version":1}],"rating":3.3999999999999995}},"__N_SSG":true}