{"pageProps":{"teacher":{"name":"Normita Balangue","departments":["Science"],"semesters":["Spring2016"],"classes":[{"name":"Physics","block":"1","semester":"Spring2016"},{"name":"Physics","block":"3","semester":"Spring2016"},{"name":"Physics","block":"4","semester":"Spring2016"},{"name":"Physics","block":"6","semester":"Spring2016"},{"name":"Physics","block":"7","semester":"Spring2016"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"The way Ms. Balangue teaches makes physics seem harder than it really is. She is not very clear with explaining, so you have to spend time on your own to understand things better. But she is very friendly and will let you retake tests and help you after class.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Balangue really knows a lot about Physics. However, she isn't really a great teacher. She just doesn't communicate with students well and it's because of that most of the concepts that the class can't understand. Otherwise, this is a class where you can get an EASY B.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. B is so nice and funny! With other physics teachers I got B's, but with Ms. B I have an A. Her labs are a bit confusing but if you ask for help it makes sense. The multiple choice part of her test is always a bit difficult, but the problem solving is easy if you pay attention to in class examples. She picks homework problems help you understand the material (unlike other physics teachers) and her retakes are always problem solving (so you can't go wrong there). She posts Powerpoints online.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Oh. Ms. Balangue. The memories I have of her are all so vivid in my mind. We formed a spark over the time we had together. There was always an electrical spark in her class conversations. The gravity she put upon me with physic knowledge is. At first, Ms. B seems like your average person. But actually, she is a superstar. She is now like a second mother to me. SO care. So help. Ms. B. You are forever in our thoughts and prayers.Submitted by a student","rating":3.8,"version":1}],"rating":3.8}},"__N_SSG":true}