{"pageProps":{"teacher":{"name":"Norman Nager","departments":["Miscellaneous"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017"],"classes":[{"name":"Health Education","block":"4","semester":"Fall2014"},{"name":"Health Education","block":"5","semester":"Fall2014"},{"name":"Merchandising and Marketing","block":"8","semester":"Fall2014"},{"name":"Study Skills","block":"7","semester":"Fall2014"},{"name":"Health Education","block":"4","semester":"Spring2015"},{"name":"Health Education","block":"5","semester":"Spring2015"},{"name":"Merchandising and Marketing","block":"8","semester":"Spring2015"},{"name":"Study Skills","block":"7","semester":"Spring2015"},{"name":"Health Education","block":"4","semester":"Fall2015"},{"name":"Health Education","block":"5","semester":"Fall2015"},{"name":"Study Skills","block":"6","semester":"Fall2015"},{"name":"Merchandising and Marketing","block":"8","semester":"Fall2015"},{"name":"Health Education","block":"4","semester":"Spring2016"},{"name":"Health Education","block":"5","semester":"Spring2016"},{"name":"Merchandising and Marketing","block":"11","semester":"Spring2016"},{"name":"Study Skills","block":"6","semester":"Spring2016"},{"name":"Health Education","block":"4","semester":"Fall2016"},{"name":"Health Education","block":"5","semester":"Fall2016"},{"name":"Study Skills","block":"6","semester":"Fall2016"},{"name":"Merchandising and Marketing","block":"8","semester":"Fall2016"},{"name":"Health Education","block":"4","semester":"Spring2017"},{"name":"Health Education","block":"5","semester":"Spring2017"},{"name":"Merchandising and Marketing","block":"11","semester":"Spring2017"},{"name":"Study Skills","block":"6","semester":"Spring2017"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for CVE, but heard he's going to be teaching College","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"CVE 1. He's an easy A. However, I do think he didn't really teach us much at all. He teaches common sense stuff. Who doesn't know how to use powerpoint or Microsoft Word? Not much business. If you want an easy A take him. He's nice but doesn't know your name. Tells lame jokes & is repetiive sometime","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Nager is an awesome teacher. I would recommend everyone to take his CVE class. He tells jokes all the time and is also pretty laid back. There was some HW at the beginning few weeks of class, but the last 4-5 weeks was pretty much just working on our final, which was a power point presentation on pretty much anythign we wanted.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. nager is the best teacher. I've ever had. He knows a lot about our system and cares so much about our world, he turned me into a big environmentalist. He's a great man to listen to, very smart and just wants to help out. he doesn't judge you.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is a really nice guy, but can be a big pushover. many ppl in my class tend to take advantage of him & not really take his class seriously. grading is pretty easy, & how much you learn all really depends on you. mr. nager provides a nice range of opportunities such as programs & ideas for the future. he sometimes mentions some political news & issues in society that can be pretty interesting. sometimes he shows some amusing videos. overall, nice guy+grader; just not given respect he deserves","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"amazing teacherSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr nager himself is a really kind guy with an awesome sense of humor, its funny..sometimes i dont even get his jokes..\"farm assist\" ..grin.. u know who i am mr. nager =] well...i feel that u must be a bit more assertive in your class because the students are obviously disrespecting you wit their random shenanigans...and most of them care for only the credits..so PLEASE! be assertive!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"take him for college/career. he's the best. even though it's pretty much a pointless class, he makes it somewhat interesting. no homework, no tests. he's really a cool guy too","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. nager is awesome. hes cool and understanding, and tries to make the class enjoyable. you can learn a lot too. really funny too.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he does not teach at lowell any more, but i had him for health in 2017 and he was one of my all time favorite teachers. Yallah Yallah!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"what an awesome dude","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for CVE Marketing and loved it. He's such a genuine person and he really cares about his students. The class is easy, especially with friends. If you put in genuine effort, you're good. He's slow on grading but he lets you turn in assignments late. I wish he could just teach all of my classes.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"jokes a lot. plain FUN. Be careful on the Midterms tho.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes a really cool guy! really understanding. wants to help as much as he can, but sometimes he gets very boring. you can learn a lot if you dont know anything about computers or business, but if you know a big amount, youll be bored out of your mind","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the nicest teachers I've ever hard. I had him for college and career, and we never really had hw or tests. It was a really chill class and we learned some useful things, Easy A.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for Health, he is very caring and nice,grades aren't a big issue, I feel like any class he teaches is an easy A! Really cares about the well being of his students. Assigned hw once every 2 weeks from the online book. Heard he's retiring soon.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very cool teacher. Care alot about his students. his CVE class is a MUST take!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"vv lol at this kid, he saw this and was crushed. really nice guy, doesn't ask too much of you","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He was a fun and great CVE teacher. But I think the funds are taking away CVE, so now he's going to be teaching college and career","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for CVE Marketing and loved it and him! He's such a cool teacher, super funny and smart. He really cares about students and makes class go by really fast. Super helpful and knowledgeable. I wish he taught another class so I could take it.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Love this guy! Great teacher, tells corny jokes and informs you on current events and job opportunities. Very easy A. Some material might be basic knowledge, but I still find this class helpful. I've learned a lot more about applying to colleges and how to prepare.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He jokes alot, and he tries to talk like a teenager, where he'll say something like fasho, or HELLA tight, it's sooooo FUNNY!! he's an awesome and understanding teacher. He's my favorite all time teacher =))))))","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher,very understanding. must take his CVE class","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love his jokes, especially when he used that serious face","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easiest A at lowell (c","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hella funny teacher. Probably one of the top 5 nicest teacher! Cares alot about students.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love mr nager!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class was awesome! He tells lots of jokes, has us watch movies, do little worksheets and things on comp, and thats pretty much it. Loved his class. Take his CVE class!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Nager has an odd, quirky sense of humor. It's hilarious! His class is laidback and the workload is light. The only thing you need to worry about is the midterm. You should definitely take CVE! I learned a lot of things that I didn't know about and it is a good introduction to economics.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take him for college and career! He's such an easy A! You just have to do the assignments he gives (which is like 1 assignment a month) and you're set. Really nice and helpful too, he'll get you a job if you ask him to.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Definitely take him for college/career. Easiest A of my life. Barely any homework, in class work, and no tests. Basically everyone gets and A. TAKE HIM!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy chill class. best college and career teacher. he repeats his lessons a lot. easy A if you sorta pay attention in class.","rating":4.7,"version":1}],"rating":4.7}},"__N_SSG":true}