{"pageProps":{"teacher":{"name":"Patrick Fahey","departments":["Math"],"semesters":["Fall2014"],"classes":[{"name":"Geometry","block":"2","semester":"Fall2014"},{"name":"Geometry","block":"6","semester":"Fall2014"},{"name":"Pre-Calculus","block":"1","semester":"Fall2014"},{"name":"Pre-Calculus","block":"5","semester":"Fall2014"},{"name":"Pre-Calculus","block":"7","semester":"Fall2014"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"i find myself looking at the board trying to pay attention, only to realize i am baffled beyond imagination. he doesn't make a connection to what he's doing and doesn't answer questions well. instead, he answers with some bizarre explanation that didn't have to do with the question whatsoever. so after he finishes \"answering,\" people think to themselves, \"so what was the answer?\" well, that's how it is for me.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is the worst math teacher i have EVER had. he cant even do the math problems. how he thinks he can teach it to students is beyond me. I have managed to get a B for 2 trimesters so far but only because he gives random extra credit points. Do your homework cause its worth a lot. avoid","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fahey is a very chill techer. his tests are realy fair and he covers only the stuff that will be on the tests. his lecturs are also very interesting, he like brings in his computer and beams graphs on to the bord, which really helps people visualize the them. And he is a really great guy that you can talk to on a personal level. and if you are into NASA he is the dude to talk to.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good afterNOOOON mr. fahey!! he's cool, just remember to bring all your tools and do your homework because he checks it sometimes. he'll say he'll collect and sometimes he might forget, but he usually doesn't so it's safer if you do do it. he's a really smart and interesting guy, it's just that he might veer off into a nasa-linked subject, which is cool but not really math. he's cool, and the weird thing is he's ok when explaining things during clas, but realy good in tutorial.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He really isnt that bad of a teacher, and at times he can even be funny. he's actually quite easy and hw load isnt that bad. In fact, i think he was a really good teacher.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he would be considered easy if he grades easier, but de doesn't","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"what are you people talking about? mr. fahey is a good teacher. he knows his subject very well, he's a genius. his grading scale is reasonable, he's always there to help, and he's really funny sometimes. the only reason why people don't do well in his class because they're not willing to put in the extra effort to get a good grade. mr. fahey's not the one doing the studying for us. mr. fahey's a great teacher and deserves better support, he can teach math and that's all we can ask for.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"worst.. period.. he doesn't really teach at all and just think he is a very helpful teach when in reality he's the worst.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For Geo, Mr. Fahey isn't that bad, but his class can often get overly boring. However, he is EXTREMELY easy as long as you actually prepare for his tests and do the hw. Half of the time you have to learn by yourself from the book. Fahey will give the class a 5 minute nap time if you ask him to.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I used to hate him, but honestly, he's not bad. If you can understand the book then you'll be fine. he's smart but not great at teaching. But I hate is when he wastes out time on small things.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Fahey is a great teacher. He is really easy to relate to and sometimes doesn't even check hw. Tests are pretty hard though but if you study you will be prepared. Take him.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Geometry 1 Pros:at least he curves the grades, which really help. Stays after school for \"tutorial\", but depending on how you learn it wont really help. Theirs homework everyday, but its usually a couple problems. Cons: Talks about space stuff, which takes up an entire class period or half of it. Tests are not easy, unless your love geo. sometimes puts you to sleep","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He really wants you to learn and understand the importance of what you're learning, too. If you just listen, it's actually very interesting and makes math more meaningful. As for grading, he does everything to try to keep grades high, he curves a lot. He's also really funny if you just wake up and listen :)","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I learned a lot in Mr. Fahey's class. I wish he would teach more from the book examples, but after reading my notes from his lectures, I got it. I hated the summaries, but I got better at it. Also, he needs to go over HW everyday, not just most days.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Worst math teacher ever. Picks on students. very unfair. If you're not that good at math, avoid him at all costs because you will not learn a thing and he doesn't help you at all. Instead of help, he makes you feel bad about not knowing the lesson and yells and embrasses you. He also likes to brag about his teaching skills (has none) and how he could be an astronaut. Pick anyone, but him. Trust me.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"don't get mr.fahey for geometry!!!!!! he tries to teach but does a bad job of it. he just gives you homework without teaching. i don't know what i was thinking when i decided to take him","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Can't teach","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he starts talking about other stuff like scinece... and the hw doesnt even go with the hw sheet. its only easy if u already know some of the stuff.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"just needs to work on clarity. he's actually a genius","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is terrible at teaching but a nice guy. his heart is in the right place. dont take him for precalc!","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Fahey is not a good algebra teahcer. He always talk about things beyond math and other nonsense for about 1 mod and doesnt really teach much. He also gives out homework on things he didnt teacher us. He never lets us out on time too! He's not a very good teacher, but he offers help afterschool.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I can't believe I have to stay in his class!! He goes through the material way too fast, and when you ask for help, HE doesn't even understand the material! Tough grader, tough tests, Im going to fail his class.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher!","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is an easy B. But he gets off topic at the beginning of class, so basically half of the whole class time is taken up by his singing. And the rest is math. good rihgt? well not when finals arrive.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's ok... really not the best teacher because sometimes he uses big concepts we don't understand. tutoring afterschool a definite plus.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I take him for geo. the class flows pretty well most of the time he goes on random rants about stuff that does not connect to math AT ALL. but sometimes he teaches and you learn some, do all your HW pass the tests and GO TO MATH LAB ! he will love you and boos you grade up ! I got an A ...","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. fahey is seriously one of the easiest math teachers i've had so far. if you do your homework neatly, he gives you extra points...just do well on the tests, which are NOT that hard. he's OBSSESSED with NASA and CHESS and will often RANT about them...class gets really boring though =(","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't know if he makes it easy for his students, but I find math really easy this year! Last year, I was struggling in Accel., so it's a relief to find math understandable and fun again. Just make sure you bring your tools in everyday, do all your homework (he likes it when it's neat), and if you don't understand something, visit him after school for tutorials and he'll help you. He calls us his \"jewels\" and he cares about us! =) A nice and cool teacher.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I heard a lot of bad reviews about Mr.Fahey when I entered the classroom, but after a semester in his precalculus class I felt that the class was really helpful. Mr.F was the only teacher I ever had that applied the lesson into real life scenario. His tests are multiple choice, and easy if you study pay attention in class. There is homework everyday, but it should only take ~30 minutes to finish. He has homework checks on random days, and it's worth around 5 to 10 points every homework check.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fahey is kind of weird and he always talks about NASA and astronauts. Sometimes he brings in his mandalay to play for the entire class or has a live voice chat with astronauts for the whole class. He's willing to help you after class and he is EXTREMELY EASY!!!!!!!!!!!!!!!!!","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"COOL GUY HE SHOULD TEACH MUSICINSTEAD VERY UNCLEAR BOUT MATH CONCEPOTS N NEEDS TO GO OVER HW A LOT MORE 1ST YEAR HERE SO HE NEEDS EXPERIENCE PLAYS DA MADOLIN WEL DOUGH N TRAVELSLOT","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I dont have him, but looking at my friend's test in his class, it was extremely hard and some of the questions didn't even make sense.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He turned out to be one of my favorite teachers. He is funny at times (but not always). I thought that I'd hate proofs, but its not so bad. I actually look forward to his class.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i've had him last sem for geo1...hes easy, but i never learn, he does this math lab thing, where you go correct your test, and he'll boost up your grade...but, friends in his pre-calc class hated him.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's pretty easy if you know the material. I already took Intro to Geo the summer before I took him for geo, so the class was pretty easy for me. And he curved every test..a lot. o_o","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for one semester of geo and one semester of pre-cal, getting A's in both classes.-Easy tests, especially in pre-cal. If you self-study, even easier-Bad at lecturing. Because of this, it can be hard to learn from him. Try to avoid if you want to actually learn and go on to calculus.-Never collects homework (although he says he will). He DOES check homework from time to time, but this really depends on his mood. I got A's doing less than half the HW in geo, and doing none in pre-ca","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i've had mr. fahey for both semesters of precalculus. he's a great teacher who's very helpful and caring towards his students. the way he teaches is okay, it's mostly lectures and cool overhead views of his graphing calculator on his computer. i think it's more of the higher math concepts than the teacher that students have problems with. fahey's a great teacher, hands down.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"\"My people, my people\" I love that quote! He's a nice guy just study a lot. Material is simple.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Unclear lessons. RARELY went over homework. Often assigned hw with not-yet-learned material. Lots of pop quizzes. Tests at random times. Very unorganized grading system. BAAAAD.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i didn't like him at first, but he got better. not that great of a teacher but a good friend you can talk to. never mean to you and he's really respectful to everybody. i had one a and two b's for trimester grade, but i think he liked me, so he gave me a final semester a. ;]","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"has his own bad, gotta give him props for that. OBSSESSED WITH SPACE STUFF AND CHESS. doesnt teach because hes too busy talking about stuff that is totally irrelevant to what we are learning. horrible, take him instead of costa for sure but try to avoid him.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I'll admit that Mr. Fahey definitely isn't the top math teacher, but if you're a good math student, his class is stress-free and entertaining. He cares a lot about his students, and if you talk to him in a small group, it's guaranteed that he'll postpone tests and due-dates, add a curve, or give you an extra chance. Even though I learned mostly from the book, this was probably my easiest A in math at Lowell.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"\"Ladies and gentlemen... amphibians...\" Anyways, he's an interesting and friendly guy, but his class is really not one you want to be in. For some reason, his lectures do not really explain anything. He grades your homework on neatness as well. My class was able to talk him out of a bunch of test dates and homework, but it didn't make those tests any easier. He's another Lowell teacher where you have to learn by yourself if you want to stand a chance in class.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"not the best teacher. you dont learn nothing . u just have to teach your self and go over the book and you'll be all good for the test. try on the homework and u will get at least a b. but if u dont understand anything ure screwed. overall he shudnt be teaching, isnt a good teacher","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"stop talking about space, its a math class","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He gives students a second chance at everything!! nice guy, funny at times, and weird at other times...","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice guy but that does not mean hes a good teacher. He is very unclear of things and jumps from one subject to another. all i have to say is DO NOT TAKE HIM ... he DOES NOT PREPARE YOU AT ALL!!!!","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is one of the best teachers here at Lowell. He is very straight forward and knows his material, like the back of his hand. He explains material very well in class, and goes over the HW with even being asked. He can really relate to his students, and he never looses his cool. Mr.Fahey rocks for pre-cal. I had him for second semecter, and he made the suff we learned in class easy to understand. He is the best! So take him.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's okay, he's not as bad as what other people say. He's very laid back and very cool, he respects people and he also tries to help. His teaching on the other hand is very bad, i didn't get a word he was saying, most of the time i had to study from the book myself. at times it does seem like he doesnt know what he's teaching about but it's okay. He tries to help people who need help though, he cares about his students.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy B, hard A. hes rlly not as bad as people say. if you study u will be fine.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"class is interesting, shows how math works in sciences. Could go over homework more.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i have to teach myself everything. i somehow have a B- by not understanding anything at all.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He seemed bad at first (after having mr.mana), but after a while, once you get used to his system, he is actually better than mr.mana. My friend never got a perfect 100 in mr. mana, but now that she has mr. mana, shes been getting a hundred after a hundred, after a hundred. Not only this, but he also is giving me and a friend to go to Geometry Honors instead of regular Geometry and I have been getting C's. He's not as bad as everyone thinks","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Let's see, $113 million dollars short fall in the SFUSD and we have math teachers who don't teach and don't help the kids learn. Hmmm. What should the answer be?","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he grades very unfair, and he doesnt know what he is teaching, and he always confuses himself. DO NOT TAKE HIM!!!","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love fahey! His tests and homework are way more reasonable than hunt and he does teach ok. He has group quizes whick help ya learn too. Also, he talks about how math relates to other issues and isn't boring. He plays jazz mandalin sometimes in class and is insanely funny with nice insights!","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he sincerely tries to teach but doesn't really know what to do and how to inspire kids to learn. the people who really hate him are the ones who cheat and don't try... if you put in honest effort you should be fine. he's not THAT hard, and this is coming from a person who has gotten Cs for the past","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fahey tends to mumble through a lot & sometimes can even let out his anger on us .. but other times he's an okay teacher. he offers us help afterschool if needed & is funny .. sometimes. He might not be the best teacher in the world but he's not the worst either","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Fahey is not as bad as everyone thinks! He is pretty funny. He can be at times confusing but he will really try to help you. His tests are multiple choice and are relatively easy if you understand the material. I mostly self teach in that class.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He can't teach at all, all he does is talk about space. And whenever he does \"teach\", he makes it so complicated. He expects too much from students, tests take a toll on your grade, and has favorites.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MR.Fahey is the nicest teacher in the math department. He is so helpfull. His class is very lively and there is never a dull moment. Mr. Fahey explains all the material that we cover in the book, with great detail, and he makes sure everyone gets the material before moving on. Because his lectures are very clear and to the point, students usually do very well in his class. He even stays after school to help tutor people who were absent or who don't get the things covered. Take him!","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Geo for this guy and this class will be a breeze if you can teach yourself a bit. He \"pushes\" you in the right direction. His tests are sometimes challenging but most of the time it's easy. The thing that sucks is that he goes off topic very EASILY. He's a good teacher. I would recommend him.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"always goes off on tangents about space and rarely ever teaches anything; expects us to do things on our own.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for two semester in geo1 and 2. I always looked forward to his class. A NASA engineer talked to us from Houston about the math we study in class required for space missions. Very cool.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I liked Fahey's teaching style the first 6 weeks of school. Now i think instead of letting student do more work on their own in class for precal he should do more examples to demonstrates new stuff. And even when he does do this i wish my classmates would just shut up and listen. Mr. fahey loves to help his students afterschool and doesnt mind when you correct him. He always puts in 110% when he teaches you just have to do your part.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"This class is mostly self-study. Tests are simple and usually not hard. The homework is annoying, but very easy. His exlainations are not top-notch, and he confuses himself a lot.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher. He does his best to teach, and you do learn a lot if you listen. he does not give the dept final, but makes his own.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He works hard for you, & really tries to get you to understand. He's not terrible .... but I don't know. I do think he's one of the better teachers in the math dept. \"Good afternoOon Mr. Fahey.\"","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really chill but terrible teacherI. You have to teach yourself and or get a tutor. He assigns homework and half the time he forgets to help you on any questions you dont know.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Fahey is probably my favorite math teacher. On my first geo test I got a horrible grade, like 59%. But, He told me to go afterschool and work on some problems and he actually changed my grade all the way up to an A minus. Really nice teacher overall.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his class is great you learn and have fun. He is not boring","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love mr fahey!!!","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Wow, he can play the MANDOLIN!!! (sarcasm)still doesnt make him a good teacher tho...","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"To all the people who think mr.Fahey does not answer questions well you all have to ask yourselves wether or not you are doing your best to answer the questions yourselves through your own observations and his explenations.Ofcourse he's not going to answer your questions directly its up to you to build a strength in understanding and recognizing things from different views and perspectives.Mr.Ftaught me a lot about myself he showed me my abilties and helped me strengthen my weaknesses.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's an okay guy, and if you know the math already, go ahead and take him. He's easy. But if you need to actually learn, I dont' suggest him.","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Horrible teacher. Tons of people in my class are getting C's, some even failing. I suggest you get a good teacher that you actually LEARN from","rating":2.9,"version":1}],"rating":2.9000000000000035}},"__N_SSG":true}