{"pageProps":{"teacher":{"name":"Randell Prothro","departments":["Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Physics","block":"8","semester":"Fall2014"},{"name":"AP Physics 1","block":"2","semester":"Fall2014"},{"name":"AP Physics 1","block":"5","semester":"Fall2014"},{"name":"AP Physics 1","block":"6","semester":"Fall2014"},{"name":"Physics","block":"8","semester":"Spring2015"},{"name":"AP Physics 1","block":"2","semester":"Spring2015"},{"name":"AP Physics 1","block":"5","semester":"Spring2015"},{"name":"AP Physics 1","block":"6","semester":"Spring2015"},{"name":"AP Physics 1","block":"2","semester":"Fall2015"},{"name":"AP Physics 1","block":"4","semester":"Fall2015"},{"name":"AP Physics 1","block":"6","semester":"Fall2015"},{"name":"AP Physics 1","block":"8","semester":"Fall2015"},{"name":"AP Physics 1","block":"2","semester":"Spring2016"},{"name":"AP Physics 1","block":"4","semester":"Spring2016"},{"name":"AP Physics 1","block":"6","semester":"Spring2016"},{"name":"AP Physics 1","block":"8","semester":"Spring2016"},{"name":"AP Physics 1","block":"2","semester":"Fall2016"},{"name":"AP Physics 1","block":"5","semester":"Fall2016"},{"name":"AP Physics 1","block":"6","semester":"Fall2016"},{"name":"AP Physics 1","block":"8","semester":"Fall2016"},{"name":"AP Physics 1","block":"2","semester":"Spring2017"},{"name":"AP Physics 1","block":"5","semester":"Spring2017"},{"name":"AP Physics 1","block":"6","semester":"Spring2017"},{"name":"AP Physics 1","block":"8","semester":"Spring2017"},{"name":"AP Physics 1","block":"2","semester":"Fall2017"},{"name":"AP Physics 1","block":"5","semester":"Fall2017"},{"name":"AP Physics 1","block":"6","semester":"Fall2017"},{"name":"AP Physics 1","block":"8","semester":"Fall2017"},{"name":"AP Physics 1","block":"2","semester":"Spring2018"},{"name":"AP Physics 1","block":"5","semester":"Spring2018"},{"name":"AP Physics 1","block":"6","semester":"Spring2018"},{"name":"AP Physics 1","block":"8","semester":"Spring2018"},{"name":"Physics","block":"2","semester":"Fall2018"},{"name":"Physics","block":"4","semester":"Fall2018"},{"name":"AP Physics 1","block":"7","semester":"Fall2018"},{"name":"AP Physics 1","block":"8","semester":"Fall2018"},{"name":"Physics","block":"2","semester":"Spring2019"},{"name":"Physics","block":"4","semester":"Spring2019"},{"name":"AP Physics 1","block":"7","semester":"Spring2019"},{"name":"AP Physics 1","block":"8","semester":"Spring2019"},{"name":"AP Physics 1","block":"2","semester":"Fall2019"},{"name":"AP Physics 1","block":"4","semester":"Fall2019"},{"name":"AP Physics 1","block":"8","semester":"Fall2019"},{"name":"Physics","block":"7","semester":"Fall2019"},{"name":"AP Physics 1","block":"2","semester":"Spring2020"},{"name":"AP Physics 1","block":"4","semester":"Spring2020"},{"name":"Physics","block":"7","semester":"Spring2020"},{"name":"AP Physics 1","block":"8","semester":"Spring2020"},{"name":"AP Physics 1","block":"2","semester":"Fall2020"},{"name":"AP Physics 1","block":"3","semester":"Fall2020"},{"name":"AP Physics 1","block":"6","semester":"Fall2020"},{"name":"AP Physics 1","block":"8","semester":"Fall2020"},{"name":"AP Physics 1","block":"2","semester":"Spring2021"},{"name":"AP Physics 1","block":"3","semester":"Spring2021"},{"name":"AP Physics 1","block":"6","semester":"Spring2021"},{"name":"AP Physics 1","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-02T04:32:52.303Z","text":"(AP Physics) He's a very energetic and loud person, and finds many fun ways to express ideas about physics to you, but as a teacher he refused to tell you how to work something out, and instead tries to force you to come up with the answer on your own which was personally not helpful for me when trying to grasp a concept. Easy B, hard A, grades are 50% labs/homework, which you nearly always get full marks on, and 50% quizzes/tests, which most people get around a C on. ","rating":5,"version":0},{"timestamp":"2020-05-02T00:09:32.629Z","text":"He's really chill, fun, and you get a lot of freedom in his class. We got to play a frisbee game and have a water balloon fight this year lol. His class is an easy B, but really really hard A. Our test averages were always 60-75% and he's never curved anything all year long. His class follows a cycle: First he lectures and introduces a new unit, followed by a bunch of labs, then homework days, and finally a unit test(he likes to call tests \"Feedbacks\"). Highly recommend him :)\n","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great Physics teacher. I learned a lot in his class, no stress. Still easy B if you're not that good in science","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he does fun and interesting activities in class that keep you involved. laid back guy who doesn't really take attendance so you don't really have to go to class all the time. he explains things well once and doesn't really have many days out of the week that he explains stuff, he just gives problems for you to do and demonstrates how to do them which is helpful at times. pretty tough tests if you don't fully get the concepts, but a really fun guy.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"sometimes its hard to understand what he is talking about but when he talks to you one on one it clicks. he is super cool and friendly, but you dont learn as much... take him if you can !","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. prothro is really cool! but tests are a bit tricky. but the worse you can do in his class is a b-, so that's not too bad. kind of a hard A though, unless you're really good at physics. he gives hw once a week, but it's not that bad. just a few problems a week, and he goes over them in class before you turn it in.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a very cool teacher...but he gives WAY TOO MUCH homework...outlining and the Q parts of the questions are alot of work...take him if you want conceptual physics...mr. cooley is better in my opinion just becuase hes more math based and gives less hw","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Mr. Prothro he is probably my favorite teacher at Lowell. He is such a wonderful person and is more like a friend than a teacher. He tries to make class as interesting as possible but sadly it's still pretty tough if you're not good at sciences. He grades you based off if he thinks you understand the stuff or not and the final and not really the homework (which he asignes only right before tests). Better than Ms. D by far though.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Prothro is the chillest teacher ever and is very laid back. He enjoys nature(that shows with his classroom)and stuff. He doesn't teach as well as Cooley only because his philosophy is that students shouldn't be spoon fed every single piece of information. He believes in being able to problem-solve b/c that's an essential skill in life. Tests are easy if you studied and understood the concepts independently, but hard if you don't do anything in the class and don't enjoy learning physics yourself.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. prothro is awesome!!!! he's such a fun teacher. this one time.. it was super sunny outside and we went out to play ultimate frizbe... he's a pretty good teacher as well.. explains things very well","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"(AP Physics 1) Prothro's class is super laid-back and he's a great dude. He is very set on the learn-by-doing teaching style and so his labs are great, but his tests are difficult and mostly conceptual which requires a lot of studying. I personally didn't really understand his lectures, and if you don't start off fairly strong in algebra (which he almost always entirely skips), watch lectures on Khan Academy to stay caught up. Prepares you VERY well for the multiple choice part of the AP test.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took him for regular physics. At first I really liked him, thought he and his class were chill and he was a good teacher (at least in comparison with ms. d 1st semester) but now I realize he doesn't really teach. really hard tests but huge curves. easy B, very hard A. Bit of a narcissist but I guess pretty chill. you can skip class sometimes, come in late, not turn in some stuff, and he won't really care. I didn't personally like him too much but a lot of people do","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Please take Prothro if you can. He's great. I bombed all the tests and did the homework and still got a C. He WILL NOT fail you if you come to class, which is nice. He's a great guy and explains well. Although I don't understand his grading policy. Please take him! He's a great teacher!","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ok so hes really tight. and he really got me fascinated about physics. He presents the information clearly and if you were to go home and think about the material for about five minutes it would all make sense. Physics is not easy to teach, but he really does a good job. if you can get him, take him","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. prothro is awesome!!","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Chill class. Not the best teacher, but makes up for it by doing fun activities and being very laid back. Easy B, but really hard A. Not really sure how he does his grading, but it seems like it's from his impressions of you and your tests rather than points.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"This is a somewhat exciting class. Test scores, however, have little to no impact on your actual grade. He gives you a grade based on what he personally thinks you know, not what is reflected by your tests. He's also extremely condescending.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy teacher. Very nice guy. Hard A. Easy B. If he feels you aren't trying you'll end up with a C.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"when the principal came in to evaluate him, prothro taught. but hear me when i say that he does NOT teach the rest of the time!!! he just gives us problems (which are usually crazy hard, that way, he gets to","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"barely teaches, hard tests.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good class for slackers because he doesnt give less than a B (usually) but not good for serious students. He doesnt teach that much, his tests are too hard, and doesn't like to give As.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Don't let my ratings fool you, i had him for honors, and this is how everyone can get a B. Turn in homework..eventually, and if you pay attention, and get all the conceptuals, you should get 50-70% on the tests, you can pull out a B/B+","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for Physics in F06/S07. Cool guy, not so great as a teacher. I'm sure he knows the material, but the delivery isn't what it needs to be for us to understand. It sometimes seems like he's more into having fun than teaching the class. It doesn't fit at Lowell -- we want fun AND learning.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"well he said the worst you can do is a B- but on the last day of class, he says that he's giving Cs >:O if he told me that a lot earlier, i would have tried a lot harder instead of listening to music during class.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"PROTHRO'S A 'G! i have him for physics H. love him and love the material/class. barely any hw. tests r tough-ish. awesome overall person and great teacher too. its surprising how much i can learn every unit from a couple of demonstration days (where we do cool experiments in class) and some days where we do fun problems in class while talking and stuff. you get to go outside occasionally and learn physics first-hand too. my most looked forward to and fun class.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Prothro is a great teacher. Helped me get a good AP score. However he can't beat me in darts.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's actually improving in his teaching recently and i'm glad that is the case... sure, i'll take the B (bleh) but at least I know i learned something along the way.. keep it up, prothro.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The coolest teacher you will ever have, easy B, but you still have to kind of work for it, tests almost every friday, but it covers everything he demonstrates in class and his lectures","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took him for regular Physics F'11. Awesome teacher. Before class he'll ask if you anything to share with the class and if it's interesting, he might continue to talk about it and get off topic sometimes (takes up class time). Says he doesn't believe in homework and that tests show more.Was assigned","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"tests aren't that bad if you actually study and do the practice tests. he's always there for help if you need it. hard A, but definitely doable if you put in the work. ridiculously easy B, which I guess is why so many people take him. btw, his room has so many toys and fun things to do!Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Prothro's hella tight. Can relate to the students, but still makes sure everyone is respectful. Workload is light, but he still expects you to at least try to understand the material. Lectures are paired with interesting demonstrations and usually keep people at least partly-interested. Tests can be quite challenging, but you get a B as long as you try. People who he sees truly understands the material and makes an effort will get an A.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class is alright. doesnt really teach that much. easy B becuase you only need 70%Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best experiences you can have at Lowell. Not the easiest by far, but definitely the most fun. You will constantly by mindblown! (Boomerangs, bows, whips, insane frisbee skills). His grading is curved to your own class, e.g class average was 9/40, a 15/40 is an A. His homework is very light, Also, great guy to talk to for just about anything, funny stories all the time, and always interested in whatever you have to say. If you arn't very talkative, you won't get the full experience.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"taking prothro will be the best classroom experience you will have at lowell. it's my 2nd semester senior year, and his physics class is the best. he's fun, really chill, makes physics really interesting, and doesn't get mad at you ever. just don't be uptight, let him work his magic.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fair grader, doesn't give lower than a B unless you don't try at all. If you want an A you actually have to do well on the quizzes. Occasionally on days when there's nothing to do we'll play ultimate frisbee or taboo, which is always fun :) Very little tests and homework during the second semester, but kind of a lot during the first semester.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a very nice and laid back teacher. Lectures are clear and there are lots of cool demonstrations; not too much work, which is nice, but tests are tough for most people. Easy B, but getting an A requires a genuine understanding of the physics taught.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Prothro is one of my favorite teachers at Lowell because his labs and class itself are really engaging. He really treats his students like friends, and is really laid-back. His intentions are well, he wants you to understand physics and does his best to teach it. He barely uses the textbook though, only to assign homework. Physics can be a really hard subject to teach, but for someone who feels like they learn better by visual projects, Prothro is by far one of my favorite teachers at Lowell.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. prothro is a cool teacher. class is very chill. easy B. very hard A unless youre a genius in physics. not much homework. fail every test and you'll end up with a B-.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Doesn't teach, lets class out early half the time, good if you someone can magically understand physics, but his honors tests are impossible and 90% of the class gets a B. Full of himself and spends more time showing off his bow and arrow then explaining how to pass his tests.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very chill and good teacher. He is always willing to answer questions. His tests are rather hard but if you pay attention and do your homework you should do fine. He is really nice and and an interesting person too.Submitted by a student","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hes gives stduents a B as long as they put effort into their work. He doesn't really follow his own syllabus. You can get A's and B's on tests, which are worth half your grade, and get full credit on labs and homework, which is worth the other half, and still get a B. I think he just doesn't like to give A's. He doesn't really teach you how to do the hard problems he assigns. He just throws them at you and lets you figure them out with your group so if you don't have a good group, you're screwed","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Well Well Well...... VERY VERY CHILL CLASS. Hmm make sure to write down all his example problems as he gives them like once a week. Learn from them and i guarantee u that u will ace his class for AP Physics 1. Well other than the academics, he does have a lot of \"stations\" full of fun stuff around teh room. Its so barbaric. Its unliek any other lcass uve taken.","rating":3.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy B, Hard A. Personally, I think that outlining the chapters is pretty pointless. The hw he gives is fair enough. The quizzes every Friday are a killer though. Haha. I'm gonna cut him some slack since he's fairly new. He'll get better with experience. My suggestion is that he should assign a section of a chapter to be read a night + 5 questions pertaining to the reading rather than assigning one whole chapter a week. That is Mr. Wenning's method and I found it to be really effective.","rating":3.9,"version":1}],"rating":3.9279069767441888}},"__N_SSG":true}