{"pageProps":{"teacher":{"name":"Rebecca Johnson","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Economics","block":"1","semester":"Fall2014"},{"name":"AP Economics","block":"3","semester":"Fall2014"},{"name":"AP Economics","block":"5","semester":"Fall2014"},{"name":"AP Economics","block":"7","semester":"Fall2014"},{"name":"AP Economics","block":"1","semester":"Spring2015"},{"name":"AP Economics","block":"3","semester":"Spring2015"},{"name":"AP Economics","block":"5","semester":"Spring2015"},{"name":"AP Economics","block":"7","semester":"Spring2015"},{"name":"AP Economics","block":"1","semester":"Fall2015"},{"name":"AP Economics","block":"7","semester":"Fall2015"},{"name":"AP Human Geography","block":"3","semester":"Fall2015"},{"name":"AP Human Geography","block":"5","semester":"Fall2015"},{"name":"AP Human Geography","block":"3","semester":"Spring2016"},{"name":"AP Human Geography","block":"5","semester":"Spring2016"},{"name":"AP Economics","block":"1","semester":"Spring2016"},{"name":"AP Economics","block":"7","semester":"Spring2016"},{"name":"AP Economics","block":"3","semester":"Fall2016"},{"name":"AP Economics","block":"5","semester":"Fall2016"},{"name":"AP Human Geography","block":"1","semester":"Fall2016"},{"name":"AP Human Geography","block":"7","semester":"Fall2016"},{"name":"Economics","block":"7","semester":"Spring2017"},{"name":"AP Economics","block":"3","semester":"Spring2017"},{"name":"AP Economics","block":"5","semester":"Spring2017"},{"name":"AP Human Geography","block":"1","semester":"Spring2017"},{"name":"AP Economics","block":"1","semester":"Fall2017"},{"name":"AP Economics","block":"3","semester":"Fall2017"},{"name":"AP Human Geography","block":"5","semester":"Fall2017"},{"name":"AP Economics","block":"1","semester":"Spring2018"},{"name":"AP Economics","block":"3","semester":"Spring2018"},{"name":"AP Human Geography","block":"5","semester":"Spring2018"},{"name":"AP Human Geography","block":"6","semester":"Spring2018"},{"name":"AP Economics","block":"1","semester":"Fall2018"},{"name":"AP Economics","block":"3","semester":"Fall2018"},{"name":"World History","block":"5","semester":"Fall2018"},{"name":"World History","block":"7","semester":"Fall2018"},{"name":"World History","block":"5","semester":"Spring2019"},{"name":"World History","block":"7","semester":"Spring2019"},{"name":"AP Economics","block":"1","semester":"Spring2019"},{"name":"AP Economics","block":"3","semester":"Spring2019"},{"name":"AP Human Geography","block":"2","semester":"Spring2019"},{"name":"AP Economics","block":"1","semester":"Fall2019"},{"name":"AP Economics","block":"3","semester":"Fall2019"},{"name":"World History","block":"5","semester":"Fall2019"},{"name":"World History","block":"7","semester":"Fall2019"},{"name":"AP Economics","block":"1","semester":"Spring2020"},{"name":"AP Economics","block":"3","semester":"Spring2020"},{"name":"World History","block":"5","semester":"Spring2020"},{"name":"AP Human Geography","block":"6","semester":"Spring2020"},{"name":"World History","block":"7","semester":"Spring2020"},{"name":"AP Economics","block":"1","semester":"Fall2020"},{"name":"AP Economics","block":"7","semester":"Fall2020"},{"name":"World History","block":"3","semester":"Fall2020"},{"name":"World History","block":"4","semester":"Fall2020"},{"name":"AP Economics","block":"1","semester":"Spring2021"},{"name":"AP Economics","block":"7","semester":"Spring2021"},{"name":"World History","block":"3","semester":"Spring2021"},{"name":"World History","block":"4","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-02T16:15:40.435Z","text":"I had Ms. Johnson for world history and she's the most admired teacher I've had my whole life! I entered her class with half a decade's worth of hating history but this class is the class that brightens my day! She's very smart, down to earth, explains big concepts very clearly so that I've learned more about history than all other years combined. Her class is hard in terms of the effort you put in, but even more rewarding if the wealth of knowledge you get out of it. Essay tests really prepare you for AP World. A few pages to read every night out of an AP book, take freehand notes and the next class is half her answering every question and throwing in a bit of lecture, and half work together to answer this KBAT question (hint: will help test). She makes sure everybody knows everybody else which is really rare in high school, so our class has a great family atmosphere and I feel like I can ask her anything at all.","rating":5,"version":0},{"timestamp":"2020-05-02T00:35:07.079Z","text":"She is a very good teacher and most people do not appreciate her enough. I personally had no motivation for social science in freshman year, but she never stopped encouraging me and giving me help during the year which helped me get a good grade. She wants everyone to succeed and she makes her lectures very straightforward and they are easy to understand because she breaks down concepts so that they can be easily understood. If you ever have the choice you should take her.","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had mrs. johnson for AP Econ and it was an absolute blast. I went in to the class hearing she was a hard teacher, but if you pay attention in class (which is pretty engaging) and crack jokes you will have a good time and learn a lot. She mainly lectures, but you don't have to take notes. Class activities include group worksheets and such, fooling around and derping about widdlyscuds and whatnot. Overall fun class","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easily one of the most underrated AP Econ teachers. Her lectures are interesting, she's funny, homework is scarce, and the exams are not at all too difficult. Averaged about 5 min of hw every night. Most nights there is not homework and sometimes it's just plain reading the textbook for homework. On","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hard work, but she makes it worth it. Lots of hw, including notes out of the AP book. Very time consuming in all. Easy A IF you are good at history. I barely have to study to get a 95. She uses school loop, which is very helpful.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP HUG is really hard and confusing and participation makes a big part i wished someone would have told me thatSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is the best ever. Totally recommend! By far the best econ teacher at lowell, all my friends in other classes are jealous of me and my classmates. Her class is so fun, you don't even realize how much I'm learning.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.johnson is a very good teacher. it's a hard class but if you want to learn take her for any class. she is a very helpful cool teacher but u have to listen closely in her lectures. she is amazinnnnnggggggg","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.johnson is like my favorite teacher of all my classes. she teachers so...fun, but also u totally get the events and how it goes effects something else. and when she talks, she incorbarates odd examples, but it totally makes sense.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took her for AP World. Very nice and knowledgeable. Also, entertaining, so you'll never be bored. Class was relatively easy, but did require some studying and group projects.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's an amazing teacher because she knows her stuff, and current news as well. She can answer any question you have about life lol. Idk if this is cause APHUG was my first class, but I found her tests and the FRQs kinda hard, so be prepared to really study and understand the material. HUG def felt like a college class haha but Ms. Johnson (and her awesome life stories) made it more bearable!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Modern World with her is fast paced, and really helps you learn note and test-taking skills. She uses the AP Euro and World books in addition to the proper Modern World book, its a good preview 4 latr","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for first semester of freshman year in modern world. She is really cool, i loved her exept for the fact that she made us work hard every day, essays, tests, ?NOTES FROM AP BOOK?for like 10 pg ugh i strugled to get a C. HARD WORK< BUT COOL AND HELPFUL (ask for help anyday) FUNNY!!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Where do I even start? Ms. Johnson is just such a great teacher, probably the best at Lowell. She's funny, helpful, supportive, and pragmatic. Her lectures are amazing and really make you think. Ms. Johnson knows what she's talking about and conveys information really well through her lectures. I was nervous about taking my first AP class (AP Human Geography) and was going to opt out the first week, but she made me want to stay. I would take any class she taught.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I got a B for first semester in her mw class. she's awesome, loves the GIANTSS, and shes reallly good making you learn if you actually try in her class. she's not easy, and a little hard. but i recommend her if u love history..","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took her for AP HUG, pretty good class overall. She prioritizes participation during class, so expect to be vocal and converse with the other students. Lectures are somewhat interesting and the notes are manageable (with practice and HER note-taking method). Ms. Johnson is very straightforward and, in general, states things as they are. I got a 4.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"FOR MODERN WORLD: Her class is not an easy A. It can be hard as hell at times. Yet, it still has a lot of benefits, and you can feel your skills sharpening throughout the course. She helps prepare you well for the rest of Lowell. Plus she likes fun stuff, so jokes and hilarious similes come up throughout the class. Take her for some awesome classes. Just be prepared to work. Hard.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have her for Modern World, and she's quite honestly my favorite teacher. I'm not a morning person in the least, and I have her for first block -- believe me, I don't even THINK about falling asleep in her class because it's that fun.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is hekka funny! tests are ok, i always forgot to turn in homework. she's nice. DOES NOT ACCEPT LATE WORK THO. oh, and \"participation is only based on one thing, and that is whether or not we get along\". haha","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Johnson is one of the best teachers at Lowell, if not the best. She is insanely smart, it's actually incredible -- and I am not even exaggerating. She knows how to make you learn, note take, test take, and what not. Ms. Johnson is my favorite teacher because she makes you work for your grade. She does not like lazy people, believe me. I would definitely recommend taking her because she will challenge you and help you grow as a student. She's the best, I am going to miss her so much.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Johnson's one of the hardest modern world teachers. Her essay tests are hell.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"last name ever first name greatest","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"FRESHIES! good 4 modern world, nice, funny and helps you alot. hw everynight but thats all mod. world teachers. you'll get use to it! not alot of ppl know her(because she teaches lots of AP econ) so take her, she wont get full because of that. GREAT TEACHER!! <3","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For AP human geography-super fun class and you learn so much. participation is huge so don't take it if you are shy. A lot of homework but it is just taking notes which she will teach you to do very well.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really cool. had her for modern world and she's really funny. not an easy a, but a easy b (if you study!) tests are hard, but you learn. helps you a lot with note taking and test taking skills","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Johnson is somewhat under-appreciated and people don't realize that she is BY FAR the best AP Econ teacher. She explains things clearly so you can really just rely on your lecture notes for studying purposes. You will be so well prepared for the AP tests and leave the class with a really solid and useful understanding of economics. I think Econ has the potential to be a boring, hard class but she makes it interesting and straightforward. She wants everyone to succeed in her class.Submitted by a student","rating":4.7,"version":1}],"rating":4.723076923076925}},"__N_SSG":true}