{"pageProps":{"teacher":{"name":"Richard Shapiro","departments":["Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Physics","block":"5","semester":"Fall2014"},{"name":"AP Physics C","block":"2","semester":"Fall2014"},{"name":"AP Physics C","block":"4","semester":"Fall2014"},{"name":"Science Lab","block":"9","semester":"Fall2014"},{"name":"AP Physics C","block":"2","semester":"Spring2015"},{"name":"AP Physics C","block":"4","semester":"Spring2015"},{"name":"Science Lab","block":"9","semester":"Spring2015"},{"name":"AP Seminar","block":"6","semester":"Spring2015"},{"name":"AP Physics C","block":"2","semester":"Fall2015"},{"name":"AP Physics C","block":"3","semester":"Fall2015"},{"name":"Science Lab","block":"10","semester":"Fall2015"},{"name":"AP Seminar","block":"6","semester":"Fall2015"},{"name":"AP Physics C","block":"2","semester":"Spring2016"},{"name":"AP Physics C","block":"3","semester":"Spring2016"},{"name":"Science Lab","block":"10","semester":"Spring2016"},{"name":"AP Seminar","block":"6","semester":"Spring2016"},{"name":"AP Physics C","block":"2","semester":"Fall2016"},{"name":"Science Research","block":"10","semester":"Fall2016"},{"name":"AP Seminar","block":"6","semester":"Fall2016"},{"name":"AP Physics C","block":"2","semester":"Spring2017"},{"name":"AP Physics C","block":"3","semester":"Spring2017"},{"name":"Science Lab","block":"10","semester":"Spring2017"},{"name":"AP Seminar","block":"6","semester":"Spring2017"},{"name":"AP Physics C","block":"2","semester":"Fall2017"},{"name":"AP Physics C","block":"4","semester":"Fall2017"},{"name":"AP Physics C","block":"2","semester":"Spring2018"},{"name":"AP Physics C","block":"4","semester":"Spring2018"},{"name":"AP Physics C","block":"2","semester":"Fall2018"},{"name":"AP Physics C","block":"4","semester":"Fall2018"},{"name":"AP Physics C","block":"2","semester":"Spring2019"},{"name":"AP Physics C","block":"4","semester":"Spring2019"},{"name":"AP Physics C","block":"2","semester":"Fall2019"},{"name":"AP Physics C","block":"4","semester":"Fall2019"},{"name":"Physics","block":"1","semester":"Fall2019"},{"name":"Physics","block":"1","semester":"Spring2020"},{"name":"AP Physics C","block":"2","semester":"Spring2020"},{"name":"AP Physics C","block":"4","semester":"Spring2020"},{"name":"AP Physics C","block":"3","semester":"Fall2020"},{"name":"AP Physics C","block":"4","semester":"Fall2020"},{"name":"Physics","block":"1","semester":"Fall2020"},{"name":"AP Physics C","block":"3","semester":"Spring2021"},{"name":"AP Physics C","block":"4","semester":"Spring2021"},{"name":"Physics","block":"1","semester":"Spring2021"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shapiro is really easy.. and he's so funny sometimes. I used to always sleep in his class and he'd make fun of me everyday... he didn't even care.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really nice and fun. he definitely tries and the things we do for labs are quite interesting but i have to admit, when he lectures, i can't help but want to fall asleep and i didn't learn too much. easy B but you have to work for that A. homeworks are easy and tests are based on practice tests.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro is one of those teachers that help you succeed at Lowell while remaining emotionally intact.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good workload for the AP, enough to learn but not absurd. He is a nice guy and puts learning before grades. It is very hard material, but I am pretty confidant about the AP, and the class was somewhat enjoyable. The class is a little community by the end of the year, and he occationally does nice fireball/projectile/highvoltage... stunts.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love this class","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best science teacher ever!!!! He's totally approachable and helpful. Tests can be hard but they often get curved. Take care to do a good job on lab writeups.There's also extra credit if you mess up on a test or 2.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i expect to get an A in ap physics although this is the hardest material i've ever had to learn-mr. shapiro makes it all highly enjoyable and worthwhile-lowell can be great","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He kind of treats his students like little kids. He makes us greet him everyday at the beginning of class. He gives us actual class time to type up lab reports, which I've never seen any other teacher do before. He gives us worksheets before tests. All of this makes Physics Regular very easy for me.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"most of the time kinda boring but he does teach stuff and if u actually pay attention and ate ur breakfast u shud do well. He gives easy As and high B's also","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great Great teacher. Great Class (ap).","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"fun class, superb teacher, some of the tests are hard but there are so many ways to get a good grade. i love this class !","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His physics C class is surprisingly laid back. Teaches very well.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is a nice guy who will talk and compromise. he listens to the students opinions and takes them for consideration. But all the physics teachers are awesome!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"take this teacher: he makes physice class fun most of the time-a good grade shouldn't be a problem (I hope) if you do the work","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The class is generally fun even though you have to do lab writeups (but at least it's with a group that you get to choose) and you have to study for tests but Mr. Shapiro makes sure you know what to study. You really shouldn't get lower than a B. Overall a fun class and you feel like you learned something. Mr. Shapiro's a pretty cool teacher too.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a lot of us were worried about how hard the ap test would be but we got 4's and 5's the big news is now in engineering at cal, the physics class looks like it will be an easy A although most students here are struggling with it. mr. shapiro will work hard for you because he cares. but if you wait for the last second to learn everything, don't count on great results.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cool teacher, cool class","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"All around great teacher, great person. Cool too. You'll learn a lot and you'll love the class.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I was worried that I never really understood things very well - especially how to do the hard problems. Mr. Shapiro always had confidence in me. He propped me up and kept me from giving up. His class was usually interesting and enjoyable - sometimes it was exciting like when he vaporized soda cans or fired metal spikes into the wall. His lab was always a comfortable place to study, eat lunch, etc outside of class.I ended up getting two 5's on the ap test. Mr. Shapiro is a great teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro is such an amazing teacher. I'll never forget his class. It can be stressful worrying if you'll ever understand things but it all works out.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My all time favorite Lowell teacher. Awesome teacher and wonderful person. Definitely take his physics class.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took Mr. Shapiro for AP Seminar. He is incredibly kind and enthusiastic and cares so much for his students. However, he'd assign us projects and tell us to do something one minute and change it the next which made the class incredibly confusing. Overall the class is an easy A and Mr. Shapiro is amazing.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I just wish Mr. Shapiro would teach another class so I could take him again. He's awsome. I love him.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ap physics is a great class-hard material-just do your work and it's ok","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher-great class-i'm so glad i took his class-take his class-you won't regret it","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"absolutely the best teacher in the world-you'll do great on the ap test and get a good grade","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is one of my favorite teachers at Lowell. He is kind and funny. He actually helps you understand the material. His tests are easy because he gives you practice tests that count as extra credit or no credit at all and are exactly the same as the actual tests (well there are minor changes). He barely gives homework.  Labs are easy. He is cool to talk to. He really cares about his students and wants them to do well. I recommend taking him.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The best teacher, he is really good. i had him for reg physics 1 and i learned. Very easy b hard A BUT Physics is hard in general but he taught really well and i learned too much. lol. but i do recomend him and he gives practice test and let us do our labs in class. he rocks !","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"one of the kindest smartest all around best teachers in the world: he cares about you and your grade and really wants to see you do well and learn learn learn","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A, only if you get B's on tests and A on HW.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. shapiro rocks!!!!!!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Without a doubt the best teacher I ever had.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"kind, teaches well, wants you to succeed, enjoyable class, helps and encourages you to get a good grade","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"my favorite teacher-you can eat in class-you can come in any time of the day to work on labs(or even other subjects)-tests can be hard but the grading is ok- i'","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"another reason i love being at lowell","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You just can't go wrong taking Mr. Shapiro for physics. He's one of the teachers that makes Lowell so worthwhile.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro's a great teacher and is easily convinced into doing stuff like postponing tests and stuff. His class is relatively easy to get an A as long as you do homework and labs. You can still get an A if you get C's on the test. :)","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I really really loved my physics class!!!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Since literally half the class consists of uber Lowell nerds, you can't trust most of the above comments. Mr. Shapiro is far from the best teacher, but he is interesting, clear, and an easy grader. DON'T be fooled by his easy-going nature. The concepts are hard and you have to pay attention, read a bit, and understand all the hw. You can screw his tests and get an A in the class, so don't count on your grade as a reflection of your AP score.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I loved Mr. Shapiro's class: so will you. He keeps the lectrures interesting-especially when doing demos and having students come to do them (or at least help out). There are lots of labs and things to build like microphones and speakers. He's clear on what to write up and his labroom is always open to work on the assignments. Doing the writeups with partners is the only way to go. I will miss being in his class.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"definately my favorite teacher this year, maybe ever,mr. shapiro cares, his lectures are clear and have demos and stories mixed in,labs are fun,writeups are ok","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I wouldn't have survived ap physics without Mr. Shapiro. He's awsome and I actually ended up liking physics despite all the agony it caused me.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you're capable of really loving some of your classes, then you'll love Mr. Shapiro's physics class. I did and many of my friends did too!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST TEACHER I'VE EVER HAD !!!!!!!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For those students considering taking AP Physics with Mr. Shapiro, here's something to consider: I recently finished medical school and have had some great courses and teachers; I include Mr. Shapiro's AP Physics class among them.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr shapiro's class is one of those special things that makes lowell worthwhile","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro makes you feel good about trying to learn physics even when it's difficult for you. Sometimes he gives a practice test and if you spend time studying it then you will do great on the real test. Some of the test are very hard but you can still get a good grade if you do all the work-especially labs. Although sone of the labs are easy, the hard ones can be stressful, but Mr. Shapiro will give you as much help as you need. I love the class and I love Mr. Shapiro.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"not only can i eat in class but we actually do things that are fairly interesting in lab groups-hey,it's fun to do stuff with friends in class-lectures are ok,","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro is a really great AP Physics teacher. He cares about you and gives you many many chances to learn and complete work I could never have learned this","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For AP Physics, Mr. Shapiro tries very hard to teach the material and to make it enjoyable. The concepts are very hard. If you are not willing to STUDY, DO NOT TAKE THIS COURSE. Take Physics Honors.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I wish I could take Mr. Shapiro next year. You won't regret taking his class.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I loved his class: ap physics.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"take this class, you won't regret it-mr shapiro will help you-he makes sure you learn but you have to do the work-he helps you get a good grade-i love this clas","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of my all time favorite teachers period!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher. Not that much homework, always willing to help you.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"if you want to learn ap physics and love it, take this teacher","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Shap is a really nice guy.. although he may be a little boring at times, and his tests are challenging, even if you bomb them and do well on all your labs and homework, you're guaranteed an A!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher. He makes physics very enjoyable. Lots of extra credit. Tests can be challenging, but you will learn.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had him for regular physics n was the easiest A ever. lab writeups make up most of ur grade, but they're easy to do n he grades them leniantly. cool teacher; really involved with students, interesting demonstrations, but lectures can get boring.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"you can eat in class,the labs are fun and you get to split the work writing them up and mr shapiro keeps the lab open for you to work on them-he's nice,he's fair","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"one of the greatest teachers ever-tests are hard but he gives you a million chances to get an A, like group tests and going to physics movies-just do a good jr","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is an exciting and intelligent teacherSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I'm getting an A even though physics is hard. I'm learning soooo much. I love this class. I love Mr. Shapiro. He's awesome.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"my best teacher this year by far, he really makes class interesting most of the time-he's really nice, I feel like I'm learning something and grading seems ok","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"take this teacher he is one of the best things about lowell other teachers are always coming in to ask for stuff ihe's cool he's smart he understands","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's teaching style is amazing, he has interesting labs and demos. You will learn. His tests will kill you. But he is very open so go to him and ask questions. He is disorganized but explains very well. Class was interesting, i was giggling all the time.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tests aren't worth much and there are plenty of them -> big advantage on the AP without impossible grading. He is a decent lecturer and a nice guy, with the occational wacky lab. Overall a fun class.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i consider myself so lucky to have had mr. s for ap physics. he works hard for you but he sometimes worries too much. i got 2 5's and i loved his class","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro's class is always a comfortable place to be, even when the physics appears to get impossible. You're always welcome to drop into his lab and work on physics or anything else. Mr. Shapiro as well as other students are there to work with, get help from or commiserate with. The final exam was very hard but I think I'm starting to learn something. I'm still feeling anxious about the ap exam but taking this class was the right decision for me.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP Physics C. Often hard, often fun, never boring. Tests can be killer but most people get two 5s on the ap tests or at least 4s -suppossedly impossibly difficult class. No way. Mr. Shapiro is awesome. He knows his stuff. He cares. Labs are good. Demos are great.You'll feel good about yourself.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"PHYSICS HON - Very leniant on when you turn in you work (as long as you eventually turn it in). Makes learning physics fun and interactive.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Physics 2. He teaches when there is enough class time. I am learning despite the fact that I am math challenged.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i loved mr. shapiro's class although it's not always easy, it's not always fun, ....but i feel like i learned something and got a good grade for my efforts. i miss mr. shapiro","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome teacher - awesome class","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro knows so much and makes it exciting to learn physics. The labs are great in many ways-you use cooll stuff, actually learn and have fun with friends-","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome teacher! I fell behind and got all the help I needed to catch up with no grade penalty. The tests are hard- do all the work and you should get a good grade. I got 2 4s on the ap tests. Completely shocking to me!!!! I am sooooo grateful to Mr. Shapiro","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I thought that I would barely pass the mechanics AP test and definately NOT pass the electricity and magnetism test. I got a 5 and a 4. Although you'll worry about not being able to do the problems, Mr. Shapiro will insure that you learn it and you'll love at at the same time.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really really cool teacher really smart really helpful really kind------it's not always fun but i always like being in this class","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Amazing personality and a damn good teacherSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"moves too fast; doesn't explain all problems very well; hard if you don't understand what he presents the first time around","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"As long as you try, you'll end up with a B at least. I get A's on all the homework and labs but bomb the tests. Overall, a really good teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best, if not the best, Physics teachers. His labs are fun. On tests, he gives you the formulas and the practice test is very similar.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I received 5's on both ap teats despite the fact that the physics was killer hard. But the class is not killer hard; in fact it's often a lot of fun and sometimes exciting. Some tests make you doubt that you will succeed but Mr. Shapiro is always supportive and makes sure that you succeed.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i understand!! lots of experiments, and CANDY. he's super nice. he actually wants us to learn.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"my physics class is one of the things that makes lowell really worthwhile-i hope my classes in college are this good","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Since taking him for Seminar, I realize that teachers like him should be idolized. I am unworthy of his presence. Goodbye.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro is one the those rare teachers that makes all the agony that is common at Lowell totally worthwhile. If you take his ap class, just do the work and don't freak. He'll get you through it. You won't be sorry.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took him for Physics C. He's got an incredible personality - so kind, understanding, funny, friendly, and approachable. He's also damn smart and an excellent teacher. Prepared us well for the AP exam. An A is pretty doable if you work hard enough, but even if you don't think you can get an A, take his class! You learn so much, plus you get to bask in his godliness :DSubmitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Super nice teacher.Cool too. You feel like he's on your side. For ap you gotta work hard. Lectures are mostly pretty good. Demos are great. Most labs are interesting/fun but the writeups can be a pain unless your group enjoys working together. Enough of the clsses are really exciting to make the difficult work for ap totally worthwhile. This is a class you'll always remember.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"one of my three best classes/teachers at lowell","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro isn't very good at making physics concepts clear for most students. If you want to have a good time and get a good grade, take him. Just don't forget to turn in any hw.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro is one of those 2 or 3 teachers I'll never forget. I wasn't too confident about learning enough to do well on his tests (some were super hard but the group tests worked for me), but he gives plenty of opportunies to get an A. I worked hard, got an A. Mr. Shapiro is awesome.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro is one of the 2 or 3 teachers I will remember for the rest of my life.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I passed BOTH ap physics exams. It was because of Mr. Shapiro's hard work. He gets you to deal with really hard stuff and finally get it! Do great lab writeups and excred for a good grade.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very confusing lectures, moves too fast, but easy grader","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Do not listen to him during the first semester of AP Physics, but listen intently during the second. Trust me.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love this class I love mr shapiro tests are ok if you study what you're supposed to labs are great lab writeups are long and involved but can be fun when everyone works together","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro is always there for you, he cares about you, you really learn, you'll get a good grade-he's awesome-take his class.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Physics Regular. His class is chill. I never pay attention and always do other hw in his class. He doesn't notice. He basically just assigns outlines and we learn ourselves. He's nice and gives us alot of time to do labs in class. He gives practice tests like the real one. Overall, you do learn.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best teachers at Lowell. Really knows his stuff and really cares about his students. I learned to like myself better because I was in his class. Getting an A isn't easy. A decent effort will definitely pay off.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very interesting labs, ez teacher, confusing sumtymes","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really nice, really cool and really smart teacher-he makes ap interesting almost all the time-not too much work-hard but worth it-do the work,get a good grade","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"wow! I got 2 5s on the ap tests. I still can't believe it. this is a great teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I'll always be greatful to Mr. Shapiro for making ap physics a wonderful experience for me. He gets you to be more concerned with learning the material than with your grade. He's a great teacher. You can't go wrong taking his class.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"my favorite teacher so far. it's fun working with friends on labs and projects. tests are a mixed bag-learning what's on the practice tests make some tests easy, some tests are hard but lab and project grades can make up for some bad test grades","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easily my favorite teacher for making physics so fun and enjoyable.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro is by FAR the NICEST teacher/guy I have ever met. He is so nice, a great teacher, and really wants everyone to do their best. You may think you got a bad grade on his tests (based on the percentage), but he has his own way of grading, so you end up getting a better grade than you thought! Oh, and he gives out \"ipods\" as prizes...except it's realyl candy. He's great, take him if you get the chance (I have him for Physics and i love him)!!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"reg. physics--just do your homework, try a little on labs and study a little on tests. easy A-. And he's so sweet!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a truly great teacher but beware of too much work over vacation","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shapiro mixes his class up with activities, long and short labs, lots of student interaction, regular lectures, and him solving problems on the board. There are great demos too. Not an easy A but Mr. Shapiro's awesome.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the best best best physics teacher ever!!!!!! i didn't mind doing the work, mr. shapiro encourages you to enjoy doing physics and i learned how to do and write up the labs which turned out to be a good group activity. the tests could be a pain but i survived it all feeling good about myself. mr. shapiro, you're awesome!!!!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"TOTALLY TOTALLY AWESOME TEACHER!!!!!!COOL TOO!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher! great class! most of the classes there's something interesting going on like a tug of war where the girls beat the boys or being shot down the hall on a skateboard----don't mess up on the labs cause the tests are hard but grading's fine if you do good lab writeups","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"inspiring","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"in ap you might have difficulties understanding some of the physics and difficulty learning how to do physics problems; but a good job on labs plus hand in everything = good grade","rating":4.7,"version":1}],"rating":4.699999999999995}},"__N_SSG":true}