{"pageProps":{"teacher":{"name":"Robert Tran","departments":["Math"],"semesters":["Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Algebra 1","block":"2","semester":"Spring2016"},{"name":"Algebra 1","block":"4","semester":"Spring2016"},{"name":"Algebra 2","block":"6","semester":"Spring2016"},{"name":"Pre-Calculus","block":"1","semester":"Spring2016"},{"name":"Pre-Calculus","block":"3","semester":"Spring2016"},{"name":"Algebra 1","block":"7","semester":"Fall2016"},{"name":"Algebra 2","block":"2","semester":"Fall2016"},{"name":"Algebra 2","block":"4","semester":"Fall2016"},{"name":"Algebra 2","block":"6","semester":"Fall2016"},{"name":"Pre-Calculus","block":"1","semester":"Fall2016"},{"name":"Algebra 2","block":"2","semester":"Spring2017"},{"name":"Algebra 2","block":"4","semester":"Spring2017"},{"name":"Algebra 2","block":"6","semester":"Spring2017"},{"name":"Pre-Calculus","block":"1","semester":"Spring2017"},{"name":"Algebra 1","block":"1","semester":"Fall2017"},{"name":"Algebra 1","block":"7","semester":"Fall2017"},{"name":"Algebra 2","block":"2","semester":"Fall2017"},{"name":"Algebra 2","block":"4","semester":"Fall2017"},{"name":"Algebra 2","block":"6","semester":"Fall2017"},{"name":"Algebra 1","block":"1","semester":"Spring2018"},{"name":"Algebra 1","block":"7","semester":"Spring2018"},{"name":"Algebra 2","block":"2","semester":"Spring2018"},{"name":"Algebra 2","block":"4","semester":"Spring2018"},{"name":"Algebra 2","block":"6","semester":"Spring2018"},{"name":"Algebra 1","block":"5","semester":"Fall2018"},{"name":"Algebra 1","block":"7","semester":"Fall2018"},{"name":"Algebra 2","block":"2","semester":"Fall2018"},{"name":"Algebra 2","block":"6","semester":"Fall2018"},{"name":"Algebra 2","block":"8","semester":"Fall2018"},{"name":"Algebra 1","block":"5","semester":"Spring2019"},{"name":"Algebra 1","block":"7","semester":"Spring2019"},{"name":"Algebra 2","block":"2","semester":"Spring2019"},{"name":"Algebra 2","block":"6","semester":"Spring2019"},{"name":"Algebra 2","block":"8","semester":"Spring2019"},{"name":"Algebra 2","block":"3","semester":"Fall2019"},{"name":"Algebra 2","block":"7","semester":"Fall2019"},{"name":"Pre-Calculus","block":"2","semester":"Fall2019"},{"name":"Pre-Calculus","block":"4","semester":"Fall2019"},{"name":"Pre-Calculus","block":"8","semester":"Fall2019"},{"name":"Pre-Calculus","block":"2","semester":"Spring2020"},{"name":"Algebra 2","block":"3","semester":"Spring2020"},{"name":"Pre-Calculus","block":"4","semester":"Spring2020"},{"name":"Algebra 2","block":"7","semester":"Spring2020"},{"name":"Pre-Calculus","block":"8","semester":"Spring2020"},{"name":"Algebra 2","block":"6","semester":"Fall2020"},{"name":"Algebra 2","block":"7","semester":"Fall2020"},{"name":"Algebra 2 + Pre-Calculus","block":"1","semester":"Fall2020"},{"name":"Pre-Calculus","block":"3","semester":"Fall2020"},{"name":"Pre-Calculus","block":"5","semester":"Fall2020"},{"name":"Algebra 2","block":"6","semester":"Spring2021"},{"name":"Algebra 2","block":"7","semester":"Spring2021"},{"name":"Algebra 2 + Pre-Calculus","block":"1","semester":"Spring2021"},{"name":"Pre-Calculus","block":"3","semester":"Spring2021"},{"name":"Pre-Calculus","block":"5","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-06T09:50:40.250Z","text":"Only take him if you are pretty decent at math. Otherwise, don't think about it. You will struggle. He gives homework almost everyday, but it's graded upon completion, and not accuracy. Tests can make or break your grade, so be very careful, and study for them. He likes to see you struggle, and he really makes you talk to your tablemates(which you cannot choose). His teaching style is not one I like, but that is a personal opinion.","rating":3,"version":0},{"timestamp":"2020-05-01T23:37:28.841Z","text":"You have to be really good at showing work to have a decent time in this class. The tests can make or break your grade, so you have to make sure that you understand what he says. He usually leaves new concepts for the last few minutes of class, so it is important to self study to make sure that you are prepared for whatever he throws out next. He usually does a good job of preparing you for the next level of math that you will take, so if you want to learn in advance this is the class for you. You also spend the majority of every class going over a set of problems with your table group, so communication is key.","rating":4,"version":0},{"timestamp":"2019-05-28T06:29:32.902Z","text":"Classes are group work with tables going up to present at the end of class. Tests are a combination of homework problems and some hard problems that you should be able to get if you understand the underlying concepts.","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Tran is more into analytical problems (ex.derriving,defining formulas) than memorizing equations. Tests/quizzes are graded hard. He does not curve quizzes, even when the class average is very low. He will not drop your lowest test grade or allow you to raise a quiz grade with corrections. Pre cal is hard for me, and I'm struggling to get a B. The class is mostly group work. If you are good with math, you'll be fine, but if math is challenging for you, do not take Tran.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tran's class consists entirely of group work and presentations, so if you like that, his class will be great. When it comes to tests, he is nitpicky and will take off points for tiny mistakes/not showing work. Despite this, he provides every student with lots of opportunities to succeed. Every week and on every test there are extra credit problems and he let's you do test corrections if you get under 75%. He even gave me extra credit on my study guides which bumped my final grade up to an A.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tran is a really cool dude.He makes you really think and challenges you with hard problems and new concepts. He makes you do group work in class 9/10 times so if you wanna learn, you better have good people in your group. You just need to put in the effort and LISTEN TO THE LITTLE THINGS in class to get an A. His class is worthy enough to stay awake in and he's pretty chill with stuff. One time, I walked into his class and straight up ate a bowl of cereal and milk at my desk. He's good :PSubmitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tran definitely isnt an easy teacher, but he's probably one of the best math teachers ive had. His class is a lot of group work and his teachng style is really different from other teachers. He makes us derive and figure things out through other problems, instead of just sticking an equation in our faces. He's also really helpful & understanding when you need help or tutoring & he's willing to stay afterschool. Overall chill class, some lame jokes but hard tests and quizzes.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tran is an easy grader and is really easy to joke around with. In his class, I wasn't confused which was good.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's very strict in grading DOESNT curve. You could have the right answer on the test but he'll still mark you if he doesn't like the work you're showing. Doesn't teach at all like it's just group work that we never end up going over to see if it's right or wrong. I've had such a hard time in his class and his tutoring doesn't help at all. Hes THE type to like explainations rather than doing it quick work and getting the right answer. I've had so much stress and fear in his class. Don't take himSubmitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I enjoyed Mr.Tran's class. You do learn a lot about math, but he is more interested in deriving the answers as opposed to memorizing a formula. HOWEVER he does have a certain teaching style that mainly requires group work. I worked well in groups, so i enjoyed his class, but if you do not, definitely go for a teacher that is more lecture focused.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have him now for algebra 2. He barely teaches. The entire class is spent by doing problems with your table groups and then showing them on the board. Then he teaches/explains a new concept in the last 5 minutes of class and is like \"OK do an entire hw assignment on it!\" He does go over hw problems if you ask, and get full credit for completion. His tests are hard, and has lots of little rules that I think are ridiculous. Maybe only group work is fine for you. But I want a teacher that teaches.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the majority of his class involves group work on problems he makes himself. If you would rather learn in a lecture style, take another teacher. Hard grader. You need to self teach in order to understand most of the homework.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Tran is a pretty good teacher. He gives tests with a justified amount of difficulty, but is a pretty harsh grader. (Very knitpicky about showing good work) He focuses more about the details and specific steps of how to get an answer than formulas/the answers themselves. His course is based off of daily group work with the occasional lecture. I would only recommend him if you consider yourself a good math student, but I enjoyed his class. He’s very organized and grades tests overnight.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Tran is awesomeSubmitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I used to think he had good sides but as the semester went on he got ruder and ruder to the class as a whole. The class goes : walk in, group work on 5 HARD FREAKING PROBLEMS, present the problems on the board, he corrects your mistakes. Once a week he lectures for 5 min at the end of class, 30-45 min hw everyday. If u actually want to get teached u have to see him after school, and u need to see him to get an A (mayb ur an exception but even the smart ppl struggle). I just don't like the class.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr. Tran for Algebra 1 and although it was difficult to get an A, I learned a lot and I am totally prepared for Algebra 2. He does a lot of group work and presentations, but working in groups helped me learn a lot of topics I was unclear about. It is frustrating sometimes if you forget to do homework or if you miss one day, but overall I would recommend Mr. Tran. But do prepare for studying and actually working hard.Submitted by a student","rating":3.8,"version":1}],"rating":3.837499999999999}},"__N_SSG":true}