{"pageProps":{"teacher":{"name":"Robert Emerson","departments":["English"],"semesters":["Fall2014","Spring2015"],"classes":[{"name":"English 1","block":"2","semester":"Fall2014"},{"name":"English 1","block":"4","semester":"Fall2014"},{"name":"English 2","block":"1","semester":"Fall2014"},{"name":"English 2","block":"7","semester":"Fall2014"},{"name":"Expository Writing","block":"6","semester":"Fall2014"},{"name":"English 1","block":"3","semester":"Spring2015"},{"name":"English 1","block":"7","semester":"Spring2015"},{"name":"English 2","block":"4","semester":"Spring2015"},{"name":"English 2","block":"6","semester":"Spring2015"},{"name":"Expository Writing","block":"1","semester":"Spring2015"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's very sweet! Lets you eat, and he is pretty chill. He let me skip class for a make-up exam. Work hard on your first essays/assignments. Once he gives you your first grade that's pretty much the base of your grade and what he looks at when he grades your other papers in the future.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is AWESOME!!!!!!!!!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome teacher. best class. the easiest class.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had Mr. Emerson for Expos this semester and he was super laid-back. Essays = grades, but he's a easier grader compared to other English teachers. Watched movies almost everyday, but they were good.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had Emerson for 10th Grade English, and he's super chill, no workload, and like 3 essays? Tests aren't bad, and it's basically if you show up, you'll definitely get a B, but it's not hard to get an A.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Chillest English teacher ever. Took him for Eng1, my homework consisted of one essay every 3 weeks. And he isn't strict about the essays, either. They're mostly about your own experiences. Write a good story, and he'll give you an A-. Overall easiest, chillest teacher at Lowell.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty chill class. you have to be good at writing essays because that's what makes up your grade, easy B.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's chill and everything.. but when I got a 88 on my first essay...I didn't end up with an A. Just work hard on your first essay or else you're not going to be an A. Pretty boring still chill.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Got an 88 on the first essay. Bam. There goes my A.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very good teacher, easy and nice.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"once you get a B, you'll never be able to get an A in his class. Do not take him, worst english teacher at Lowell.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A-/B+. Just write well. Doesn't really teach but rely on yourself.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Emerson is a very relaxed guy, so the class is stress-free. If you can write well, it is basically an automatic A. Take advantage of his offers to edit your essays before you turn them in, taking his advice almost guarantees an A.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"We do nothing in class and have watched like 5 movies. I sit on my phone all day while we watch movies. He is a hard A,but an easy B.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy b SUPER HARD A","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Emerson is the greatest! I barely ever have work from him.. and its usually pretty easy. It's a very laid back class (10th grd eng 2). Although sometimes it can be pretty boring. If your looking for low amount of hw and pretty easy class.. TAKE HIM!!!!!!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Boring sometimes, but he's new, kids try to take control over him, by saying going to the library and leaving class, he's nice and helpful, you definitely learn, i had him for expo, easy A, but 90% is a B+ though, nice teacher, help, reccomended overall, and you learn SAT vocab!!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"don't really like him. though he assigns almost no homework, he makes you write about 2 essays and that's your grade for the quarter. Participation is a MUST in his class(you can ace everything, but still get a B cause you don't participate) Easy B, but put alot of effort if you want an A.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He has high expectations of Lowell students. Participate more, or write better essays.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For freshmen year, 9th grade English was an easy B, hard A. Not much work assigned and the class was pretty laidback. Participate to raise your grade!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Basically any effort=A, no effort (and i mean NO effort)=B. Favorite class of all time","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Emerson is a very sweet mature man. He's easy to get along with, and is understanding. Unlike other teachers that won't accept late work, he always does. With no problem. Take him if you want less stress!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"emerson is really a nice teacher who understands his students and tries to work with their shedules to not have something due when they hav a lot going on..compared to last semester and every1 sayin he is an easy A..he stepped up his game and its actually kinda really hard to get an A now!!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy Class. I have him for expo, and I have an A. I don't consider myself a really good writer either. Just make your essay unique, and have him read it before you turn it in. No tests, a lot of movies, and not too much essays. Don't get me started on his grace periods...","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"must focus on first few writing, that is the base to your grade, and once he gives you a grade, you can't improve it much.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is very nice, but he is not that hard on us like my teacher when I was in 7th grade. He gives hw about 3times a week, and mostly he teaches by dthe book. He let you have a grace period on essays.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MAKE SURE YOU DO WELL ON YOUR FIRST ESSAY! That is basically your grade for the rest of the semester. So, try to get at least an A-. But, he is very laid-back, you can turn in essays like weeks late.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a very cool teacher. Not a lot of tests or quizzes and you will never get lower than a C if you do the work.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's an easy A as long as you do the work and participate enough in class which for me is saying a lot, he's not exactly helpful since he doesn't teach enough that anyone would actually need help, he's really popular with our class since he's pretty nice, i've been assigned 3 2-page essays so far","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. contrary to the popular belief you actually do learn in his class. You have to want to learn to learn though. Extremely helpful, he will take time to go over your essay before you turn it in. Grace periods are amazing also. The class is very relaxed.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have him for 10th grade English. The highest grade I ever got on my paper was a 93%, which to me, is like an A in other classes. I spent around 9 hours writing that paper. Doesn't teach you how to write but is a really nice teacher. I bet the highest grade he ever gave was a 95%?","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class is so easy. He taught at Burton before and in general Lowell students are, well, at a higher level. Hardly any homework, and what you do get is easy. Easy A. But, I learned absolutely nothing in his class. I wouldn't take him again. Took him for Eng. 1.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"for expo. very nice and helpful with writing. however he can be boring!! he has extremely high expecations for lowell students, since he came from burton. one bad thing is that he counts 90% as a B+, but i got an A- in his class. you really learn a lot about writing. overall , recommended!","rating":3.8,"version":1}],"rating":3.799999999999998}},"__N_SSG":true}