{"pageProps":{"teacher":{"name":"Samantha Yu","departments":["English"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"English 2","block":"1","semester":"Fall2014"},{"name":"English 2","block":"3","semester":"Fall2014"},{"name":"Journalism 2","block":"8","semester":"Fall2014"},{"name":"Literature and Psychology","block":"4","semester":"Fall2014"},{"name":"Literature and Psychology","block":"6","semester":"Fall2014"},{"name":"English 2","block":"1","semester":"Spring2015"},{"name":"English 2","block":"4","semester":"Spring2015"},{"name":"English 2","block":"5","semester":"Spring2015"},{"name":"Expository Writing","block":"2","semester":"Spring2015"},{"name":"Expository Writing","block":"6","semester":"Spring2015"},{"name":"Journalism 1","block":"2","semester":"Spring2015"},{"name":"Journalism 1","block":"6","semester":"Spring2015"},{"name":"English 2","block":"2","semester":"Fall2015"},{"name":"English 2","block":"8","semester":"Fall2015"},{"name":"English 2 Honors","block":"4","semester":"Fall2015"},{"name":"Literature and Psychology","block":"5","semester":"Fall2015"},{"name":"Literature and Psychology","block":"7","semester":"Fall2015"},{"name":"English 1","block":"4","semester":"Spring2016"},{"name":"English 1","block":"8","semester":"Spring2016"},{"name":"English 2 Honors","block":"3","semester":"Spring2016"},{"name":"Science Fiction and Fantasy","block":"2","semester":"Spring2016"},{"name":"Science Fiction and Fantasy","block":"6","semester":"Spring2016"},{"name":"English 2 Honors","block":"2","semester":"Fall2016"},{"name":"English 2 Honors","block":"6","semester":"Fall2016"},{"name":"Literature and Psychology","block":"1","semester":"Fall2016"},{"name":"Literature and Psychology","block":"5","semester":"Fall2016"},{"name":"Literature and Psychology","block":"7","semester":"Fall2016"},{"name":"English 2 Honors","block":"1","semester":"Spring2017"},{"name":"English 2 Honors","block":"7","semester":"Spring2017"},{"name":"Science Fiction and Fantasy","block":"2","semester":"Spring2017"},{"name":"Science Fiction and Fantasy","block":"4","semester":"Spring2017"},{"name":"Science Fiction and Fantasy","block":"6","semester":"Spring2017"},{"name":"English 1","block":"8","semester":"Fall2017"},{"name":"English 2 Honors","block":"3","semester":"Fall2017"},{"name":"English 2 Honors","block":"7","semester":"Fall2017"},{"name":"Literature and Psychology","block":"4","semester":"Fall2017"},{"name":"Literature and Psychology","block":"6","semester":"Fall2017"},{"name":"English 1","block":"8","semester":"Spring2018"},{"name":"English 2","block":"3","semester":"Spring2018"},{"name":"English 2","block":"7","semester":"Spring2018"},{"name":"Literature and Philosophy","block":"4","semester":"Spring2018"},{"name":"Literature and Philosophy","block":"6","semester":"Spring2018"},{"name":"Literature and Psychology","block":"3","semester":"Fall2018"},{"name":"Literature and Psychology","block":"4","semester":"Fall2018"},{"name":"Literature and Psychology","block":"6","semester":"Fall2018"},{"name":"Media Arts - TV Lowell Video Production","block":"8","semester":"Fall2018"},{"name":"Literature and Philosophy","block":"3","semester":"Spring2019"},{"name":"Literature and Philosophy","block":"4","semester":"Spring2019"},{"name":"Literature and Philosophy","block":"6","semester":"Spring2019"},{"name":"Media Arts","block":"8","semester":"Spring2019"},{"name":"English 2","block":"4","semester":"Fall2019"},{"name":"English 2","block":"2","semester":"Fall2019"},{"name":"English 2","block":"6","semester":"Fall2019"},{"name":"Literature and Psychology","block":"1","semester":"Fall2019"},{"name":"Literature and Psychology","block":"7","semester":"Fall2019"},{"name":"English 2","block":"1","semester":"Spring2020"},{"name":"Literature and Philosophy","block":"2","semester":"Spring2020"},{"name":"Literature and Philosophy","block":"4","semester":"Spring2020"},{"name":"English 2","block":"6","semester":"Spring2020"},{"name":"Literature and Philosophy","block":"7","semester":"Spring2020"},{"name":"English 2","block":"2","semester":"Fall2020"},{"name":"English 2","block":"4","semester":"Fall2020"},{"name":"English 2","block":"6","semester":"Fall2020"},{"name":"Literature and Psychology","block":"1","semester":"Fall2020"},{"name":"Literature and Psychology","block":"7","semester":"Fall2020"},{"name":"English 2","block":"6","semester":"Spring2021"},{"name":"Film as Literature","block":"2","semester":"Spring2021"},{"name":"Film as Literature","block":"4","semester":"Spring2021"},{"name":"Literature and Philosophy","block":"1","semester":"Spring2021"},{"name":"Literature and Philosophy","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-06T17:51:57.833Z","text":"She makes a lot of bold comments but will contradict herself if you have any evidence supporting another opinion. She’s always talking about how as teenagers we aren’t developed enough to understand a text, and then will explain the thing I was literally just thinking. If you analyze a text differently than her she will tell you you’re wrong. Overall a very weird experience, but not a hard class if you’re just looking for a good grade. ","rating":1,"version":0},{"timestamp":"2020-05-06T17:49:52.968Z","text":"She is the most confusing English teacher I have ever had. The only teacher I've seen who will tell a student they are wrong, and that there is only one answer when analyzing a text. She makes a lot of weird comments about how kids aren't smart enough to understand complex concepts despite the fact that everything we talk about in her class I have heard a thousand times. She goes on these long rants about \"life\" that are nowhere near the topic of our class discussions. She also blatantly tries to enforce her ideas and beliefs on her students.  ","rating":1,"version":0},{"timestamp":"2020-05-01T23:53:07.154Z","text":"Her teaching style and difficulty varies every semester, but usually she is very nice and a decent grader. She makes sure that you actually learn stuff about English, and can make the whole class laugh. She will usually assign two essays that gives you a lot of advice on how to improve your writing, and she will most likely help you with writing college applications. She can be a slow grader sometimes, but she is usually a low amount of stress with the little amount of work that she gives.","rating":5,"version":0},{"timestamp":"2019-12-13T17:01:13.642Z","text":"really good fun class and stuff take her lolololol","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for my freshman English 2 class, and she was great! She knew how to explain things clearly and you could fool around in class (unless we were in a discussion). She laughs at students' jokes and gives helpful feedback. She really dislikes people who don't pay attention and likes it when students participate (15% of the grade).She preps you for major assignments and gives manageable homework. On our final essay, she gave us a week in class to write it up. She's an awesome teacher.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Omg she's the best best best teacher ever!!!!!!!!!!!!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Yu is pretty awesome. I had her for English honors and I learned a lot from her. Our grade only consisted of 2 essays and like 2 little quizzes. She says and seems like a harsh grader, but she really isn't as long as you got the basics. Everything is on the computer.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Yu is a pretty chill English teacher. She's really nice. You barely have to do any work in her class (literally no homework EVER). Unfortunately, this means you're not going to learn a lot about essay writing and critical reading. Only take her class if you want to get by, but if you want to become better in English, take a different teacher.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I've had Ms. Yu for 3 different classes throughout my Lowell years. The first time I had her was freshman year and I barely knew the structure of an essay. She taught us how to write a good essay and how to really analyze a book. Because of her, I know how to write a much better essay. She is also very willing to help you out if you ask her for it. She is a very dedicated teacher and I'm glad I had her so often during my high school career. Definitely take her if you can!Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very knowledgeable, digs beyond basic surface analysis. Engaging, entertaining, always willing to help. Super fun class. Don't procrastinate and make sure to put in lots of effort for written assignments, they'll swing your grade!Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I FREAKEN LOVE MS YU. She can really vonnect with her studentd and is one of the best teachers I've had in my highschool career. The fact that she assigns few, yet meaningful essays says that she is a clever woman, capable of introducing material without overwhelming students with mountains of workload.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Yu is definitely one of the more knowledgeable teachers. She talks a lot, and you're constantly taking notes on Chrome Books. If you're a fast typer and a creative thinker, you're going to love her class! Class discussions are always engaging, and she knows what she's talking about. She'll teach you to analyze context so that you'll understand the concept more. If you're stuck with something, she'll help you and give tips on how to improve.Great teacher!Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"We only had to write 2 essays in the entire semester, and no final will be given. Very good at teaching you how to analyze quotes. She really helped me on writing a lot. Shes also very very nice!","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Yu is the best! She is sooo nice, especially when you ask her for help outside of class. She's always willing to help her students out, and as long as she sees improvement and effort in your work, you can never get a low grade. I would take her over any other English teacher at Lowell.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Yu is an awesome teacher. This semester we got to watch Romeo and Juliet (while many other classes read it instead). She is always willing to help and really knows what she is talking about. We use chromebooks to take notes and she displays her lesson on a google doc that we are all on. We only did two essays and she gives you lots of time to write them. She has various methods for improving your writing that really work. She grades by improvement and gives very little homework. Take Ms. Yu!Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a good teacher, and at least in my year we got to use laptops to do all our work on. Some people just looked at memes all day, but if you actually pay attention you can learn a lot about how to analyze text. Also, we get to do fun things sometimes like play mafia or watch video, etc.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"In all honesty, she was an okay teacher but not a very nice person. I write this angry review because she was upsetting, rude, and just plain mean to me. If you take her, I hope you don't have to go through what I did.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Amazing teacher. Extremely helpful and thorough with her lessons. When you need help, she will not hesitate to aid you. 10/10 would take again.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Yu is really great! She has can have a really fun personality, especially if the class is into it. Sometimes it can be hard to keep up during her class because of how complex some of it is, but she tries to break it down for you. If you don't understand something definitely ask her 1-on-1 because she clarifies much better there.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took her for English 2. Contrary to the negative reviews below, Ms. Yu is one of the few teachers who actually care and will help when asked. Teaching style is unusual due to the heavy use of laptops, but will improve one's tech skills. There were few quizzes, and she really helps with essay writing. Class was also significantly less stressful than others due to the few essays (only 2) and is graded on self-IMPROVEMENT. Class was overall enjoyable and fun watching Steven Crowder #ChangeMyMindSubmitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"All notes taken on Chromebooks. If you're a slow typer, good luck. Great personality and knows what she's teaching.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Yu is a great English teacher. She is a hard grader on essays but she really teaches you all the components of essay writing; your essay skills will increase immensely if you take her. Her class has a huge emphasis on writing, so if you'd prefer a more discussion-based English class she may not be the best for you. She does do discussions, but not as often. Overall a great English class.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THE BEST english teacher I’ve taken at Lowell. She taught all the basic components to writing essays & actually helped everyone improve. She’s down to help everyone with their essays & also gave us a whole lot of weeks to write our first essay. We were a bit rushed for the second essay (our final), but we still had days to work on it. Quizzes were a breeze, definitely reccomend taking her class. She’s funny & extremely helpful. ps don’t be like me lol give yourself an A during self-assessment.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AMAZING TEACHER! By far one my favorites! She's very relatable as she attended Lowell herself and she is super young. She is so nice and incredibly knowledgeable. She runs out quickly during arena, but if you get her you are in luck! Miss.Yu rocks!Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you are reluctant on taking Ms. Yu because you read a few negative reviews below, don't be! She's one of the best English teachers I've had. Learned a lot about how to write good essays and how to analyze the text better. Her class is laptop based, so it's tempting to go on MySpace or whatever. She's also a really chill teacher since she's young and went to Lowell before, so she understands your struggle. Had a lot of fun talking about other random topics too. Take her!Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MS YU IS THE BEST. I love how she teaches and how we use computers everyday to take notes. When we have to write an essay, she prepares us so much that it's hard to get less than a B+. If you need help, she will take the time to help you. She is by far the best English teacher I've ever had.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Yu is a hard grader on essays and they are worth 80% of your final grade. But she always try her best to help the students out.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the most you do is 3 essays in 1 semester. usually no hw. very chill and nice. helpful,","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take Ms. Yu, she is an amazing teacher and really knows her stuff. In her class I have learned so much about essay writing. If you want an english teacher who will actually teach you about becoming a better writer take her classSubmitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She treats students unfairly. Very knowledgeable but she talks so fast. You can never keep up with her. Grade is mainly based on whether she likes you or not. Her class is teaching lies.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"There isn't much homework, basically no tests, and overall the class is pretty easy. However, if you want to actually learn do not take her. We wrote an essay on Romeo and Juliet despite barely reading the book. Instead we watched the movie and were expected to write an essay on it. She has not finished grading the essays and theres a week left of school. She rants a lot about random things and most of the time she contradicts herself and her facts are incorrect.Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Pretty low-stress class, two essays all semester, easy to get along with- basically the dream English teacher. She can take a joke and make them too. We spent 20 minutes one day discussing the \"Laurel/Yanny\" audio. Take her!Submitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Yu is a semi-hard teacher and she rarely have tests (10th grade english). She also makes you do a lot of \"tie it back to the theme, and find textural evidence\" essays. At first I thought she was an impossible A but if you read the text from the book carefully, you can get a low A.","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best teacher ever, super helpful]easy aSubmitted by a student","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy A for me :o","rating":4.2,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms yu's class was a massive waste of my time. if you are looking for a class in which you do absolutely nothing take her for english 2. we wrote one essay in march and by the end of may she had only graded 11 people's essays. (class of 33) on the monday before final's week she assigned more work than we'd done the whole semester combined. we didn't have homework the whole semester so that was definitely nice but i had so much to do during finals week when I didn't have time to.Submitted by a student","rating":4.2,"version":1}],"rating":4.066666666666666}},"__N_SSG":true}