{"pageProps":{"teacher":{"name":"Samuel Williams","departments":["English"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"English 1","block":"2","semester":"Fall2014"},{"name":"English 1","block":"3","semester":"Fall2014"},{"name":"English 1","block":"6","semester":"Fall2014"},{"name":"English 1","block":"8","semester":"Fall2014"},{"name":"Journalism 2","block":"7","semester":"Fall2014"},{"name":"English 1","block":"2","semester":"Spring2015"},{"name":"English 1","block":"4","semester":"Spring2015"},{"name":"English 1","block":"6","semester":"Spring2015"},{"name":"Journalism 2","block":"7","semester":"Spring2015"},{"name":"Journalism 2","block":"8","semester":"Spring2015"},{"name":"English 1","block":"2","semester":"Fall2015"},{"name":"English 1","block":"4","semester":"Fall2015"},{"name":"Journalism 1","block":"6","semester":"Fall2015"},{"name":"Journalism 2","block":"7","semester":"Fall2015"},{"name":"Journalism 2","block":"8","semester":"Fall2015"},{"name":"Expository Writing","block":"2","semester":"Spring2016"},{"name":"Expository Writing","block":"4","semester":"Spring2016"},{"name":"Expository Writing","block":"6","semester":"Spring2016"},{"name":"Journalism 1","block":"2","semester":"Spring2016"},{"name":"Journalism 1","block":"4","semester":"Spring2016"},{"name":"Journalism 1","block":"6","semester":"Spring2016"},{"name":"Journalism 2","block":"7","semester":"Spring2016"},{"name":"Journalism 2","block":"8","semester":"Spring2016"},{"name":"Expository Writing","block":"2","semester":"Fall2016"},{"name":"Expository Writing","block":"4","semester":"Fall2016"},{"name":"Expository Writing","block":"6","semester":"Fall2016"},{"name":"Journalism 1","block":"2","semester":"Fall2016"},{"name":"Journalism 1","block":"4","semester":"Fall2016"},{"name":"Journalism 1","block":"6","semester":"Fall2016"},{"name":"Journalism 2","block":"7","semester":"Fall2016"},{"name":"Journalism 2","block":"8","semester":"Fall2016"},{"name":"Expository Writing","block":"2","semester":"Spring2017"},{"name":"Expository Writing","block":"4","semester":"Spring2017"},{"name":"Journalism 1","block":"2","semester":"Spring2017"},{"name":"Journalism 1","block":"4","semester":"Spring2017"},{"name":"Journalism 1","block":"6","semester":"Spring2017"},{"name":"Journalism 2","block":"7","semester":"Spring2017"},{"name":"Journalism 2","block":"8","semester":"Spring2017"},{"name":"English 1","block":"1","semester":"Fall2018"},{"name":"English 1","block":"4","semester":"Fall2018"},{"name":"English 1","block":"5","semester":"Fall2018"},{"name":"Critical Writing","block":"3","semester":"Fall2018"},{"name":"Critical Writing","block":"7","semester":"Fall2018"},{"name":"English 1","block":"1","semester":"Spring2019"},{"name":"English 1","block":"4","semester":"Spring2019"},{"name":"English 1","block":"5","semester":"Spring2019"},{"name":"Critical Writing","block":"3","semester":"Spring2019"},{"name":"Critical Writing","block":"7","semester":"Spring2019"},{"name":"Critical Writing","block":"1","semester":"Fall2019"},{"name":"Critical Writing","block":"7","semester":"Fall2019"},{"name":"English 1","block":"2","semester":"Fall2019"},{"name":"English 1","block":"5","semester":"Fall2019"},{"name":"English 1","block":"5","semester":"Fall2019"},{"name":"Critical Writing","block":"1","semester":"Spring2020"},{"name":"English 1","block":"2","semester":"Spring2020"},{"name":"English 1","block":"5","semester":"Spring2020"},{"name":"English 1","block":"6","semester":"Spring2020"},{"name":"Critical Writing","block":"7","semester":"Spring2020"},{"name":"Critical Writing","block":"1","semester":"Fall2020"},{"name":"Critical Writing","block":"5","semester":"Fall2020"},{"name":"Critical Writing","block":"1","semester":"Spring2021"},{"name":"Critical Writing","block":"5","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-05T11:22:51.236Z","text":"I’m sorry but Mr. Williams is an okay teacher. It’s different for everyone but I have to say the hardest you try the worst grade he’ll give you. This has happened to me multiple times in all of his essays/ quizzes. Overall he’s a good teacher. I just don’t like the way he grades essays and gives you harsh feedback.","rating":2,"version":0},{"timestamp":"2020-05-02T15:52:23.326Z","text":"Had him for freshman English. He is awkward at times but really does explain themes in depth with examples and if you listen you'll have a good shot at an A/high B on the test. Easygoing, slightly amusing in the way he composes himself, very knowledgeable about etymology and mythology. Participate in the class discussions and he'll get to know you and you'll learn. Very approachable for questions or feedback outside of class time if you want to improve your writing. Little homework, just study questions that he doesn't care if it's on time but rather you understand the material, quizzes based on the questions, about 2 big in-class essay tests per semester.","rating":5,"version":0},{"timestamp":"2020-04-20T07:32:27.141Z","text":"very hard to stay awake in his class but has a great sense of humor. essays are very harshly graded at least from my experience. all you do is copy his notes. 08/10 personality, 03/10 for his ways of teaching","rating":3,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Boring class. He talks too much. just says the same thing over and over and over again but in different words.take him if you can sleep with your eyes open.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pls help me. he has me in his basementSubmitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For his tests, he makes you write essays without the text or anything. Most people get a B. Good luck.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Sorry to say it, but I find myself counting down the minutes until class is over and I usually like going to my classes. I'm sure there are those few people who can put up with absolutely anything and they'll be able to deal with this class. But there is no way I'm signing up for him again.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes really nice and hes almost like a kid himself. also really funny","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tough for English but I've heard that he's great for JournalismSubmitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I heard he was a nice Latin teacher, but I had him for English 1B. Unless you have a very big interest in philosophical stuff, you can take him. Otherwise he's really boring. I always see people falling asleep in his class and using their cell phones. I found him not very helpful. Also, taking notes in his class is almost impossible because he has really bad handwriting. He has a really hard grading scale too. I don't recommending taking him, but if you want a really hard challenge you can...","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty cool hes like a kid but hes really nice and funny","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"why doesn't he teach latin again? just cause nogara doesn't like him for being a better teacher? i learned so much more from williams in latin 2 even tho he was boring.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him in my sophomore yr. He gave pretty easy h/w assignments, but for some reason, he really enjoys giving B+'s for h/w, and B-'s for essays. However, if he offers EC, such as watching a play, definitely do it b/c it raised my grade from a B+ to an A- in the 3rd quarter, and an A for semester.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy teacher, in my opinion. but his lectures are really boring. Easy B.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He giggles too much at lame jokes lol. Also his handwriting looks like squiggly lines lolSubmitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"yay im the first to give him a rating. ok williams is an ok latin teacher. he explains things kinda thru repitition. but i learned a lot. he rushed when hes behind nogaras class though. tests completely on tests and maybe the cultual presentation. little more than average hw and hes a little boring but hes an okay teacher. :1 hes kinda a newbie so he kinda copies dr nogara","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i am one that does not care if i am bored out of my mind for forty minutes every day. so, i liked the class. stutters, boring, too nice becuse people take advantage of him. automatic B, just make sure to take notes and EVERYTHING he says, because on tests, even if you get the answer correct, he docks points because you didn't put EVERYTHINGGG that he said.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's pretty easy. His class gets kinda boring. He's rather strange looking but he's cool.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class is pretty easy, but you don't learn very much. He put in very few assignments for the whole semester, which can be very worrisome if you didn't do well on just a couple assignments. He doesn't seem to have a rubric for grading essays. His lectures are boring and not at all engaging. We had a mythology quiz, which didn't seem very relevant as we were studying English 1B. He also tends to pick on certain people.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i have mr williams for journalism and he is so funny! he helps you with your stories and gives you advice on what you should do. too bad hes not going to do journalism anymore","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Boring!! he is a nice teacher but very boring, helped me a lots on my writing skill but not a easy grader though.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a nice guy, but not so great as a teacher. His class is so boring that it always puts me to sleep and English was always my favorite subject before. He's new, but that's not much of an excuse. Just wait and give him a year and he'll be up there with the best of the teachers at this school. For now... Hold off on taking him unless you have a high tolerance for boredom.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Compared to Daffner/Gest, how hard is he??? Please help, i have him now and i have my first in class essay this week after not writing real essays in 5 semesters and pulling off As in Gest and Daffner. Thanks !","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"never got an A, only B's. It's ok, the only good english teacher would be Mr. hereford!","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Williams asked us to give him bad reviews so he would have a smaller class next semester, so here you go!Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BORING. don't bother buying CDs of lullabies, just record him and play is right before you sleep, i guarantee that you don't finish one lecture by the end of the YEAR. VERY little hw tho. XD","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"well actually he might teach latin again cause nogara is retiring and he is one of the the few teachers who know latin (drain knows latin...) i hope hes the teach becuase he is nice and easier than nogara","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is pretty nice, but your grade is pretty much an in class essay you do by memory. Could be clearer, but you learn how to write an essay in 45 minutes.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"To put it lightly i would rather eat 5 bowls of rusty nails than listen to his nonsensical blabbering in class one more time. Plus he looks like a stick figure made love to a bowl of cottage cheese and that child then fell into a hairball.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"explains lessons well, happy to help, and gives average to little hw. tests are easy, just study and know your stuff, like any other language. grades are based on tests only, but their easy so its ok. no hw points but do it because sometimes he checks and hw helps you study. without it you'll do bad","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Williams can be described as Awkward and boring to listen to, but after having my fall semester in his 6 Block, I realized that he cares about us, even if he might not show it. It's true that people might fall asleep, but it's not because of the lectures he gives, but bcuz of the roomtem! His lectures are really meaningful, but my peers didn't put enough time to notice. He understands tht we all write different, and Grades Fairly. he rarely gives A, but he gives more Bs, (if u put the work in)","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I got a B for a final grade, his class wasn't easy or hard, somewhere in the middle but you should take notes for tests and listen very carefully during class discussions.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Williams is my spirit animal. I had him for journalism and he was great I heard that many people don't like him for normal English though. He is very knowledgable and passionate for journalism, and surprisingly funny. He takes a lot of time checking the articles and making sure everything is correct and the best it can be. I learned a lot about journalism and writing from him. The students in the class and him being so chill made journalism one of my fondest high school memories.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class is boring and some of the stuff we read are confusing most of the time because you have to figure out what the words mean, of course it's Shakespear. His lectures and the stuff he writes on the board to write on our notes helps, mostly the lecture, those you totally need to pay attention on. IF U DUN, YOU'LL FAIL! If you are a sudoku lover, I highly recommend to not do any in his class. DONT FALL ASLEEP EITHER.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Williams is really smart, but he's not a great teacher for English. It's hard not to fall asleep in his class when all he does is lecture. Most of his lectures actually contain interesting stuff, but the way he explains it makes it really boring. He does prove himself to be very intelligent, it's just that he's not good at getting things into your head very well. It's extremely rare to see an A in his class, but if you put in effort you can earn a B. He'd be a better philosopher than teacher","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for my 9th grade english 1 class. He was prolly the most BORING teacher Ive ever had. I could not help it but I literally slept in his class numerous times and I dont think I ever got caught. Being in the t's in the afternoon did nto help either. Very easy B cuz I put very lil effort in his class. You have to work to get an A. Easy, but extremely boring.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"booooring. he's not particularly good, though he's not horrible. sometimes i'd prefer him to Dr. Nogara, but dr. nogara's more interesting","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is soooooooo boring. take him for english IF u dont mind being bored outa ur mind. he doesnt give much hw and his tests are alright. his class is like an auto-B if u dont try. A if u put some effort","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Williams has an interesting style of teaching, and he's very helpful and forgiving about missing work (we usually just show that we did work. Our whole grade is tests). He's humorous, and sometimes gets philosophical and relates Latin to things happening today.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lemme just tell you, I love Mr. William's class. It is easy and interesting, and you can get away with not doing much. Also he is pretty damn fit.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SOOO BORING !but if you write some OK essays and do your HW ( which isn't that much anyway) Yo can pull off a easy B do a lill more u get an A... if you survive the boredom...","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for American Lit. people found him boring. I thought the class was cool. People didn't listen in class. Or they didn't participate that much. They got easy As by listening in class. I think.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mrwilliams is the best! very knowledgeable about pretty much EVERYTHING, i can ask him about anything and he can tell you some really good stuff about it. clear latin teacher, and i heard he's teaching 10th grade eng nextyear? if anything is unclear to you, he explains it well.very funny, like a kid himself. very understanding. great guy.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's very straightforward in class discussion so it's almost implausible as why the class would be hard. he raises his eyebrows a lot when he looks down at his podium. on rare occasions he tries to be clever-funny, but it's him that is amusing because hes usually very awkward. as soon i see him in the hallway i yell \"HI MR. WILLIAMS!\" which breaks the ice and he always returns a seemingly reluctant 'hello'. if you go to class lighthearted, you won't mind his \"professional\" facade.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"well he is a nice guy but sometimes his class can become reptitive and monotonous. basically all you do is 1) textbook. 2) tests. 3) textbook.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Williams might be the best I've ever had. He is really big and does his best to make sure you are completely satisfied before finishing. His class is cool too.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For Epic and Myth, Williams doesn't have you write much. Not boring in my opinion. Little to no hw. Easy B","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is an extremely knowledgeable and fair teacher. He likes to keep his class interesting and is very accessible to students. He is lax, but you still have to put effort in to get a good grade. Anyone in his class will learn much more than simply the subject matter.","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Williams is as easy as a freshmen English teacher can be. Class can be boring sometimes, we mainly sat around and shared our ideas about a particular piece we were reading. Luckily, prepping on my own time for essays earned me an A. I didn't learn much as how to improve my writing, but at least I got by with little stress and in the meantime found a better English teacher to take in the following semester.Submitted by a student","rating":3.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he`s a pretty good teacher but his class is boring. & his tests r always essay questions. not an easy grader. he doesnt assign much homework tho, mostly reading.","rating":3.7,"version":1}],"rating":3.6779999999999977}},"__N_SSG":true}