{"pageProps":{"teacher":{"name":"Sascha Taylor-Ray","departments":["Physical Education"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"PE 1","block":"3","semester":"Fall2014"},{"name":"PE 1","block":"7","semester":"Fall2014"},{"name":"PE 2","block":"1","semester":"Fall2014"},{"name":"PE 2","block":"2","semester":"Fall2014"},{"name":"PE 2","block":"6","semester":"Fall2014"},{"name":"Weight Training","block":"6","semester":"Fall2014"},{"name":"PE 1","block":"3","semester":"Spring2015"},{"name":"PE 1","block":"5","semester":"Spring2015"},{"name":"PE 2","block":"1","semester":"Spring2015"},{"name":"PE 2","block":"2","semester":"Spring2015"},{"name":"Weight Training","block":"6","semester":"Spring2015"},{"name":"PE 1","block":"3","semester":"Fall2015"},{"name":"PE 1","block":"7","semester":"Fall2015"},{"name":"PE 2","block":"1","semester":"Fall2015"},{"name":"PE 2","block":"2","semester":"Fall2015"},{"name":"Weight Training","block":"6","semester":"Fall2015"},{"name":"PE 1","block":"3","semester":"Spring2016"},{"name":"PE 1","block":"5","semester":"Spring2016"},{"name":"PE 2","block":"1","semester":"Spring2016"},{"name":"PE 2","block":"2","semester":"Spring2016"},{"name":"Weight Training","block":"6","semester":"Spring2016"},{"name":"PE 1","block":"3","semester":"Fall2016"},{"name":"PE 1","block":"7","semester":"Fall2016"},{"name":"PE 2","block":"1","semester":"Fall2016"},{"name":"PE 2","block":"2","semester":"Fall2016"},{"name":"Weight Training","block":"6","semester":"Fall2016"},{"name":"PE 2","block":"1","semester":"Spring2017"},{"name":"PE 2","block":"2","semester":"Spring2017"},{"name":"Weight Training","block":"6","semester":"Spring2017"},{"name":"PE 1","block":"5","semester":"Fall2017"},{"name":"PE 2","block":"1","semester":"Fall2017"},{"name":"PE 2","block":"2","semester":"Fall2017"},{"name":"PE 2","block":"3","semester":"Fall2017"},{"name":"Weight Training","block":"6","semester":"Fall2017"},{"name":"PE 1","block":"5","semester":"Spring2018"},{"name":"PE 2","block":"1","semester":"Spring2018"},{"name":"PE 2","block":"2","semester":"Spring2018"},{"name":"PE 2","block":"3","semester":"Spring2018"},{"name":"Weight Training","block":"6","semester":"Spring2018"},{"name":"PE 1","block":"5","semester":"Fall2018"},{"name":"PE 2","block":"1","semester":"Fall2018"},{"name":"PE 2","block":"2","semester":"Fall2018"},{"name":"PE 2","block":"3","semester":"Fall2018"},{"name":"Weight Training","block":"6","semester":"Fall2018"},{"name":"PE 1","block":"5","semester":"Spring2019"},{"name":"PE 2","block":"1","semester":"Spring2019"},{"name":"PE 2","block":"2","semester":"Spring2019"},{"name":"PE 2","block":"3","semester":"Spring2019"},{"name":"Weight Training","block":"6","semester":"Spring2019"},{"name":"PE 1","block":"5","semester":"Fall2019"},{"name":"PE 2","block":"1","semester":"Fall2019"},{"name":"PE 2","block":"3","semester":"Fall2019"},{"name":"Weight Training","block":"6","semester":"Fall2019"},{"name":"PE 2","block":"1","semester":"Spring2020"},{"name":"PE 2","block":"2","semester":"Spring2020"},{"name":"PE 2","block":"3","semester":"Spring2020"},{"name":"PE 1","block":"5","semester":"Spring2020"},{"name":"Weight Training","block":"6","semester":"Spring2020"},{"name":"PE 2","block":"1","semester":"Fall2020"},{"name":"PE 2","block":"2","semester":"Fall2020"},{"name":"PE 2","block":"3","semester":"Fall2020"},{"name":"Weight Training","block":"6","semester":"Fall2020"},{"name":"Weight Training","block":"6","semester":"Fall2020"},{"name":"PE 2","block":"1","semester":"Spring2021"},{"name":"PE 2","block":"2","semester":"Spring2021"},{"name":"PE 2","block":"3","semester":"Spring2021"},{"name":"Weight Training","block":"6","semester":"Spring2021"},{"name":"Weight Training","block":"6","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-05T22:11:07.490Z","text":"MS.T-RAY IS THE BEST PE TEACHER YOU WILL EVER HAVE. She's so nice and her class is so fun and you get a lot of good exercise without feeling overworked. very sympathetic grade :)\n","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SHE IS AWESOME, she makes you work but she's an easy grader as long as she knows your trying, she is soooo cool, if you can take her for PE do!!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great class, actually makes you do things so its FUN and you get a work out","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shes cool, makes us do cardio friday tho..","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"OMG I LOOVE MS TAYLOR-RAY! Pros: fun& easy class, really nice teacher. Cons: cardio friday (although it really isn't that bad), sometimes she has written quizes but pretty easy.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Takes Physical Education seriously and makes sure you get active and healthy.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She can be loud. A \"military teacher\". But she's really chill and is pretty funny.Submitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's one of the only P.E. teachers that make you work out. She's really nice too, but she hates complainers.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love her sooo much. she's really funny and chill but she's one of those teachers that you really have to work for. She has favorites but never says who outloud. Be prepared for Monday fun day run days and have fun(:","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You Learn, HAVE FUN, GET FIT, BEST PE TEACHER! She explains things very well, is approachable, does not play favorites, nice to everyone, encouraging, AWESOME, take her class take her class take her class take her class !!!!!!!!!!!!!!!!!!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"one of the only PE teachers that really make PE fun and a work out. she pretty nice, take her if you can :)","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"omg..she is soooooooooooooooo awesome!!!!..hahahah...she is like..so chill!!..she doesn't grade hard at all..and she's a really neat person to talk to..seriously..TAKE HER","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"is that elaine down there? (1/20/07 entry?) T-Ray is cool","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is fun, I got an A while having fun. She is the only P.E. that makes us do something and I love it!!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her class is everything a P.E. class should be: you get the regular amount of exercise that doctors recommend and you have fun and enjoy it. You get toned and fit, and it's like indescribably the best pe class ever.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she’s a really great teacher, funny and makes class interesting. 10/10 would recommend if she didn’t make us run as much. you will get fit tho, def gonna choose her next year.Submitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"you actually get to do something and have alot of fun in her class unlike the other pe teachers.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great PE teacher for those who wanna stay in shape and stay healthy...bad for neone with heart problems...cardio friday is ok not as hard after awhile..she trains you pretty well","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not going to lie: I hated her at first because of how she treated me. But now that the semester is ending, I realize how much she cares about her students. She's funny, which is a plus. Warmups can be killer, but the games are usually fun. Take her if you're willing to exert the effort.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love her! She is so cool and nice. She is hard but she does make you work. I haven't got grades from her yet so maybe my views will change.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AMAZING AND FUN!!!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have T-Ray for first block, and she's not bad! She makes PE pretty interesting and is pretty humorous. Doesn't really matter what PE teacher you get cause it's only PE, but if you have a choice, T-Ray isn't bad :)Submitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a great teacher, and made gym fun, and I'm a guy that usually hates gym. Take her, she's an easy A, and you'll have fun as well.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love her :D nice, funny, and you have a great work out.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shes I'm awesome teacher, but theres Cardio Friday, so better watch-out. But she actually makes you fit! XD She's friendly, fair, and nice.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"In my opinion, Taylor-Ray is the best P.E. teacher ever cause she actually makes you do hard workout, such as taibo. And she gets you fit for the test in the spring. Cardio Friday - Best Day Ever","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I dont know who is writing reviews for Ms. Tray here, its probably her or her softball team. Ms. Tray was the worst PE teacher I had during my time at Lowell. I think she may be suffering from mental health problems because she was bi polar. Some days she was nice and some days she was insane and rude. I would recommend taking her husband before taking her.Submitted by a student","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a pretty nice and funny PE teacher. She actually does PE stuff, but just show up and you get an A.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Ray is such a G! I love her, I had her for weight training and as a softball coach. shes so awesome and her classes are pretty fun.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes one of the coolest teachers, who does care about her students geting into shape. i was really glad i had her.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Phys. Ed. (Freshman)- She is a very nice teacher. She may seem strict, but she is actually very funny. It might seem like she's torturing you a little with all the workouts, but she's really helping you prepare and improve to pass the fitness tests. If you work hard and put in effort, you'll do well","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had her for three semesters. she helps you get fit, but you have fun at the same time. she plays favorites for sure (I'm one of them AHAHA) but she will keep helping you when you need it. She's really funny and I lovee heerrr","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"likes exercise. a lot. but not the nicest person in the world, let me tell you that. take her if you want to exercise every single day. if not, don't. that's basically it.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AMAZING P.E. TEACHER!!! I had her for Freshman 1st semester. You do some running, but she runs and does the other fitness things with you. She really helps you to pass the fitness tests. She may seem strict at first, but she's nice and funny. Just don't be late. I wish her classes weren't full...","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really good PE teacher, makes you work hard though but that keeps you fit. Really cool teacher. Must get teacher.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's new but she is a fun teacher. cardio fridays to keep you in shape (she cares). quizzes easy. she is very nice and wants you to do your best. a must have for freshmen.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shes pretty cool and all, but you will have to work in her class. She takes P.E. VERY seriously. But shes nice too.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE T-RAY!! i'm a freshmen and i heard she was really hard....but you know she's not that bad. she will always support you and makes you laugh. Her cardio friday's aren't so bad...if ur out of shape then yeah you might be screwed...but you'll definatey get in shape, and she let's us plays really cool games.(luv handball!)","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fun Fun Fun Fun Fun Fun Fun!!!! That's all there is to it!!!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes really nice and sweet, but pretty hard with lots of running. u actually do stuff in her class, so if u wanna slack off dont take her.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Ray makes PE fun! I loved being in her PE class. She really keeps you in shape, and encourages you a lot. Ms Ray has a great sense of humor, too. You'll like Ms Ray. She sometimes gives written quizes, but they aren't hard. :3 [... class overall is an easy A]","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's cool, but have to run a lot","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Taylor-Ray freshman year! She is fantastic. You get a great workout and yeah she pushes you, but it's all good. You get in shape and she'll do the ecercises with you sometimes!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her classes are very fun. She actually tells you the rules to the games. You run some on Cardio Fridays, but it's not bad. Her final for 2nd semester is tumbling, but it's not that hard.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AWESOME TEACHER! but then cardio fridays are hard. she makes u run around the track field a couple laps and other stuff like push ups on the bleachers","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Work hard in Ms. Ray's class and she gives you respect. And an A. And if you're a student athlete, you're set.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Taylor-Ray is just awesome. it's so fun and you'll never get bored. she actually joins in when she knows there's not enough people on a team. I had her for the second semester of freshmen year and i LOVED IT. even if you're not fit, she'll make you fit. Totally recommend her.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best teacher ever... take her if ur in shape or if ur an athlete","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's alright, intimidating at first but you start to like her as the semester goes on.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love ms. ray! she get's you in shape with fun classes. she can tell when you put in effort, and she rewards you for it (with an A). ms. ray is soooooo nice and cool and funny. i love her and her class.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My favortite teacher so far. totally down-to earth and clear. She's sure to keep you in shape!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cardio Fridays really aren't that bad... it's just a mile, and you're free to go at your own pace. Very nice, fair, games are fun, and she makes gym class what it's supposed to be.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's great. I love her class. Just be in her class and you have an A. Great teacher, although biased about some sports (she hates basketball). Her warm-ups are rough unfortunately. However, she's cool. Hard to find a Dodgers' fan in San Francisco...","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You have to work in this class - she's not Mr. Axt. Laps around track, school, gym, you get the point. But she's a great teacher - nice, helpful, and she gets you fit. She's also funny. Also, she uses the Sportfolio less than most of the other teachers. She seems strict in the beginning but you will get used to her and then she becomes a nice, easygoing teacher. Hopefully I get her next year for Soph.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really nice and its great that she gives us A code. :)","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher easy A if you participate come on time and dress. Doesnt test or worry to much about the sportsfolie like other PE teachers","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes overall a really cool teacher and shes really nice. and she definately keeps you fit. cardio fridays can be hard. and she does a lot of running.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for the first semester in my freshman year and she was great. Easy A. Just work hard and turn in your portfolio. Now, I've read that people said she's hard.. Actually she's really easy. Or maybe it's just P.E. I've never found P.E. hard at all. All you do is jog a few laps and you're done.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very nice teacher at first she might seem reallly strict but she actually a very good pe teacher and she does most of the running with you. Just make sure your not late.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she`s a great P.E. teacher! she knows how to make it fun for students espesholly by being so competitive. But she makes it a big deal if you`re late or absent from class. Like she`ll keep asking and bugging yu about it. OH YEAH and she does not play favorites(: DOOOOD. her muscles scare me.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's a great gym teacher, very nicce very nicce but if you want to stay fit then pick her, try your best and it's an A, if you dont want to stay fit but want an A this is not the teacher for you.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great PE teacher","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is awesome! keeps you in shape and is quite strict but still has you smiling 8'D. she is really understanding, too! if you have a tough assignment to catch up on, ask her to give you the time off for the day. have any problems, tell her and she'll treat you nice","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had her for four consecutive semesters. freshmen pe classes and weight training both semesters of soph year. she def picks favorites (i am one of them heh) but makes fun of you and picks on you if you are her fave so dont take it personally. gets you fit but u gotta work BE ON TIME and you run a LOT (ew) but she's caring, helped me calm down at arena and shes funny :D","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's one of the teachers you actually have to work for. She loves to do a lot of running warmups and such, and she makes you really work out. As a freshman, take her class and you'll pass that fitness testing for sure! If you try, even though you aren't the best, you'll get an A-, as long as you do your sportsfolio. The year went by quite fast and smooth with her and some of her extreme volleyball and team handball. She's a great teacher. I gotta thank her for a GREAT freshman year.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is the BEST !! i love her! she really does care about students getting in shape, and she is the coolest.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love T-Ray. She seems strict off the bat, but once you get to know her, she is very kind and helpful. Also, some of the activities you do seem very intimidating (i.e. running around the school, and if you are passed by her, you get a F for the day, etc.) but they are actually not hard if you try.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is one of the best p.e teachers to have. Definitely strict, but cool.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Somewhat hard, pushes you alot and alot of running. If you're sick, you still have to do all the exercises and you can't the cut the class or you'll get an F. Tardies a big deal too, but is a good teacher and does the exercies with you.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes really nice but she takes p.e very seriously so you have to be fairly fit to get a good grade in her class. also shes pretty strict on tardys and cuts so dont screw up!!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her 2nd sem. freshmen year and had so much fun. Sure u have a final to worry about but jus put in effort and you'll get an A. I didn't have her 1st sem but that's when she really pushes her students. Once fitness testing is done it's smooth sailing. So take her if you wanna hav fun","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"probably the best teacher to take if you want to stay in shape and or like to work out, she encourages you to stay active, encourages friendly competition, and really knows how to keep you fit. instead of just telling you to work out on your own, she makes you do a little bit of pushups and sit ups in class, shes the reason im in love with p.e and why im taking her again. =] easy for athletes, hard for slackers.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes cool if u live for working out. her final is running part of lake merced so not good if u r lazy. overall, shes an easy A if u try your hardest and do your portfolio.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. ray is the shizz. you'll have a great time in gym, but you have to work for your A, whereas for other teachers you just show up and dress. cardio fridays are awesome, and she's a wonderful teacher. every so often she'll give you a break, and most people are thankful for it. she's too awesome for words.","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very reasonable and nice. I took her for weightlifting and despite the fact that i didn't get six pack, I got a whole lot buffer. I had so much fun in her class!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is so much fun! You have a great work out everyday and is super nice. I love her class so much","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Unlike some P.E. teachers, you actually work out and have FUN. This semester (S '06) we had a tumbling unit, and even though the flips and cartwheels seemed intimidating at first, the way she taught us made it easy. =) Collaborating/performing our routines as well as watching other groups with theirs was a great way to end the school year. You won't regret taking her class. =D","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"T-Ray is by far the best pe teacher that i have ever had. her class may seem hard, but she's only preparing you for whats ahead","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms ray is simply the best. i had her for two semesters for p.e. and i'm taking weight training just because i can't imagine any other p.e. teacher. she's the bomb. you'll fall in love with her. she's so nice and funny and always willing to help. you'll actually exercise in p.e. but it'll be sooo fun. she's the type of teacher you actually care about. take her take her take her!","rating":4.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Some-what strict, do the work and you will get a good grade. Only one test for freshman year (excluding final, which is a tumbling routine and an easy C). She is nice and will make you laugh in class. Take her if you want to stay fit but have fun in the process.","rating":4.8,"version":1}],"rating":4.802469135802476}},"__N_SSG":true}