{"pageProps":{"teacher":{"name":"Scott Fortin","departments":["Math"],"semesters":["Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Algebra 1","block":"1","semester":"Spring2018"},{"name":"Algebra 1","block":"5","semester":"Spring2018"},{"name":"Algebra 1","block":"7","semester":"Spring2018"},{"name":"Geometry","block":"2","semester":"Spring2018"},{"name":"Geometry","block":"4","semester":"Spring2018"},{"name":"Algebra 1","block":"1","semester":"Fall2018"},{"name":"Algebra 1","block":"3","semester":"Fall2018"},{"name":"Geometry","block":"5","semester":"Fall2018"},{"name":"Algebra 1","block":"1","semester":"Spring2019"},{"name":"Algebra 1","block":"3","semester":"Spring2019"},{"name":"Geometry","block":"5","semester":"Spring2019"},{"name":"Algebra 1","block":"1","semester":"Fall2019"},{"name":"Algebra 1","block":"5","semester":"Fall2019"},{"name":"Algebra 1","block":"1","semester":"Spring2020"},{"name":"Geometry","block":"3","semester":"Spring2020"},{"name":"Algebra 1","block":"5","semester":"Spring2020"},{"name":"Geometry","block":"3","semester":"Fall2020"},{"name":"Geometry","block":"5","semester":"Fall2020"},{"name":"Geometry","block":"3","semester":"Spring2021"},{"name":"Geometry","block":"5","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-15T22:37:04.320Z","text":"If you are usually not late, he is a great teacher and teaches pretty well. He is energetic and cares for his students. His tests are easy as long as you pay attention in class. If you are not the smartest, take him.","rating":5,"version":0},{"timestamp":"2020-05-07T05:12:01.508Z","text":"He is a really nice teacher and cares a lot for his students, but class can get a little boring. He is very energetic and nice as long as you come to class on time.","rating":4,"version":0},{"timestamp":"2020-05-06T19:12:52.798Z","text":"He cant teach very well and his tests are ass but its basically impossible to get a C or lower. If you're really nice to him in the beginning of the year he feels bad for you and cuts you a lot of slack.  I got Ds on most of the tests and stopped doing the homework completely after the first semester. The lowest my grade got all year was an 80. If you make some conversation and show effort in the beginning, you'll do fine in the class. If you want to learn, don't take him. ","rating":2,"version":0},{"timestamp":"2020-05-05T20:33:33.377Z","text":"He's a decent teacher, very high energy, best to be in his first block. Can sometimes be unreasonable, but overall he's pretty okay.","rating":4,"version":0},{"timestamp":"2020-05-05T02:24:19.325Z","text":"You can tell Mr Fortin cares, but hes just not the best teacher. Teaches and works straight from the textbook, and doesnt really explain new material well at all. Hes really approachable though, you can always ask him for help. Not good if you cant teach yourself ","rating":3,"version":0},{"timestamp":"2020-05-02T16:03:42.227Z","text":"Had him for geometry. Based on the other reviews I think he has improved his teaching bit. He talks fast, very enthusiastic, goes off on more tangents than my other teachers, loves Google Slides. Routine: homework review, lecture,  group work, homework. Ask for any problem during review and you'll get a good dissection, lectures a bit rushed so actually read he book as assigned.","rating":4,"version":0},{"timestamp":"2020-04-09T18:12:50.098Z","text":"I absolutely LOVED mr fortin. DO NOT take him first block if you are usually late, if you are not in class within the first 10 seconds of the bell, you will be marked late. I learned so much in his class and he has a very energetic personality. He is very passionate about teaching and genuinely cares about every student.","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Fortin is a good geometry teacher. He moves through material very quickly, and his class does involve you having to study on your own quite a bit. But if you ask for help on questions you are stuck on, he takes the time to help you. He assigns 30-60min of homework a night, but it is relatively manageable. In class the next day he will go over the homework and has all of the answers in his notebook. Overall a pretty good teacher!Submitted by a student","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I enjoyed his geometry course a lot. He encouraged me into like math, a type of logical math, with critcal thinking skills. I hope he has a wonderful summer of 2018. Special thanks to him, I really like geometry.Submitted by a student","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is nice and an easy B, BUT he does not know how to teach. His lessons are very boring, and when he tries to make them fun, they’re STILL boring. Fortin also complicates what he teaches even further and puts things that he didn’t even teach on the exam. So basically, you’ll be teaching yourself the entire year.Submitted by a student","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For geometry, he assigns about 30-45 min of hw every night, and spends about 20 minutes at the beginning of class everyday to “review” it. He’s really unclear when he teaches, and kind of rushes the lessons. His tests aren’t too bad tho. His class is an easy A if you can self teach, but I don’t really recommend. He’s a really nice guy tho.Submitted by a student","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Geo. He is one of the more approachable teachers, you can always ask for help and he'll explain. Geo is one of my hardest subjects and I still did pretty well. I would recommend him.Submitted by a student","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Fortins class is pretty boring. Theres group work every day which is nice, but we work out of the textbook a lot. Lots of his lectures don't really make sense to me. You can definitely get an A in his class if you work for it. Tests can be pretty hard, and some points can be taken off for weird reasons. Theres homework every night, but its usually one sheet of paper thats pretty easy.Submitted by a student","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is very boring and cannot teach at all. I have had a terrible experience in his class and hope to never see him again. His class has very challenging exams and useless piles of homework assigned every night. Shady man...Submitted by a student","rating":2.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"First, he takes about more than three weeks to grade simple assignments and scantrons. He also is very unclear in his teaching. Fortnite makes everything so much more confusing than it is in the textbooks. When I asked for help after school, he made an excuse to not help me. He said he \"needed to go back home to his dog.\" I would not take him because he is so unhelpful and does not care about his students.Submitted by a student","rating":2.9,"version":1}],"rating":3.346666666666666}},"__N_SSG":true}