{"pageProps":{"teacher":{"name":"Sharn Matusek","departments":["English"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017"],"classes":[{"name":"American Literature","block":"1","semester":"Fall2014"},{"name":"American Literature","block":"7","semester":"Fall2014"},{"name":"English 2","block":"2","semester":"Fall2014"},{"name":"English 2","block":"4","semester":"Fall2014"},{"name":"English 2","block":"6","semester":"Fall2014"},{"name":"English 2","block":"3","semester":"Spring2015"},{"name":"English 2","block":"7","semester":"Spring2015"},{"name":"Expository Writing","block":"6","semester":"Spring2015"},{"name":"Film as Literature","block":"1","semester":"Spring2015"},{"name":"Film as Literature","block":"4","semester":"Spring2015"},{"name":"English 2","block":"7","semester":"Fall2015"},{"name":"Expository Writing","block":"1","semester":"Fall2015"},{"name":"Expository Writing","block":"3","semester":"Fall2015"},{"name":"Comedy and Satire","block":"4","semester":"Fall2015"},{"name":"Comedy and Satire","block":"6","semester":"Fall2015"},{"name":"English 2","block":"1","semester":"Spring2016"},{"name":"English 2","block":"3","semester":"Spring2016"},{"name":"Expository Writing","block":"7","semester":"Spring2016"},{"name":"Film as Literature","block":"4","semester":"Spring2016"},{"name":"Film as Literature","block":"6","semester":"Spring2016"},{"name":"English 2","block":"1","semester":"Fall2016"},{"name":"English 2","block":"5","semester":"Fall2016"},{"name":"Expository Writing","block":"7","semester":"Fall2016"},{"name":"Comedy and Satire","block":"2","semester":"Fall2016"},{"name":"Comedy and Satire","block":"6","semester":"Fall2016"},{"name":"English 2","block":"3","semester":"Spring2017"},{"name":"English 2","block":"5","semester":"Spring2017"},{"name":"Expository Writing","block":"1","semester":"Spring2017"},{"name":"Film as Literature","block":"2","semester":"Spring2017"},{"name":"Film as Literature","block":"6","semester":"Spring2017"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"she expects a lot. she loves analysis and will always tell yout o go \"deeper.\" takes forever grading things and tends to hand back assignments a full grading period after you have turned it in. a lot of projects, and she loves creativity. easy B if you try to do the work decently.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I dunno why ppl say shes so bad; I think that she's really nice. Even though she isn't really clear with the assignments she's always willing to clarify it for you if u ask her. Homework load isn't really a lot either if you compare it to AP classes. I'm not sure if she's lenient atm, but I think th","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THAT WOMAN IS DRIVING ME NUTS!! makes us do work then collects it THREE MONTHS later. other times, she makes us do EXTENDING work that lasts FOREVER and uses HELLA pages then when she collects it, gives us a friggen format to follow. makes u \"go deeper\" on ALL those analysis stuff. DON'T TAKE HER.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"all i have to say is that she is an english teacher that doesnt kno how to spell leprechaun. she also looks up words shes gonna be using before class. also she aint clear on hw...so dont expect her to help u with it.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had her for English Pub. She's very disorganized and has poor time management. Plus you don't get your work back for either a really long time or never at all. I've asked her for help on my assignments, and although she tries to explain what she's looking for, it's very unclear. I guess all you really get out of the class is punctuality and analyzing.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Picky, but she really really knows her stuff.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is unprofessional. She doesn't plan out her lessons well enough to sufficently teach the class. Not to mention, she doesn't have an extensive vocabulary and her corrections on essays are less helpful than students' comments.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"useless busy work in her class, weird and unfair grading system, and hard to work with.Submitted by a student","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lots of review from previous years and busy work, + if you're taking AP Euro along with her class expect to be challenged by the amount of work presented but not by the actual material. Difficult grader (i.e. she failed 80% of the class on an assignment) but somehow ends up giving high semester grades (got a D on one of the 'major' essays because of length requirements, not content + some other low scores and managed B). Wouldn't reccomend, but if you gotta take her it ain't so bad.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shes a pretty easy teacher, you just gotta do all the work. But she isnt clear about things at all and i hate her book projects. If you have a choice, avoid.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for 3 semsters and i learned nothing in her class besides how to complete assignments. Very boring but easy if you complete all assignments","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is a nice teacher but she gives so much hw and its only the third day of school and i have a project essay and journal due tomorrow! the hw isnt easy at all and i have no idea how she grades things she seems to like to just pile things on top of us and make us do it but it should help in the future","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's nice but I'd pass her up for another teacher. If you're a tardy person avoid her because tardiness affects your grade. She hardly passes back work, but then again you don't turn in much. Basically here's how to succeed in her class: \"have your hw in on time,and be very analytic.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I honestly didn't think she was that bad of a teacher. Sure she can be a bit boring in class, but I found her class to be OK. I had her for english 2 and a lot of the tests were definition or spelling tests. Her learning logs are a bit tedious and have to be formatted a certain way but overall I wouldn't mind taking her again.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes a really nice lady but gives a lot of homework. tons of analyzing characters but doesnt give much essay. i think we had 2? she was really confusing at first and we hated her but we got use to her teaching and yeah. well just lots of work. easy B but hard A.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy \"A\", for Expository anyway... Pretty damn annoying and unclear in her directions and homework assignments. The only reason I didn't go shoot myself in that class was BECAUSE I was getting an \"A\"","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is such a gardening tool if you know what i mean. shes completely disorganized but expects her students to be organized. she has OCD and everything has to be done EXACTLY her method, no questions asked. you will hate her so much you'll want to rip her books in half and leave her class. Easy, but assigns too much work and doesn't explain AT ALL. top 3 worst teachers of all time","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not worth taking her class, shes SUPER strict about attendance. Work is a joke and she has all these odd prerequisites. if you take - read your summer reading.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's actually an ok teacher. She does give a lot of homework but she grades them really easily. Easy A if you do the homework and turn it in on time but if you don't, you'll get a B/C. Wouldn't recommend her but seeing the other teachers....you really have no choice but to take her. She's better than any other wacky English teachers.Submitted by a student","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think she was a great teacher, she didnt give much homework at all. It was an easy B, even though i thought i shouldve gotten an A. She grades randomly, sometiems easy, sometiems hard. I would definatly take her again though. I learned a lot from the calss.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Matusek is really nice. She sometimes might be unclear/confusing about homework, but overall, it's really easy if you just do everything. And your grade won't be really unexpected, because if you just do all the homework, classwork, and independent reading, you'll get an A.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Carney, Fuller, and Galang all gave me B's. Matusek's the first English teacher I've had to even give me an A for a grading period. BUT she is the most unclear teacher i've ever had. i always have to ask my friend what was homework cause for some reason I wasn't listening. i really try to pay attention but sooner or later, I end up thinking about something else. the class is pretty boring too. she's the first teacher to give me A's on my essays too.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Takes forever to grade assignments. (at least 3 weeks). Horrible monotone.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Matusek is a really nice teahcer and you could tell she loves english. She is sometimes confusing and gives a lot of homework but it's really easy. Only had to write 1 real essay for her class. Her tests and quizes are quite easy too, and she explains a lot. Just pay attention and you'll do well in her class.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i don't know about her classes but i have her for registry...she's very nice that's for sure!","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She gives alot of homework and sometimes she is unclear about alot of things. She grades pretty harshly if you make one small mistake. I spoke alittle too fast during a presentation and I get a B. I didn't answer like one or three questions for the IR project and I get a C.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"After roughly 3 months in her class, I've learned A LOT. Though it's a lot to let sink in in 3 months, she has a way of sticking new material in your head. The amount of homework given is reasonable and, most importantly, necessary. I'd recommend this teacher because 1.) she teaches well, 2.) she is helpful, and 3.) she's approachable. ^_^","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"terrible teacher. i hate her with a passion. shes really late with her grading, and procrastinates a lot when it comes to assigning work, so your left with almost no time to do it all. i dont think she can teach at all. and shes really disorganized too. terrible teacher, dont ever take her.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is a pretty good teacher. i dont think she gave out THAT much work. and plus the hw that she gives are pretty easy. if you want an easy teacher then take her but do all ur work. if u want to learn A LOT of stuff, then pick another. overall, u have to earn the A but even if u swing it in her class, it's like a B. i didn't even put half of my brain into her class and i got A's straight.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shes okay. Totally paranoid on tardiness...if your work is late, then it is automatically a C, or is unacceptable. Slow grader...almost never gives back work(or gives back extremely late.) If you want an esay A, dont take her. If you want to learn, take her( although theres better teacher avaibl","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She doesn't give out too much work but when it comes to stamp you really have to complete the work and put alot of effort to them in order to get the stamp. For the journal entry however, its super easy. She is such a harsh grader.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's nice, yeah...10th Gr. Eng.1...mm..She assigns hella work sometimes...but she's really nice. Her tests are kinna killer though, not many people get to finish with enough time to check work or even finish at all. Book reports are easy though. Easy B I'd say? You can get the A though, just do well on the tests too.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love her, she is an easy A and doesn't give HW, and is fun","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Don't take her she gave out too much work and then expected us to read on top of that, not a couple of pages but at one point three books at the same time and analyze them. Then BOOM you get a quiz the next day and you fail because you couldn't read because you were doing her work plus the loads of other work that other teachers give you. I messed up three quizzes and I went from an A to a C","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's actually a nice person, it's just she can't really teach very well. She's pretty unlcear about a lot of things, and gives you tons of work that are pretty much meaningless. She's an easy A if you do all the \"bread and butter\" work, but I didn't really learn anything from it.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes a pretty cool teacher... its just alot of work but shes very nice about it and she is nicer than my last semester's teacher (gest) shes a pretty hard a but easy c","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"English teachers should know their grammar and punctuation and, at the least, be able to speak concisely. She does neither.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she doesn't do her grades correctly cause she just looks at it and averages it out. her presentations are easy A's. I had her for Expos Writing. she was pretty boring and gave some homework. she tries to make the class more interesting by doing all these projects. in the end, i think she actually improved my writing a little bit. oh, and she's also very unclear.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is the worst teacher ever. i chose her because she's new to the school , and thinking new teachers are eeasyy.. this lady aint. do not take her. i swear, even if it was your only choice- file a double incomplete or something. its better than taking her. also, her lessons are boring. she thinks she's funny- but in reality she's not. laughs at her own jokes and wahtnot. homework wise.. you've read it. its bad- too many pointless lessons that dont teach anything beacuse its just common sense","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes horrible.last second hw giver.doesnt explain anything and doesnt teach.random projects that have nothing to do with anything.like the person below,a lot of hw last second.shes a stickler on tardiness yet shes late every single day from 5 minutes to 20 minutes.AVOID HER COMPLETELY.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's really mean about attendance and tardiness. one cut lowers your citizenship grade by one. 3 tardies does the same thing and if you're late by just one minute, consider it a tardy. she's a nice person though. she knows her stuff but the work she gives gets confusing and tedious. lots of paperwork","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"why does everyone not like ms matusek> shes very nice n her class is very chill. in the Beginning theres a lot of hw, But not that much later","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Matusek's class is wack. It's great. Like an extra block for you to chill. I gained no writing/english skills from her class, however my jokes are funnier now. (haha) Not too bad of a class if you have friends to take it with you.Submitted by a student","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"gives a lot of work and very paranoid with certain things such as tardiness and homework. easy A however, and i guess you can learn a little bit from this classSubmitted by a student","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ok, i used to thing she was really bad at returning work, but she's the journ advisor! when it's her class's issue, she has to edit and approve every single article. so yeah, its a little a annoying, but cut her some slack","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Eng 10-1, I would not recommend her! EASY B & C, harder to get A, i think . she is a nice person and all, but her hw is unclear, she gives hw now and again, but when there is hw is is a giant lump. she gives a test once in quite a long while, we never get enough time for tests, and she knows it. takes a LONG while to return/grade assignments. she'll take a long time explaining in the begin. but later she just shoves you through, expecting you to \"apply the skills you learn earlier\"","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she came from o'connell and macateer so shes easy","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really sweet teacher. always with a smile, never yells, never gets mad, etc. easy A...just do the hw. occasional big projects, essay/short answer tests. boring sometimes, but some lessons/units are interesting. write good stories/essays, or her pen will bleed through your paper.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a nice teacher, but sometimes unorganize, easy B but you have to work real hard to get an A in her class. She also gives a lot of hw, which counts 25 percent of your grade.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Terrible. she gives you so much work and little amount of time she doesn't know what she's talking about half the time expect you to know. she's so picky about every little detail in the smallest they might not get credit for the assignment. Avoid her at all cost","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She was a really easy A for me. As long as you do well on tests, essays, and finish all your homework, she doesn't give you trouble. She is terrible at keeping time though-- she let us out 10 minutes late before. Her lessons are boring and useless. You learn nothing in her class, but she's very laid back, so I guess she's okay. Would not recommend her though.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice, you just have to do the work, even though there is a lot of it. if you pay attention in class, you'll get an A.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"So Ms.Matusek is the type of teacher that you need to \"ask if you dont know\". She goes deep with her charts and expects you to know how to do it after a couple of examples. Had her for Film as Lit. not the best choice if you're a slacker because she makes your paper down for being late. Lots of work","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"wouldnt round up...... my gods shes unorganized.... if u like busy work ur good for a easy B","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The easiest project for me was her interview, cuz its less work, even though you have have know your book inside out with at least some anaysis. Honestly though, I think that she's approachable and really nice, albeit the fact that she's not clear That isnt to say that she isn't hard; she's a harsh grader, so really make sure you know your books and her material. Lot better than some English teachers, not as good as others.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes ok at first but she just goes on and on. gets off topic and makes everything confusing...","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's the worstt teacher ever, she gives so much hw and she doesnt teach. NEVER TAKE HER","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's pretty nice but you can't learn much in her class. always asks us obvious questions about things. Sometimes can't spell stuff. But honestly, pretty easy and nice. but signing in if we're like 3 or 5 min late is not cool. and just let us watch the videoo. we kind of get the pointt","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"worst teacher ever!!!!","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy A. not much learning","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a nice person, but not an organized teacher. She knows what she wants to teach and she has good plans, but not good time management. Avoid at all costs. Nice person, VERY bad teacher. Very picky, partial credit is almost an always.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"well all i can say is shes easy. easiest english teacher ive ever had. theres homework, but its really easy as well. just a bit tedious. if i could take her again, i probably would, for the easy A. :)","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SHES SO EASY. just be nice to her, and youll get an A","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's awesome. BUT A LOT OF WORK. do your work and you'll be fine.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is an awesome teacher. i dunno why people think her homework is challenging. even though theres a lot doesnt mean that theyre much hard. she only gave us two reading for the semester. heka nice and cool","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she assigns tons of homework and will suddenly add another assignment right before you have to leave. She is not very clear about her assignments or what she wants, sometimes she is not clear whether something is an in class essay or not. She doesn't use school loop, which would have helped with the confusion. I don't know how it is or journ, but i had her for english/publication (did not sign up for it, but was forced into it by messed up self-scheduling or something).","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BAD!!! REAALLY BADDDD!!!! really weird grading and LOTS of homework and LOTS of reading NEVER and i mean NEVER have enough time for tests","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I actually really like matusek. I learned to analyze really well from her. I feel that people just get lazy and dont try as hard as they should when it comes to english. dont ever take her teaching for granted. if you really listen, it helps.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She gives a lot of work, but she grades it really easily. Her projects are very flexible in terms of what you like to do. Its an easy A.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Probably the most unorganized teacher you can get. Her writing is impossible to read. Her directions are never clear. Everything she does is late minute. She doesn't even try to learn your name. Oh right, and you dont learn anything. Yeah...","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Honestly, she's not that hard of a teacher. Just do your homework, get the stamps, do your project, and ace the tests (which are matching/spelling) and you'll get an A. She's pretty nice to talk to, unlike other teachers.","rating":2.6,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i dunno i guess it's hard to say cuz she's only been teaching at lowell for about..well, 4 days now. but all i can say i LOTS of writing. it's only the first week and we're writing 2 in class essays. and lots of reading.","rating":2.6,"version":1}],"rating":2.5999999999999965}},"__N_SSG":true}