{"pageProps":{"teacher":{"name":"Shawn Laureyns","departments":["Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Environmental Science","block":"7","semester":"Fall2014"},{"name":"AP Environmental Science","block":"8","semester":"Fall2014"},{"name":"Physiology","block":"3","semester":"Fall2014"},{"name":"Physiology","block":"4","semester":"Fall2014"},{"name":"AP Environmental Science","block":"7","semester":"Spring2015"},{"name":"AP Environmental Science","block":"8","semester":"Spring2015"},{"name":"Physiology","block":"3","semester":"Spring2015"},{"name":"Physiology","block":"4","semester":"Spring2015"},{"name":"AP Environmental Science","block":"3","semester":"Fall2015"},{"name":"AP Environmental Science","block":"5","semester":"Fall2015"},{"name":"AP Environmental Science","block":"7","semester":"Fall2015"},{"name":"AP Environmental Science","block":"8","semester":"Fall2015"},{"name":"AP Environmental Science","block":"3","semester":"Spring2016"},{"name":"AP Environmental Science","block":"5","semester":"Spring2016"},{"name":"AP Environmental Science","block":"7","semester":"Spring2016"},{"name":"AP Environmental Science","block":"8","semester":"Spring2016"},{"name":"Biology","block":"8","semester":"Fall2016"},{"name":"AP Environmental Science","block":"3","semester":"Fall2016"},{"name":"AP Environmental Science","block":"5","semester":"Fall2016"},{"name":"AP Environmental Science","block":"7","semester":"Fall2016"},{"name":"AP Environmental Science","block":"3","semester":"Spring2017"},{"name":"AP Environmental Science","block":"5","semester":"Spring2017"},{"name":"AP Environmental Science","block":"7","semester":"Spring2017"},{"name":"Biology","block":"8","semester":"Fall2017"},{"name":"AP Environmental Science","block":"3","semester":"Fall2017"},{"name":"AP Environmental Science","block":"5","semester":"Fall2017"},{"name":"AP Environmental Science","block":"7","semester":"Fall2017"},{"name":"Biology","block":"8","semester":"Spring2018"},{"name":"AP Environmental Science","block":"3","semester":"Spring2018"},{"name":"AP Environmental Science","block":"5","semester":"Spring2018"},{"name":"AP Environmental Science","block":"7","semester":"Spring2018"},{"name":"AP Environmental Science","block":"3","semester":"Fall2018"},{"name":"AP Environmental Science","block":"5","semester":"Fall2018"},{"name":"AP Environmental Science","block":"7","semester":"Fall2018"},{"name":"AP Environmental Science","block":"8","semester":"Fall2018"},{"name":"AP Environmental Science","block":"3","semester":"Spring2019"},{"name":"AP Environmental Science","block":"5","semester":"Spring2019"},{"name":"AP Environmental Science","block":"7","semester":"Spring2019"},{"name":"AP Environmental Science","block":"8","semester":"Spring2019"},{"name":"AP Environmental Science","block":"3","semester":"Fall2019"},{"name":"AP Environmental Science","block":"5","semester":"Fall2019"},{"name":"AP Environmental Science","block":"7","semester":"Fall2019"},{"name":"AP Environmental Science","block":"8","semester":"Fall2019"},{"name":"AP Environmental Science","block":"3","semester":"Spring2020"},{"name":"AP Environmental Science","block":"5","semester":"Spring2020"},{"name":"AP Environmental Science","block":"7","semester":"Spring2020"},{"name":"AP Environmental Science","block":"8","semester":"Spring2020"},{"name":"AP Environmental Science","block":"3","semester":"Fall2020"},{"name":"AP Environmental Science","block":"5","semester":"Fall2020"},{"name":"AP Environmental Science","block":"7","semester":"Fall2020"},{"name":"AP Environmental Science","block":"3","semester":"Spring2021"},{"name":"AP Environmental Science","block":"5","semester":"Spring2021"},{"name":"AP Environmental Science","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"really easy but also very boring. underestimates his students. can't spell. not much classwork or hw. he seems like a nice person but not a very good teacher if you want to learn. the class is really slow-moving and won't prepare you very well. maybe he'll improve when he gets used to lowell and the abilities of its students.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's nice, homework once or twice a week, and labs pretty much every week. lab's arent too hard as long as you have a smart group, you'll run away with an A. A's aren't too hard to come by in his class, just make sure you do all your homework and do well on labs and you could get by with b's on quizzes and tests","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Assigns useless labs like breathing into cartons when he could just as easily give us hypothetical lung capacities with which to do calculations. Breathing into a carton taught me no more than using someone else's capacities.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"okay, no offense meant, but mr. laureyns doesn't really teach. Seriously. You learn more reading the book than from him lecturing. Annoying powerpoints. But on the plus side, he is EXTREMELY nice and an easy grader as long as you turn in everything. Take him to slack off.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Well, I think that he's a pretty chill guy. Class can be a little boring sometimes (S'10). A lot of it had to do with Powerpoints and lectures. Tests are really easy though, and come on, he curved his final by 10%! That's pretty cool. Definitely take him.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is really easy, as long as you do the homework, you hae a guaranteed A but you will learn NOTHING from his class.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Vocab quizzes basically make up your grade. Good to just memorize the notes he makes you take. Never worry about the pop quizzes he gives in class. Don't talk over him, he gets really uptight about it","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"you gave him a 2 for easiness and yet you say you got over 100% on one of the trimesters. TAKE LAUREYNS HE'S MY FAVORITE TEACHER!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"laureyns is pretty cool. he's very easy to talk to, and he doesnt make you feel like an outsider. he sometimes jokes around and makes the class pretty fun. labs are fun, even though you have to write about them. and even though you learn stuff in his class, you should probably read the book too (when he assigns it, which is rarely) cause most of the stuff that he teachers reflects on the concepts of the book. he's cool though.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really easy but the lab reports are really long and pointless.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Why do some people say he really bad this semester? I had him last semester and I thought he was really nice(at least to me). I made the huge mistake of not takin him again, but it wasn't my fault, I had to go last in the arena and he was already taken in mini arena for the mods that I could take bio. my new teacher really sucks.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the nicest teachers I ever had. Though his niceness can be taken advantage of by \"some\" of his classmates. (Not me) His tests are generally easy. He doesn't give a lotta hw, but when he does, they take a long time to do (worksheets & lab reports.) Easy A tho.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class is one of those ones you hate, but you don't exactly know why. It's boring and feels like a waste of time. He rarely gives work, and most of class is spent copying mindlessly off his powerpoints. Tests can be tricky, but if the whole class complains, he will curve. Very reasonable, though.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Mr. Laureyns. Sure his power points can be tedius and boring, but his class is soo fun. Hes a nice guy and very chill. tests are very easy. and you will get an A no matter what you do. Wish he taught chem...","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really easy, to me at least, labs are cool if you enjoy experimenting and try to be interested in them. But if science is just not your expertise then I would say to take him if you want a thorough explanation or not take him if you really just don't want to spend your time in science","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Laureyns is the coolest. I really had a hard time in bio cause I really didnt understand. I went to him for help and he really does help. I learn a lot from him than I ever did and he got me to really like biology","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hes a really chill guy and his test are okay but his class is easy","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr. Laureyns for APES and he is honestly the most kind and sincere person who tries his best to engage his students. Although he's a little disorganized with his powerpoint lectures, he knows what he's talking about and is very approachable is you need extra help. He's passionate about teaching and always attempts to engage others in the conversation.Submitted by a student","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had him the first semester and he turned out to be the best bio teacher i ever had. he engaged everyone in experiments(although the labs were a pain in the butt). and i like the way he thought. i learned alot from him and his notes saved me on this semester's final. i would not say he is an easy A unless you do well on the tests. and you need to turn in your hw on time everyday. overall very fun and entertaining.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"have him for bio, very nice and chill teacher, highly recommended","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take laureyns for biology. He's nice, fun, and a very easy A. He gives little homework and essentially no tests. Make sure to turn in all your homework because your grade is based on that. He gives you full credit for turning in homework. You don't learn much, but who needs biology anyways? Easy A.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a cool teacher and pretty nice too. His labs are kinda hard though because the long ones can be up to around 10 pages.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"What the heck is wif you people? or did mr. laureyns really change that much in one year? ..he was an awesome teacher man! a bit uptight when we wanted to have fun but overall taught me a lot about biology and evne now, im totally applying it...also, in this sophmore year, we had to take the STAR Biology portion AGAIN. and i stil felt it was easy. obviously his teaching wil stay wit u for a time","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Laureyns is a really nice guy, but not the greatest teacher. He has some compassion for his students, although his powerpoints are tedious to copy down. He lets us out early almost every day, though.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very nice (: LAUREYNS, YOU ARE AWESOME.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the bestest kewlest teacher ever. i broke his fish tank and he just asked if i was hurt. <3333","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is one heck of a teacher :D semi hard, just try and listen. hes really helpful and teaches in a fun way!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love this guy ! Easy B. Not sure about A's. Listen to him tho, I barely pay attention and I always get caught, but he's totally cool about it. Labs are long but i dont mind doing it. only hw are chapter assesments and we barely do it.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he cannot teach but his class is easy so you'll probably get at least a B in his class. I had him for bio 1 1st semester as a freshman btw","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his class isnt that hard. he's a pretty good teacher. he tries to help you understand the concepts, but sometimes isnt so clear on it. his class is pretty easy.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"y'all say \"get full credit on your point sheet\" but the first assignment, worth 5 points, was to buy a composition notebook. i didn't have time. so now i'm missing 5 points because of something that doesn't even have to do with the class.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a really cool guy.His test are not that bad and if you do good on weekly vocab.quiz you're all good.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy teacher...seems like a nice guy....not that much work","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy in every single way, just make your labs 5-7 pages long. Just remember to do all of your homework (there's hardly any) and get full credit for your point sheet since homework is worth 25% of your grade. And get a good partner for the labs because even if you do all of it he gives every group member the same grade. He's very nice and helpful.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Laureyns is an amazing teacher. He'll only cover one chapter for every two other teachers do, but what he teaches you, you'll remember later on. Really nice guy too, he genuinely cares about everyone.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class was such an easy A and you actually learn more than you would in Newhouse's class because Laureyns FORCES you to learn things. And it's mostly through weekly vocab quizzes and whatnot. Just do all the work, memorize the vocab for the quizzes, and you're fine. Usually for \"tests\" he lets you redo them...","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy! Take Him. His class is an auto A if you do your work. Don't loose your point sheet!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a good teacher, but he treats us like 7th graders. he doesn't effectively challenge us, and he teaches straight for the CAHSEE, not stopping for anything interesting along the way...","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Laureyns is okay. He's an easy A if you just do your work and follow directions for the labs.But he treats his students like their in middle school and just have us copy down his own notes from the overhead. Im pretty sure he knows the stuff, but isnt best at teaching it. His class goes by fast.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy... do ur hw.. get to class on tym... voluteer... so not hard... nnnn","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I liked mr. laureyns. He really focuses a lot on actuallylearning and understanding instead of just memorizing.Labs are kinda boring. But as long as you do your homeworkand study a bit for test (their all multiple choice!) you'll be fine","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a cool and easy going teacher, I really liked him I didn't learn much because Science isn't my thing, but overall the atmosphere of the class is great, he tells jokes to his class and is easy to talk to which is important, if you're having a hard time. The only bad part are the lab write-ups, I hated them, but my group got an A. He grades harder on individual labs though. =0 But I still recommend him for Biology","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took Mr. Laureyns for bio during my whole freshman year and got almost straight A's. Cool teacher, cool person. He puts the notes on the web if you ask, but I found that copying them down helped me learn them. Easy quizzes. I dunno about Physio, but I'd definitely recommend him for bio.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's okay, sometimes he's really nice to me and others he mean. Overall he's one of the nicest biology teachers at lowell.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher!! also really nice!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I assume it's because of his background, but he doesn't seem to trust his students and it gives the wrong impression. He tries to make the lessons memorable by being hands-on, but the labs often lack a spark of motivation.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For Physiology he's AWESOME! Really easy A as long as you study for the weekly vocabulary quizzes (which aren't even every week). Also he's fun and nice. :)","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had his Physio course when he took a huge leave of absence. No assignments, but also no learning. Tests are easy. Some labs can be interesting. Relatively boring course for an fascinating field of study. Laid-back, but somewhat pointless class.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr laureyns is great ! hes really really really patient and he wont yell at you unless you do something really bad. he explains stuff relly well and your learn even if you just listen a little bit. he does a lot of group labs and you work in partners. tells yu to takes notes but doesnt check. easyb","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took Mr. Laureyns for Physio for one semester. He's very easy...most of your grade is comprised of classwork and homework. Also, study for your vocab tests because they're practically free points. He can be a little picky when it comes to labs but it's not too big of a deal. Generally pretty nice...if you aren't ready to take a vocab test, talk to him and he'll let you retake it some other day.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's very nice, he's not that hard, participate in class, do your h.w and pay attention in class. I've never seen him really yell at anyone, he's nice.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty easy, doesn't go quite as fast as other teachers. only kind of big stuff are lab write ups and a few small tests. wants you to have different perspectives and \"an open mind\". knows some spanish too","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"horrible class. im taking him and he springs pop quizzes that are like.. 20 points.. it seems really unfair because that stuff we took notes on was a week ago. its annoying... how does he expect us to even remember something from so long ago? he doesnt even teach so how does he even expect us to remember it?","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. laureyns is COOL. his class is easy for me because the quizzes are VERY straightforward, multiple choice, and only 20 q's long., it's fun because we do experiments, and the lab reports aren't really that hard- just be throrough when you explain everything. he really explains stuff when he teaches but sometimes we fall behind because class tends to drag. or we do a lot of labs which makes us slower. but he is nice, understanding, and you will get an easy A if you try.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He doesnt teach much but he's kinda nice. But we're behind all the other classes by a chapter & his 'quizzes' are actually tests & worth 40% of your grade. Oh & if he's giving you a pop quiz but doesnt say \"put your name & mods on the top of your paper\" it's just a 'self quiz' to 'help yourself out' & a total waste of paper. just chill when your in his bio class & read the book bcause he doesnt review it. & his lab reports are SO boring","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Bio 1, freshman year. Whatever people are saying here, he's a good teacher. We did a TON of labs, and learned quite a lot from them. His explanations make sense and are helpful. His tests are RIDICULOUSLY easy. I think i got a 98% in his class. 1 problem: he mover soooo slowly. Even seawell was ahea","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had mr laureyns for physio for 2 semesters. I've really enjoyed his class and actually learned a lot. I think most people don't really learn much because they don't take the time to, and just want an easy A.... hahaha. but just study for vocab quizzes and those will bring your grades up especially in the first semester. I thought physio was pretty interesting, and mr laureyns is really nice and understanding when something comes up and will always try to help you with your grade!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"u've got to get Laureyns. u usually have to take notes in class, but you can jus study the notes off his blog. really really easy ! quizzes are straightforward and grading system is very fair.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Super nice teacher!! He doesn't give reuglar quizzes or tests, but when he does, it usually open note. Just make sure you take notes and pay attention. Pretty easy A.Submitted by a student","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i got over 100% on one of the trimesters and i never did any extra credit...take him for bio it's easy and he helps you if you need it","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"How did you manage to get such a high grade if you didn't learn anything? OH YEA! Mr. Laureyns is a pretty cool guy but he is very strict about the HW. ( I only forgot to answer ONE question and he said he couldn't stamp it/ sign it.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"alright so i took laureyns for both semesters. first one i learned a lot but the second one was really lame. dont take him 1-2 because he forgets everything. if you do all your hw and turn it in on time then you can get at least a B. his tests are easy if you study for them. they are pretty straight forward. you should take mr.l","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's not hard, but not super easy. If you just do everything, you'll end up with a good grade. His tests are easy if you study for them.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Laureyns is so awesome! I loved his class; it was my easiest class second to PE, and also my most fun class! He and the class always joked around! It's very easy to get an A in his class; just know the basic material on his tests held every other Friday.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's okay. he's strict about homework, and doesn't really explain the assignments, but his class is alright.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took him for bio last year and he was really, really easy. He didn't really teach much, and his tests were super easy. The most annoying thing was probably his lab write ups, but that's about it. He's a really chill guy.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy teacher, but is not a very good teacher. I didnt really learn anything from the assignments he gave. Somewhat boring class, but a really nice guy.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome teacher. Very, very easy A. Had him for both Bio and Physio. He's knowledgeable, kind, and forgiving; allows people turn to in late work. Def. take him","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's cool. Nice guy and makes biology fun. He plays games sometimes and his finals are questions from previous tests.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I got a 108% semester grade last semester, but i learned nothing.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you talk to him he's a really nice guy... But he's not someone that you would think would become a teacher. He's super chill on everything but you don't exactly learn in his class.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really easy and fun class but dont expect to learn a lot","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Super nice guy. Pretty easy, make sure to do all his hw and labs. we barely have tests so hw/labs make up your grade. he teaches by powerpoint. We only had 3 tests (including the final). <3 this guy!!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is an extremely kind teacher who loves his students and teaching. He prioritizes students' interest in the subject more than test scores, so most of his tests are open book or open neighbors. He gives a lot of extra credit opportunities, but if you just listen in class and try on the labs, you won't even need to do them. He will help you whenever you need help. He never gets mad. Lots of field trips, too. Taking his class really made me fall in love with science. 200/10 would recommend.Submitted by a student","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take his class after 1-2 that way ask your friends what's on the test and always ace it final is comprised of ll test questions so make sure you learn your mistakes labs are easy if you work hard at them","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Overall a good teacher and is usually open to suggestions. For example he let us pick our own groups for group labs. The only thing that isn't great about the class is that there is a lot of writing to the labs, like we always have to write reports. But overall he is a good teacher, knows what he's doing and helps you understand things.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not that great for bio. Has countless 15-page labs, that aren't effective as he thinks they are. Getting grades back is a hastle. He has an outbox which is basically a tray with a ton of random work that we've done that usually isn't in any particular order. Sometimes you have to ask for tests back because he forgets to return them. Somewhat of a flake. somewhat Easy A though.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think he's a very good teacher. The discussions we had in class are very interesting and we're always doing stuff. He's definitely not one of those teachers who just reads from a book and makes you write it down.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him the first semester he was teaching here, I had my doubts in the beginning, but everything turned out pretty cool. As with any other new teacher, he just needs to get used to the \"Lowell environment\" He's super nice and grades fairly, I wish I could take him again but I settled for Melvin since I was last pick anyway","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i LOVE mr laureyns. hes HEKKA COOOL!! hardly and hwk. easy stuff. quizzes every other firday and labs are stinkin easy. never need the book. AWSOME man. really nice to kids. TAKE HIMM!! oh, and no need to participate. EVERRRR. <3 love him. he has an earring too. hahaha but he teaches chapters slwer than others. like a chpt or 2 behind. but hes tight. take him NO DOUBTT","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cool bio teacher! I loved how he would teach the class using stick people drawings on the board and even that outdoor activity with the transcription/translation process! If you need help on something, he'll help and make everything clearer! He's the type of teacher that makes everything fun and easily understandable. I say the only thing that can be hard in his class are labs, but that only applies when you have to work with some lazy/independent people in your group. Otherwise, easy A. =]","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i jus had a pop quiz this other day with the notes he stole from the internet. sure he gave us the notes but who knew we were supposed to study for it when he gave us the notes a week ago and during that week we were focused on the stupid lab he gave us. more than half of us failed it. and i know i did.. horrible.. he goes, \"its ok, people have their bad days..\" he rushes thru the notes expecting each of us to copy it with the 20 seconds he gives us. i will never take him again.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"lame teacher. no hw, but you have to do a lab in one night. boring class, boring lectures. easy A if u do the lab reports right.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not a lot of homework, kinda funny, labs are a snoozefest. Doesn't give the lab write ups back to you on tyme. I mean come on we turn our last lab a month ago and he said he isn't going to give them back until we come back to school in jan. But overall he's really easy, tests are great, I think he's the only teacher that does all multiple choice tests. I sooo love that part!!!","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A lot more hands on activities compared to other classes and he helps you if you need it. even though his tests are somewhat hard, its not hard to get away with an A for the semester","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool. he really tries to help you if you don't get it. he makes sure you actually understand the concepts instead of just memorizing vocabulary. pretty easy and straightforward tests, though he sometimes tries to be funny on them (DNA has two basses and a guitar) he enjoys it when people argue in class about science, even if it's among the same three people (everyone else is complaining and wants the pointless debates to end)","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He definitely does not know what he is doing. His PowerPoints consist of information he has taken off the web. His class is pointless and a total bore.","rating":4.1,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"OK teacher. Lots of labs & most are boring. Has a problem with returning labs on time. Take him if you're a slacker 'cause he's sort of a slacker to. Tries to be funny & cool. Not much homework & most is easy anyway. He's still working out his teaching method (he's not used to good schools). Likes group labs 'cause they're easy to grade. He doessn't believe in orthodox teaching methods like memorization and tries different techniques. If you're good at Bio and want to learn more, don't take him.","rating":4.1,"version":1}],"rating":4.100000000000004}},"__N_SSG":true}