{"pageProps":{"teacher":{"name":"Sirly Delariarte","departments":["Science"],"semesters":["Fall2014","Spring2015","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Physics","block":"1","semester":"Fall2014"},{"name":"Physics","block":"2","semester":"Fall2014"},{"name":"Physics","block":"4","semester":"Fall2014"},{"name":"Physics","block":"6","semester":"Fall2014"},{"name":"Physics","block":"7","semester":"Fall2014"},{"name":"Physics","block":"1","semester":"Spring2015"},{"name":"Physics","block":"2","semester":"Spring2015"},{"name":"Physics","block":"4","semester":"Spring2015"},{"name":"Physics","block":"6","semester":"Spring2015"},{"name":"Physics","block":"7","semester":"Spring2015"},{"name":"Physics","block":"1","semester":"Fall2016"},{"name":"Physics","block":"3","semester":"Fall2016"},{"name":"Physics","block":"4","semester":"Fall2016"},{"name":"Physics","block":"5","semester":"Fall2016"},{"name":"Physics","block":"7","semester":"Fall2016"},{"name":"Physics","block":"1","semester":"Spring2017"},{"name":"Physics","block":"3","semester":"Spring2017"},{"name":"Physics","block":"4","semester":"Spring2017"},{"name":"Physics","block":"5","semester":"Spring2017"},{"name":"Physics","block":"7","semester":"Spring2017"},{"name":"Physics","block":"1","semester":"Fall2017"},{"name":"Physics","block":"2","semester":"Fall2017"},{"name":"Physics","block":"3","semester":"Fall2017"},{"name":"Physics","block":"6","semester":"Fall2017"},{"name":"Physics","block":"7","semester":"Fall2017"},{"name":"Physics","block":"2","semester":"Spring2018"},{"name":"Physics","block":"3","semester":"Spring2018"},{"name":"Physics","block":"4","semester":"Spring2018"},{"name":"Physics","block":"6","semester":"Spring2018"},{"name":"Physics","block":"8","semester":"Spring2018"},{"name":"Physics","block":"1","semester":"Fall2018"},{"name":"Physics","block":"3","semester":"Fall2018"},{"name":"Physics","block":"5","semester":"Fall2018"},{"name":"Physics","block":"6","semester":"Fall2018"},{"name":"Physics","block":"7","semester":"Fall2018"},{"name":"Chemistry","block":"7","semester":"Spring2019"},{"name":"Physics","block":"1","semester":"Spring2019"},{"name":"Physics","block":"3","semester":"Spring2019"},{"name":"Physics","block":"4","semester":"Spring2019"},{"name":"Physics","block":"5","semester":"Spring2019"},{"name":"Chemistry","block":"6","semester":"Fall2019"},{"name":"Chemistry","block":"7","semester":"Fall2019"},{"name":"Chemistry","block":"8","semester":"Fall2019"},{"name":"Physics","block":"2","semester":"Fall2019"},{"name":"Physics","block":"3","semester":"Fall2019"},{"name":"Physics","block":"2","semester":"Spring2020"},{"name":"Physics","block":"3","semester":"Spring2020"},{"name":"Chemistry","block":"6","semester":"Spring2020"},{"name":"Chemistry","block":"7","semester":"Spring2020"},{"name":"Chemistry","block":"8","semester":"Spring2020"},{"name":"Physics","block":"2","semester":"Fall2020"},{"name":"Physics","block":"4","semester":"Fall2020"},{"name":"Physics","block":"5","semester":"Fall2020"},{"name":"Physics","block":"7","semester":"Fall2020"},{"name":"Physics","block":"8","semester":"Fall2020"},{"name":"Physics","block":"2","semester":"Spring2021"},{"name":"Physics","block":"4","semester":"Spring2021"},{"name":"Physics","block":"5","semester":"Spring2021"},{"name":"Physics","block":"7","semester":"Spring2021"},{"name":"Physics","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-06T17:43:26.972Z","text":"Ms.D is very nice! She’s also always willing to help you. When she lectures it’s usually very fast but if you ask her to slow down she will. I would recommend taking her!","rating":5,"version":0},{"timestamp":"2020-05-06T17:36:52.160Z","text":"Let me start off by saying that Ms. D is the sweetest woman in the planet. Her teaching style can be a little confusing before you get used to it, however she will always take the time to help you if you ask and she’s an amazing one-on-one teacher. She also does a lot of examples as a class which are super helpful. Her tests are really doable if you pay attention in class, they’re always on things that we actually learned and went over several times. I’ve never been good at science but I always felt prepared for her tests. I highly recommend this class. ","rating":5,"version":0},{"timestamp":"2020-05-06T17:34:55.709Z","text":"I had an excellent time with Ms. D because I figured out that all you have to do in that class is to communicate with her. She talks very fast when she is lecturing so lots of people get confused. All you have to do is communicate with her all the time. If she is talking too fast, tell her, she slows down and will do an example on the board. If you don't understand a worksheet walk up t and tell her, she will do it with you step by step every time. If you are having trouble grasping a concept, hang around after class, I guarantee that once she's done explaining one-on-one you will leave understanding. She is so good at explaining one-on-one. It's using this process that my friends and I have done so well in her class while everyone else sat there confused. Also, it's through all the one-on-one conversations that we have developed a great relationship with Ms. D. If you do, you will find she is one of the nicest and most accommodating teachers you will ever have.","rating":5,"version":0},{"timestamp":"2019-11-14T04:02:17.532Z","text":"Have her for chem. The way she teaches is a little confusing so you sometimes need to ask for clarification. She messes up the grades at least once (corrects it later) and is a little slow with entering them. Her grading feels a little bit disorganized(?) too. Besides that, the class is actually really chill, and if you finish your work fast enough you can get a bunch of extra credit. The homework and tests are easy, but you may need to do a little self studying. She's nice and very energetic, and I feel she really likes teaching. Overall she's an okay teacher where you don't learn as much as other classes, but I recommend taking her if you want an easy A.","rating":3,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HORRIBLE teacher, but I guess she is nice when it comes to grading if you beg her. super unorganized, unhelpful, unknowledgeable, and overall is forgetful about students. take her if you're smart/ know you're good at math or physics - you'll get an A. if you have trouble learning physics, avoid.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i think she's a pretty good teacher. her powerpoints are clear, however she can't always explain it clearly. she's nice and realy wants you to understand the material n makes sure u understand it i'l reccomend her easy B o A","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very unclear. She forgot to teach us something and a student in my class called her out for it. She said she did explain it. I beg to differ considering the entire class got the same problem wrong. Her tests are ridiculous. They aren't hard, it's just that she gives SO MANY problems. Enough that you're just barely able to make it before class is over. And that's for long blocks. My class is the only short block which is bad because she always assigns her tests on days where we are short.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you really want to learn, with the hard tests and everything, don't take her. She's a really chill teacher, and she's super nice. She'll help you if you need help with any lesson she taught during her free mods. I actually learned in her class, even though many people say they didn't learn anythi","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I like De la Riarte. Despite having somewhat of an accent, she teaches clearly and is willing to answer all questions and explain it clearly. I understood everything quite easily and clearly when I took her Chemistry class.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love ms. de she's a great teacher, but i admit she's very unclear a lot of times but she's new and really tries her best she's very short, so a lot of people take advantage of her. she has very good temper and she curves her tests(which are hard sometimes) she soooo nice i have a 97% il miss ms de","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AVOID HER FOR CHEMISTRY! YOU END UP LEARNING NOTHING! NOTHING NOTHING! TESTS ARE FROM ONLINE SOURCES SO ITS NOT BASED ON THE BOOK.... OUR AVERAGE SCORES ARE LIKE 60-65!!!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is not very clear, her tests are hard, She is really nice tho and if you study by yourself you can get by. i managed to Pull off a B !","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is the worst physics teacher in the department. For me i went from Shapiro who is perfect to her which i regreted. She doesnt no how to teacher real physics, however easy class. you will not learn anything and she teachers from a powerpoint which i find pointless. Overall horrible","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a cool teacher. I enjoyed and learned in her physics class. I will miss your class ms.D","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Do not take her if you have trouble in science. She doesn't teach very well and is often unclear about things. I mostly self-studied and taught myself. I didn't find her tests difficult, but many others did. Her homework is annoying and it effects your grade if you get many questions wrong as she do","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she messes up the tests all the time and she doesn't explain with much clarity so unless you already understand physics she will confuse you so muchSubmitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's okay for a new teacher, she can be unclear sometimes for chemistry, but at least she tries. just read the book if you understand it. her tests are hard sometimes, but not your enitre grade is based on your test. group work counts and group work is extremely easy. labs are pretty easy too. not alot of homework, but she has a accent and it's hard to folllow sometimes. i tihnk she's okay, but alot of my classmates hate her. but i must admit, she's bad at explaining things, so read the book","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. d is awesome...gives plenty of extra credit. Even if u fail a test, the extra credit would probably boosts ur grade up to a B/A. Shes helpful and u can download the lectures online.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's ok.. She gives one hw assignment per chapter, but she teaches very quickly so pay attention! Her English isn't the best, and she can get pretty confusing. Take Cooley if you can! She doesn't teach very well either..Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. D. Peole say she doesn't teach well but I learned a lot. It IS confusing at times what she's trying to say, but she's awesome :D Homework is little, not very hard. Her notes are powerpoints . She posts them up so you can print them out instead of writing them out! Labs are frequent though.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty decent but shes SLOW. if you actually pay attention you might understand. shes nice and really cares about her students. easy A if you do good on tests. she curves the test if everyones grades are low. 50% is a passing on some of the test. so if you wanna slack off you can pick her but its better off if you kinda try. EASY teacher. will let you have a retake just to help your overall grade","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I MISS MS. DE!!! i have ap chem now, and thinking back, ms. de was soo cool and helpful and wanted us to learn she actually knew our names!. but she is extremely unclear which is why i'm trying to re-learn chemistry. her tests are hard sometimes but she curves. she's the greatest chem teacher ever!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She teaches chemistry very well. I learned a lot from this class. She also have a fair grading system. I will surely miss this class.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i'll miss ms. de. she's great! but she's very unclear a lot of times, so you really have to learn from by yourself. she's very nice and will help you until you understand the material. i think she's pretty easy. i have a 97% in her class. her tests are hard but then she curves most people get A o B","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love her class. Her class was fun and exciting with demos and experiments.You should take her chemistry class!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best physics teachers ever!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very nice!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is an OKAY teacher. if you pay attention, do homework and get an okay grade on the test then you would probably get a B but be careful, she don't round up. so dont complain if you get a 89.5 and still not getting a A. she gives about 2 lab a week and some are the tests are decent but pretty hard","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a great chemistry teacher. She explains if you ask her a question. She goes through the lesson quickly but slows down if you tell her that you need help. Overall, a really good class and I like the labs we do.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST chemistry teacher...too bad she doesn't teach physics. but she's sooo nice and really wants us to learn. yes she's very unclear because of her accent, but she's only been here for 3 years. i had her last year, but comparing her to my chemistry teacher now, she was ten times better than him!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. D is so chill. Her tests are straight from her lectures but sometimes she accidentally sneaks a few physics stuff in there.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"have her for physics. HORRIBLE teacher but is really nice. if you're smart, take her. she doesn't make any sense though and make sure you sit with people who will actually help you. choose someone else if you can","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took her for physics and overall she was a nice but fast teacher. You literally have to go over your notes to reteach yourself because she can be confusing. I had a D in her class and she was willing to offer me extra credit if I corrected my mistakes on the homework or other work. Just make sure to pay attention and try being friends with her, she's super friendly.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for physics. She was a nice teacher. She teaches completely off PowerPoint,so if you dont like learning off powerpoint,dont take her! She curves all her tests.AND if you **** at tests,take her! Her tests are easy->reasonable.My C tests barely affected me,and I still had an A.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Overall, she is a pretty easy teacher. She can be very unclear with her accent sometimes, but once you get past that her class is easy. She really does look out for you also. If your class nags her on things like \"we didn't study this\" she usually postpones the tests. Overall, really good.Good class","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She cant really teach all that well but she's easy","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's more on the easy side. Just dont slack off too much in classes. She can be a really nice person! Make sure you note the material she teaches you. Take with friends - a very fun class.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I enjoyed and learned in her physics class. A very nice teacher.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. D is awesome! she is really sweet, and if you do all the hw you will get an A! Tests are not everything, which is really nice. The class is really chill and fun, and i actually have learned a lot. You just have to give her a chance, and you CAN ask if you dont understand","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"okay, she is a horrible teacher very unclear but her labs/homework really boost your grade. Take her if you just wanna chill and not learn.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really deep accent. does fast so u have to ask questions if you want to understand. really sweet teacher but is kind of hard. she recomends that if you dont understand something come during your freemods to understand the material. really is focused on you learning and tries to teach bt fails.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a nice person, and I like her very much, but I didn't learn ANYTHING in her physics class.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had her for Chem 1. She's a really cool teacher and her class is really chill, but she doesn't teach very well. It's really easy to get confused on what she's trying to say. It's an easy A, but you honestly don't learn much. Ms. D is really cool as a person, though. I missed her class so much!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. D is an okay teacher, I guess. If you're not good at science, don't like physics, or not good at math, I say avoid taking her. In class, she doesn't explain things well with clarity, and for her tests, they make no sense. Her homework somewhat helped to prepare for tests, but if you do take her, be prepared to self-study. Her graading also makes 0 sense.I don't recommend you taking her first semester because you'll get lost (if you're not good at science) but if you do, good luck.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher omg! I love her. Shes so chill. Yet you learn stuff. You won't have stress in her class, so you can focus on other subjects more. Definitely should take for Physics!! Easy A, must take.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's sometimes unclear in her directions, but pay attention to her powerpoint presentations, and read the book. as long as you study for her tests, you'll definitely get an A.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a good chemistry teacher. Make sure you ask questions because she'll move on quickly unless someone doesn't get it. Her tests are tricky but easy if you study. She's really nice and can help you a lot after class sometimes.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Love ms D she is the best","rating":3.3,"version":1}],"rating":3.400000000000001}},"__N_SSG":true}