{"pageProps":{"teacher":{"name":"Staci Carney","departments":["English"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Comedy and Satire","block":"2","semester":"Fall2014"},{"name":"Comedy and Satire","block":"6","semester":"Fall2014"},{"name":"AP English Literature and Composition","block":"3","semester":"Fall2014"},{"name":"AP English Literature and Composition","block":"7","semester":"Fall2014"},{"name":"AP English Literature and Composition","block":"3","semester":"Spring2015"},{"name":"AP English Literature and Composition","block":"7","semester":"Spring2015"},{"name":"English 1 Honors","block":"2","semester":"Spring2015"},{"name":"English 1 Honors","block":"6","semester":"Spring2015"},{"name":"AP English Literature and Composition","block":"3","semester":"Fall2015"},{"name":"AP English Literature and Composition","block":"7","semester":"Fall2015"},{"name":"English 1","block":"2","semester":"Fall2015"},{"name":"English 1","block":"8","semester":"Fall2015"},{"name":"AP English Literature and Composition","block":"3","semester":"Spring2016"},{"name":"AP English Literature and Composition","block":"7","semester":"Spring2016"},{"name":"ENGLISH 71 Honors","block":"4","semester":"Spring2016"},{"name":"ENGLISH 71 Honors","block":"8","semester":"Spring2016"},{"name":"English 2 Honors","block":"4","semester":"Fall2016"},{"name":"English 2 Honors","block":"8","semester":"Fall2016"},{"name":"AP English Literature and Composition","block":"3","semester":"Fall2016"},{"name":"AP English Literature and Composition","block":"7","semester":"Fall2016"},{"name":"English 2 Honors","block":"4","semester":"Spring2017"},{"name":"English 2 Honors","block":"8","semester":"Spring2017"},{"name":"AP English Literature and Composition","block":"3","semester":"Spring2017"},{"name":"AP English Literature and Composition","block":"7","semester":"Spring2017"},{"name":"AP English Literature and Composition","block":"3","semester":"Fall2018"},{"name":"AP English Literature and Composition","block":"7","semester":"Fall2018"},{"name":"English 1","block":"2","semester":"Fall2018"},{"name":"English 1","block":"8","semester":"Fall2018"},{"name":"AP English Literature and Composition","block":"3","semester":"Spring2019"},{"name":"AP English Literature and Composition","block":"7","semester":"Spring2019"},{"name":"English 1","block":"2","semester":"Spring2019"},{"name":"English 1","block":"8","semester":"Spring2019"},{"name":"AP English Literature and Composition","block":"4","semester":"Fall2019"},{"name":"AP English Literature and Composition","block":"6","semester":"Fall2019"},{"name":"Comedy and Satire","block":"1","semester":"Fall2019"},{"name":"Comedy and Satire","block":"7","semester":"Fall2019"},{"name":"English 2","block":"1","semester":"Spring2020"},{"name":"AP English Literature and Composition","block":"4","semester":"Spring2020"},{"name":"AP English Literature and Composition","block":"6","semester":"Spring2020"},{"name":"English 2","block":"7","semester":"Spring2020"},{"name":"AP English Literature and Composition","block":"4","semester":"Fall2020"},{"name":"AP English Literature and Composition","block":"7","semester":"Fall2020"},{"name":"Comedy and Satire","block":"1","semester":"Fall2020"},{"name":"Comedy and Satire","block":"3","semester":"Fall2020"},{"name":"AP English Literature and Composition","block":"4","semester":"Spring2021"},{"name":"AP English Literature and Composition","block":"7","semester":"Spring2021"},{"name":"Literature and Psychology","block":"1","semester":"Spring2021"},{"name":"Literature and Psychology","block":"3","semester":"Spring2021"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"Everybody loves her. She's a great teacher, but she has very high standards. I have her class at the end of the day, but it isn't boring at all. She is very enthusiastic and her class has a lot of energy. As I said, she has very high standards; it is extremely hard to get an A in her class.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Carney is definitely a hard teacher, but she also makes time to help her students. She is very good at providing guidance in essay writing and makes her students become better writers. She is somewhat strict in class (no phones, need to take notes) and she's a bit slow to return graded work-- so you might not know your overall grade until late into the semester. Bottomline- take Ms. Carney if you truly want to improve your writing skills and not just get by in an easy English class.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's really helpful and clear on her assignments.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cool teacher. Always makes things clear and is willing to help you. She's also really flexible and understanding and you do learn in her class!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. I had her for english 1hon, and she taught us a lot, without an unfair homework load or grading system. make sure you participate a lot though, because participation per grading period counts like an essay.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for 71H and currently taking her for AP 80/86. I love her. (and her class) Her class is a lot of work, but if you do all the work and try somewhat, you'll be pretty much getting at least a B. If you are one of the english nuts like me who love discussion time, you will love her class. :)","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took her for four semesters of English and loved every semester of it. She's so fair with her grading and she's super nice. I would highly recommend taking her, and she really helps you a lot if you need it.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice teacher. had her for eth lit2 n it was pretty easy A. there were lots of discussions about the reading, which could get boring when no one participates","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. carney is awesome! she is a little tough grading essays, but if you can survive the first essay, use her corrections on that to do better on the next ones. Lots of pop quizzes on reading, not too much work, and she's really nice! Her classes are pretty fun, and she's good at making people laugh.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's really cool! She's really nice, you learn, and she's easy too. She really tries to help you understand the material. She's just a good teacher. Take her!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"boring i sit in first row and fall asleep all the time","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I really enjoyed her class this semester, she really helped me improve on my essay. Freshmen: she gives you two (sometimes an extra later) free \"late\" passes for that day you forget hw. Use them well.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love her! Carney is a great teacher and you'll learn so much from her. Her grading is also fair and reasonable. She's also really nice and will help you improve your writing","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Carney is such an amazing and hilarious individual!! Although your grades are mainly based on your essays, you learn a lot and the discussions are interesting! I love Ms. Carney and wish I could be in her class again.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hard class","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Carney. She is a really sweet person, and a great teacher. Her class is fun and interesting, and she is not a hard grader. She assigns a lot of essays and gives good feedback. She likes people who participate in class, and if you don't you have to do your homework. I definatley recommend her.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"boring and grade essays harshly","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Has her for reg. She hates you if you're late. But extremely nice when we behave. Helpful and informs us very well.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had her for 9th Grade English 1H. Great teacher- engaging, helpful (although late) comments on essays. Good for people who like participating- got my B+ raised to an A based on participation. Not much homework, but when there is home work (especially essays) work really hard. Pretty hard A.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had her for Expository. She's a very friendly and funny teacher. She's willing to help those who ask her for help during her free mods. She grades essays very harshly.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Carney is one of the nicest teachers at lowell. She has never yelled at us or even got mad.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"What can I say about her? She encourages discussion which is good, but she is sort of sarcastic and says your late if you come right on time.Doesn't make sense.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's super easy and extremely nice. i took her for comedy and satire, and her class was really interesting. participate a lot, and you'll do really well in her class. easy A.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hard. grades essays very difficultly, they make up your grade","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's thorough in explaining the assignments and material and will help you further if you just ask. an easy A if you participate","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MS.CARNEY! She is such a wonderful teacher and her class is so interesting! Taking her class definitely makes you a better writer!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Because she was an editor, she will help you massively improve your essays. Participate and ask for help. 71H wouldn't have been bearable without her.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP80/86 She's great to talk to. Nice. Did I feel like I learned how to improve writing? No. In fact, I felt even more lost after her class, but I got a 5. Unnecessarily hard on essays.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love her class!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i agree. the first essay is the worst, MEET WITH HER after your peer review and she'll give you a grade up, i swear. do your homework. participate. A. definitely an easy B if you don't really care, just follow directions blindly.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is the most FAIR teacher ever. she never favors and she loves everybody in the class. shes really nice. easy A. i took her comedy and satire class so i guess its natural that you dont really learn anything new? definitely try to get her if you can.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easiest... class...ever","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's really nice but you have to write good essays","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"com and satpros: really fun class, wont get boredcons: too much explaining blahblah blah and strict deadlines =(","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Dropping from AP English to Comedy and Satire, I really didn't expect to enjoy the class or learn much, but Ms. Carney made classes as enjoyable and as insightful as an AP class, but just without the strenuous workload and difficulty. She's the best non-AP English teacher I've ever had.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I like how she explains how she wants her essays unlike other teachers and really goes through grammar and basics first. but her class is a little too hard and barely anybody gets As. She's pretty nice and funny though, so if you don't mind a B in english w/ good help, take her. If you want an A, go","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"LOVE THIS TEACHER","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Excellent teacher, everything you want as a student:Clear, fair, reasonable, great sense of humor. Plenty of easy points, and then your essays make your grade. Fun class, lots of discussion, little homework, great teacher.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"fun reg teacher =D lets us eat and talk. people don't listen to her much though. she try the best to help if we have any questions","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"It's different writing for Carney than it is for college classes. Wish her AP classes taught how to write papers on subjects other than literature.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Eng Honors. She's a nice person and a really good teacher but she grades soo hard. She gave me my first B at Lowell. Semester grade is 80% of the 3 big writing assignments you'll do, participation 15%, quizzes/worksheets/anything else 5%. Unfair because she's a hard essay grader and the only people who participate in class are english genuses (participating isn't just answering/asking questions you have to analyze the reading and initiate where the class discussion goes)Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's willing to help, and she honestly cares about her students","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy B. u have to work a little harder for the A but its not too hard. extremely boring. u find urself sleepy most of the time. she's a nice teacher and is helpful","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"love her!she helps u and really cares about u (she spent so much time wit me afterclass to help me understand the subject. Oh and she loves talkative ppl so if u love to speak out this is the class 4 u (I got an A for my participation points) YES!!!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"So hard... Essays worth 100 points.. while quizzes are worth 5.. her class is hard hard.. but i guess its interesting.. watch out for pop quiz.. read when she assigns it as hwrk..","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms carney is a great teacher. really nice and willing to help if you need it. most of her grade consists of essays, which are rather hard. easy b, a bit harder a, but it's not that bad. get her if you can","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Love her. She's such an awesome teacher. I had her for 10th Grade english. She's always helpful, FUNNY, stamps homework =/. My class always said, \"Good Morning Ms. Carney.\" It was like a funny wake up call. I always looked forward to her class. Homework is mostly reading, sometimes there are questions, and sometimes during class, she passes out papers, and you get into groups for presentations, it's most likely from last night's reading. Her class is awesome.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Was easy, until she made us write essays (i think no one got an A on it). nice though. She is also a very good teacher, that's why my comment is written in such a professional manner:)","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she grades essays really hard which kind of makes up your'e whole grade. willing to help you during your'e free mods. class is boring.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"one of the best english teachers at lowell and u really learn to write better. dont take her class if ur planning to slack off. lots of work and pop quizes","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP: She is such a harsh grader. I felt like her standards were ridiculous and she favorites people. The AP test is hard, but not like how she teaches her class. She gave me a B for the final grade but I got 5's on AP Lang AND Lit. Talk about grade overkill and ruining my GPA. I don't take her motherly tone seriously, it's just so that you'll treat her nicely when she slaps a B on your report card. True, she'll help you if you talk to her.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Any English class at lowell is a easy B and hard A, right? I had Ms. Carney for Comedy and Satire and there usually isn't very much homework. Just pay attention and do all your work even if you don't do them well and you'll slide by with a B. if you're a good writer or if you work harder, maybe you'll get an A. But who cares about grades.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes cool, but shes soooo boring. be ready to bring a pillow to class. homework quiet often too...","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She honestly was one of my favorite teachers in freshmen year. pretty much impossible to get an A in, unless you wrote mind-blowing essays, yes, she makes you participate. just raise your hand at least two times evry weeks and you're good. hard, but she makes english pretty interesting. take her!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Carney is a hard but fair teacher cuz she grades essays harder than some other english teachers, but very helpful.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For Eng1, she was great. Very nice and curves sometimes. It takes a while to get back essays but she puts good input into it. You have to talk at least a little, but she's not as hard as some of the other teachers. I got a C for participation but still got an A-. She's a definite recommendation. She can be funny and sarcastic with some interesting facts like cousin marriages...","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's easy, nice, and actually teaches. You can get an A, whether you work for it or not depends on who you are, but I didn't find it that difficult to get an A. She's soo cool! Great English teacher and really helpful","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a great teacher but a hard grader with very high standards. You might think you are doing well until you get your report card.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Amazing teacher. Super nice and always sweet, and gives you homework passes that you can use to either skip an assignment or to extend the deadline on your essay. She also canceled our com and sat final","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"So Ms. Carney is actually such a sweet person. What I don't understand is that I constantly turn my homework in on time and I have a friend who turns hers in late usually and she has an A in the class and I have a B-! She grades really hard. You always need to use quotes and carefully read directions.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"boring as \"heck\" Picks on people who talk. Called on me at least three times a day when my hand wasnt raised, while other kids got to zone out. Participation not counted for grades","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"one of my favorite english teachers! i love ms.carney she really teaches & explains things well. encourages me to participate. you'll really learn alot in her class, shes really nice but doesnt let you eat :[... everyone gets there early, so if you're tardy, everyone will stare at you ... -___-\" dont be late . i do remember falling asleep a couple of times in her class and i sat in the front! she wasn't that boring tho :] definately would take her again,why doesnt she teach 10grade2H ? :[ boo...","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is very nice. she doesn't give too much work, but she grades essays very harshly. you always have to do the reading, too, because she gives pop quizzes","rating":4.5,"version":1}],"rating":4.5}},"__N_SSG":true}