{"pageProps":{"teacher":{"name":"Steven Shimmon","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Psychology","block":"2","semester":"Fall2014"},{"name":"AP Psychology","block":"4","semester":"Fall2014"},{"name":"AP Psychology","block":"6","semester":"Fall2014"},{"name":"AP Psychology","block":"8","semester":"Fall2014"},{"name":"AP Psychology","block":"2","semester":"Spring2015"},{"name":"AP Psychology","block":"4","semester":"Spring2015"},{"name":"AP Psychology","block":"6","semester":"Spring2015"},{"name":"AP Psychology","block":"8","semester":"Spring2015"},{"name":"AP Psychology","block":"1","semester":"Fall2015"},{"name":"AP Psychology","block":"3","semester":"Fall2015"},{"name":"AP Psychology","block":"5","semester":"Fall2015"},{"name":"AP Psychology","block":"7","semester":"Fall2015"},{"name":"AP Psychology","block":"1","semester":"Spring2016"},{"name":"AP Psychology","block":"3","semester":"Spring2016"},{"name":"AP Psychology","block":"5","semester":"Spring2016"},{"name":"AP Psychology","block":"7","semester":"Spring2016"},{"name":"AP Economics","block":"4","semester":"Fall2016"},{"name":"AP Psychology","block":"1","semester":"Fall2016"},{"name":"AP Psychology","block":"5","semester":"Fall2016"},{"name":"AP Psychology","block":"7","semester":"Fall2016"},{"name":"AP Economics","block":"4","semester":"Spring2017"},{"name":"AP Psychology","block":"1","semester":"Spring2017"},{"name":"AP Psychology","block":"5","semester":"Spring2017"},{"name":"AP Psychology","block":"7","semester":"Spring2017"},{"name":"AP Economics","block":"7","semester":"Fall2017"},{"name":"AP Psychology","block":"1","semester":"Fall2017"},{"name":"AP Psychology","block":"3","semester":"Fall2017"},{"name":"AP Psychology","block":"5","semester":"Fall2017"},{"name":"AP Economics","block":"7","semester":"Spring2018"},{"name":"AP Psychology","block":"1","semester":"Spring2018"},{"name":"AP Psychology","block":"3","semester":"Spring2018"},{"name":"AP Psychology","block":"5","semester":"Spring2018"},{"name":"AP Economics","block":"5","semester":"Fall2018"},{"name":"AP Economics","block":"7","semester":"Fall2018"},{"name":"AP Psychology","block":"1","semester":"Fall2018"},{"name":"AP Psychology","block":"3","semester":"Fall2018"},{"name":"AP Economics","block":"5","semester":"Spring2019"},{"name":"AP Economics","block":"7","semester":"Spring2019"},{"name":"AP Psychology","block":"1","semester":"Spring2019"},{"name":"AP Psychology","block":"3","semester":"Spring2019"},{"name":"AP Economics","block":"5","semester":"Fall2019"},{"name":"AP Economics","block":"7","semester":"Fall2019"},{"name":"AP Psychology","block":"1","semester":"Fall2019"},{"name":"AP Psychology","block":"3","semester":"Fall2019"},{"name":"AP Psychology","block":"1","semester":"Spring2020"},{"name":"AP Psychology","block":"3","semester":"Spring2020"},{"name":"AP Economics","block":"5","semester":"Spring2020"},{"name":"AP Economics","block":"7","semester":"Spring2020"},{"name":"AP Economics","block":"3","semester":"Fall2020"},{"name":"AP Economics","block":"4","semester":"Fall2020"},{"name":"AP Psychology","block":"1","semester":"Fall2020"},{"name":"AP Psychology","block":"7","semester":"Fall2020"},{"name":"AP Economics","block":"3","semester":"Spring2021"},{"name":"AP Economics","block":"4","semester":"Spring2021"},{"name":"AP Psychology","block":"1","semester":"Spring2021"},{"name":"AP Psychology","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"(2013) Shimmon is a great teacher. In fact, all the AP Psych teachers are great. Shimmon is incredibly creative and energetic. His lectures are excellent, and he doesn’t make you read the book. Kwong is lively and experienced, and she’s very knowledgeable about psych","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's the coolest teacher ever! He's very entertaining and actually teaches you the material.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hilarious. Universally a great teacher. No homework, but you DEFINITELY have to study if you're going to get an A. meow!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very cool guy. Good sesne of Humor. Entertaining while sitting in, in Euro class.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he...likes...hello...KITTY! omg, and he is like 35!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the best teacher ever. you have to take him. great at lecturing and you'll learn a lot. very fair and kind grader.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nooooo! his student teacher is teachin next semester!!!!! but he's really fun n cool n quite easy. btw... the student teacher is at 9/10 and she's not as cool","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"everyone raves about his quirkiness but kwong and michels actually prepare you for the test. his easy As could lead you to a 2.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shimmon is the best teacher i had all year, fo realll. he is so funny, and his class is super easy AND you learn a lot. win-win-win situation!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SHIMMON FOR PRESIDENT!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"definitely one of the coolest teachers to have","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i was lucky enough to get shimmon for mowo.he made many opportunities to get an A and hes really chill and funny.he's a great teacher and i highly recommend him.(:","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MR.SHIMMON'S AP PSYCHOLOGY CLASSHE'S AMAZING. TAKE HIM. LIFE CHANGING CLASS :)","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"teaches really well. very organized, and super cool.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome psych teacher. he explains everything really well, and his class is so funny.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Amazing teacher and person! I hated Lowell but Shimmon made it worth going. He's super helpful, funny, and makes class interesting with his stories. He wants you to succeed and always provides reasonable accommodations if needed, so don't hesitate to ask him for help. He preps you well for the AP exam with his tests and study guide. Got an A in the class and 5 on the AP exam! It's a must-take class! And though I think the other psych teachers are awesome, Shimmon is definitely a one of a kind!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is the best teacher I've had at Lowell. Life does not get any better. I had him for psychology. Just study for the tests, do the journals, and you'll get an A. Countless extra credit opportunities, though often random. He will actually remember everyone's names within the first few weeks.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shimmon is the best. I have been insipired by him to major in psychology :D I felt totally prepared for the test!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Dude Mr.SHimmon is the mannn. Teaches stuff really well AND very very very fun class and energetic. Once he walks into the room the whole class is fun already. If you pay attention, which is not hard to do in his class you will defintily get an A. This is the one class you will never sleep in. Best Teacher IN LOWELL by far.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i would take him if he didn't have a stupid student teacher...i heard hes really good and funny","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"there is no rating high enough for this dude...amazing...tests are easy if you listen, great personal style (signs re-admits with smilie faces...funnest and funniest teacher around","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took his class 2 years ago for AP Psych, and in comparison to my college professor, he is a much more interesting and good teacher. If it hadn't been for him, I would've hated my psych class right now.TAKE HIM FOR AP PSYCH!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you don't take Shimmon's AP Psych class, your Lowell experience is incomplete. He really knows his stuff. He may teach you more than you need to know, but you can't deny the fact that it's interesting. Grade mostly based on tests, so be sure to ask him for help before the test if you need it! Quirky lectures. Warning: his classes close extremely quickly at arena","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"all you have to do is take good notes and speak up in the class and you're guaranteed an A","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is by far one of the best teacher i have ever had in my life. His lecturres are concise, and to the point and everything he explains is supported my an example. This class is fun and interesting and you will never go to sleep . I look foward to this class everyday and you must get in for AP PHsyc","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MR SHIMMON!! I took him for AP PYSCH! I would say he's the easiest A out of all the pyschology teachers. His outlines are extra credit, and his classes are super fun. I GOT a 5 on the EXAM. If you have a choice, pick him!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a great teacher. I have him for Modern World 2. There's no way you could even get a C in his class.....","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE THE SHIM!so awesome he honestly just brightens up my dayplus he like to create really helpful analogies and skits which make all the terms really easy to understand/ remember!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's the best teacher ever! the things he teach really sink in because he teaches it so well!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is funny but he really teachs well. I barely studied for the AP psychology test but still got a 5 since his notes are so useful. HIGHLY RECOMMEND!!! over any other teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best teacher ever","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fascinating; alternative; knowledgeable; creative; smooth point system; pleasant memory of his class.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shimmons is the greatest teacher ever! He's a really good teacher who actually knows his stuff. Great sense of humor and the coolest hats and his classes are FUN AND EASY!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i have no idea how is class is like, im in his reg and he lets us watch cool movies, good sense of style, his hats r nice","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Whoa! Mr.Shimmon is THEE coolest! I LOVE YOU MR. SHIMMON! :)","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher.. tests are sometimes hard though..","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I absolutely love Shimmon! Every single day I just enjoy going to his class. He has inspired me to pursue a major in psychology. He always wears a hat every day (I love his grey hat) and he is awesome","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Do all your work and get no lower than a B","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ur soooooooooo cool n i miss being in ur class ilove you mr.shimmon","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the other psych teachers teach better, hes easy but does not really prep you well for the ap exam.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a cool teacher and i think the lowest grade he will give out is a C.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is a cool teacher. he is one of the easiest modern world teacher in this school. if you takes his class 90% that you would pass the class.thetest are opennot","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cool teacher. Overall, class is easy and you learn a lot. Shimmon makes learning fun.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best there is, and ever will be. Not only does he deliver all the information perfectly, he makes classtime fun with silly anecdotes and interesting random facts.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's awesome, totally hilarious, a perfect teacher in every way. it's too easy to get an A. i wish he would have made his work slightly more difficult so we actually tried more.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"what a great guy and teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shimmon, thank you for not shying away from teaching the \"darker\" side of history. Thank you for introducing us to Howard Zinn. Thank you for caring. He is a gem! (student from Class of '02)","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best class I've taken at Lowell was psych with Shimmon. Hands down.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"although i never took him, he would sub for mrs. kwong occasionally. he definitely knows psych well! hes quite an interesting person - very quirky. and you got to love those hats!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's the best... u can relate 2 him in anyway... if you have any problems (i.e. home, social, wutever) he's the guy 2 talk 2!!! cool guy!!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Shimmom for Modern World. He teaches you a lot and is funny! He connects history to current events. His tests are easy and you can outline the book for extra credit each time there is a test","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best teacher/student experience ever. i got a 5 on the AP psych test because of him.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"not even kidding, he and schwarz are the BEST BEST BEST teachers I've every had, the professors in college are so boring, i miss his classes, it was so fun and he gives out hi chew! such a great teacher with very funny stories as well. not a lot of work and tests are quite easy. love hello kitty!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"did he prepare u guys well for the ap test? hes a great fun teacher and u will laugh and love psych","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shimmon is one of the best people/teachers EVER!! He really knows the material, is very friendly and funny, and always makes class fun. I've learned a lot from him and I'm really going to miss his class. If you get the chance to take him don't hesitate b/c his classes fill up fast!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he makes going to class fun. his lectures are very interesting and funny. right now,i think he has an obsession with hello kitty, his room is decorated with hello kitty stuff. Having him as a teacher is a guarantee that you will laugh and LEARN in his class. overall, GREAT teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr shimmon ROCKS. u cant fall asleep in his class, hes so funny.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AP psychology with Mr.Shimmon is the best class I've taken at Lowell. Definitely recommend him! He's informative and funny! prepares you for tests! no homework!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shimmon is a very good teacher. He loves to teach and is enthusiastic. Other teachers at the school should be mentored by him and learn a thing or two about teaching, especially the math teachers at the school. He uses creative teaching methods to help the kids learn.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is very amusing. Everyday, he gives us some bonus points if we do very weird stuff like doing a hula loop for two minutes or balancing a book on our heads","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the Best teachers at Lowell! His class is enjoyable and I look forward to it every day!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. very fun. he makes the class very enjoyable, and the class ddiscussions are very helpful. sutdy and do ur assignments (very easy) and easy pass","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"So inspiring! Not only is he excellent in that he's organized and knows his material, but Mr. Shimmon is a wonderful person- hilarity, wisdom, and thoughtfulness all rolled into one neat package. Take him if you're lucky enough for the chance.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is the best thing that has ever happend to me. He is soo good and supports everything he says with examples. He makes learning fun. Because of him i might consider a degree in Psychology. And he is soooo funny, there is not one day when i didnt laugh in class. i Left my heart in his class!!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Litteraly the best thing about Lowell","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ONE OF THE BEST TEACHERS I EVER HAD AT LOWELL, I LOVE THIS CLASS AND HE TEACHES SO WELL. HIS TEST ARENT THAT HARD, AND THE ONLY HOMEWORK ARE JOURNALS. TAKE HIM , YOU WONT REGRET IT.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. shimmon is great! we begin every class with music from somewhere in the world. personal antidotes and enthusiam make a subject that's dull total fun.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Omg....you must have him. He's soooooooo hilarious and he's a great teacher. Easy A too.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shimmon is THE best teacher ever (along w/ Mr. Granucci). He is so funny! When we watched Pocahontas in class for Modern World, he danced on the desks and sang out loud!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher but you need to work and study for an A.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MR.SHIMMON!!!!!!!!!!! His class is my favorite class of the day and i always look forward to it. The tests are pretty much what he goes over in class and if you do the extra credit it gives you 5% more each test you do the extra credit for. HE'S AMAZING!!!!!!!!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Of my 12+ years of education, Mr. Shimmon is one of my best teachers and whom I will always remember! I took him for AP psych and he made the class so fun that I was inspired to become a psych major. As an instructor, he's very clear, helpful, and fair, and as a person, he's just awesome!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i LOVE mr. shimmon. i was so lucky to get him for modern world. best and easiest teacher. i learned so much and barely had to study for tests. you can make up anything and lots of exrta credit chances","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"coolest teacher ever! he makes psych fun and interesting. getting an A isn't too hard as long as you study for tests. you learn a lot too.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"What? his student teacher is teaching? argh...","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shimmon is one of the best teachers! Just take his notes, read the chapter, and you have an A! He makes it interesting.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My reg teacher. Super cool. Once during an earthquake drill, he ran around the room throwing gluesticks and told us the sky was falling.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best teacher ever. Funny guy and class is very interactive. Easy but you learn a lot. Highly recommended.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best... Teacher... EVER.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr shimmon is the most creative teacher at lowell. his class is fun and enlightening. he's also very helpful and takes time out from his lunch to teach you.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shimmon is the funniest, most entertaining teacher EVER!! I always looked forward to his class and laughed my head off everyday. I learned a lot too and it was just the best class of the day.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Shimmon is a really great AP Psych teacher. We rarely get any homework and he makes the class very fun and entertaining. No one can fall asleep in his class. Everyday, his class always seem to brighten up my mood everyday, definitely recommend him.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr shimmon will always be the best teacher ive ever had. very clear and very good examples. makes class fun and interesting. you'll never fall asleep when hes teaching!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Shimmon is my FAVORITE TEACHER at Lowell. I had the best Junior year with him in AP Psychology. He prepares you well for the AP test. His extra-credit outline policy rocked. He LOVES Hello Kitty and has one of the most eccentric personalities. LOVELOVELOVE Shimmon!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a great teacher and really puts a lot of effort into his teaching.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"THE BEST TEACHER EVER. You learn AND you have have fun. You're actually engaged in the class. What more can you ask for? Definitely the BEST teacher at Lowell.","rating":4.7,"version":1}],"rating":4.699999999999993}},"__N_SSG":true}