{"pageProps":{"teacher":{"name":"Steven Schmidt","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2016","Spring2017","Fall2017","Spring2018"],"classes":[{"name":"American Democracy","block":"4","semester":"Fall2014"},{"name":"American Democracy","block":"5","semester":"Fall2014"},{"name":"American Democracy","block":"7","semester":"Fall2014"},{"name":"World History","block":"1","semester":"Fall2014"},{"name":"World History","block":"3","semester":"Fall2014"},{"name":"American Democracy","block":"4","semester":"Spring2015"},{"name":"American Democracy","block":"5","semester":"Spring2015"},{"name":"American Democracy","block":"7","semester":"Spring2015"},{"name":"World History","block":"1","semester":"Spring2015"},{"name":"World History","block":"3","semester":"Spring2015"},{"name":"United States History","block":"1","semester":"Fall2016"},{"name":"United States History","block":"3","semester":"Fall2016"},{"name":"AP United States History","block":"5","semester":"Fall2016"},{"name":"AP United States History","block":"7","semester":"Fall2016"},{"name":"United States History","block":"1","semester":"Spring2017"},{"name":"United States History","block":"3","semester":"Spring2017"},{"name":"AP United States History","block":"5","semester":"Spring2017"},{"name":"AP United States History","block":"7","semester":"Spring2017"},{"name":"American Democracy","block":"1","semester":"Fall2017"},{"name":"American Democracy","block":"3","semester":"Fall2017"},{"name":"AP United States History","block":"5","semester":"Fall2017"},{"name":"AP United States History","block":"7","semester":"Fall2017"},{"name":"American Democracy","block":"1","semester":"Spring2018"},{"name":"American Democracy","block":"3","semester":"Spring2018"},{"name":"AP United States History","block":"5","semester":"Spring2018"},{"name":"AP United States History","block":"7","semester":"Spring2018"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"<3","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"History is so boring but Mr Schmidt makes it worthwhile. His lectures are amazing and will keep you awake. I wouldn't say that he's the nicest teacher but He's super super funny. don't take his class if you're sensitive to jokes tho. Tests are easy as long as you study. You just gotta memorize stuff. Barely any homework except for a little readingSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best teachers at lowell. He genuinely cares for the students, discipline is a form of love. He picks on people, but that means he likes them, and its never to an inappropriate point. He curves grades at semester time. He's fair, funny, and an overall great teacher.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a cal alumni. SO DON'T GET UP IN HIS FACE IF YOU'RE A STANFORD FAN! be a cal fan, talk to him bout cal football.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Schmidt is legit the BEST history teacher at Lowell. He's been there the longest and knows what to teach and to test on. His lectures are interesting and help you learn. Mr. Schmidt come back, we need your loud lectures and music before class. Lowell isn't the same without Ms. Schmidt. #bringbackschmidtSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The most humorous, no filter teacher in the entire school and everyone at Lowell should experience his class! He will give you good info for the AP but didn't really prep us exam format wise (perhaps he'll step up his game next year). His grading system is kinda wacky...first school loop then let us choose our own grades then didn't give us any indication. Don't dream of an A if you don't participate. This was my favorite class but Prophet is a better preparer if you're into thatSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best teacher ever.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The \"m\" is the most important letter in his name. DO NOT say his name without the m, hes a huge beatles fan and is very, very loose with grading, its pretty much an easy A-","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Unreasonable amount of work in US Hist, no work in US Gov. He's lazy, too. Waste of time.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Gave whole class A's for showing up after AP exams. Unbelievably lazy.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take him much better than anyone else especially Bellville","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Amazing and hilarious teacher. Not so easy, though, but that should be a good thing. Almost guaranteed a 5 on the APUSH exam if you work hard. Arguably the best APUSH teacher. (good teaching skills, but it ain't gonna be easy)","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best social study teacher ever!!!!!!!!!!!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Schmidt is great he's super knowledgable about history and makes it really fun and interesting to learn (but don't take him if you are easily offended or intimidated) He plays music before every class and then basically lectures the whole time BUT his lectures are always hilarious and super engaging. He's also an easy A/B especially if you PARTICIPATE. there's only like one or two tests/quizzes PER SEMESTER, and tests are usually all multiple choice and pretty straight forward.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Try not to be late to his class. He really hates it. I don't think he's too hard since he curve quite a lot at the end of the semester. You have to do outlines, but you should be able to get some help from coursenotes.org.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hhahaah. not that easy, but definitely fun. u'll laugh everyday in his class at least 3 times. makes life at lowell fun u no. not an easy A but still, brightens ur day.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is really funny and does all these dances and voices to help us remember the stuff. picks on people but it means he likes you. need to partcipate cuz its 15% of your grade","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hes a great Moder world teacher! his lectures are the least boring out of all the teachers i have! He is kinda lazy and always sings which gets annoying after about a week but overall, as long as you pay attention during the lectures participate, its an easy B.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is better than Bellville. She doesnt even teach. Must take him.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Schmidt is such an amazing teacher for APUSH! Take him if you can. He does give a good amount of work, but if you're aiming to get a 5 on the AP test. I highly recommend him! He is real with his students and really enthusiastic. Perfect to start your morning, and you learn so much!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. schmidt is nice, but he makes u talk a lot in class, and he has a logical, reasonable grading system... just participate and pass his tests","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Has to be one of the funniest teachers ever. He dressed up as SNOW WHITE for Halloween?!? HIs world history class was pretty easy. I got roughly 10 homework assignments no joke. Raising your hand and being active is 20% of his grade and he only gives one test and up to 2 quizzes every 6 weeks. Got to love Mr. Schmidt","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Schmidt Rules! 5 on AP, free semester A, 2nd Semester for attending class after APs. You will learn if you pay attention. He cuts class more than students did Spring 05.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"class is somewhat fun. lectures are pretty interesting but i know quite a few people who used this class as nap time. people get picked on. oh and he plays favorites... that's really obvious.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"got As both semester. got a 5. and we learned the Carlton! what more can you want?","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Participation is worth a lot!Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is not the right sponsor for the LSA. While meeting a group of parents during an Open House event, he actually said that he hated teaching the Leadership class. How does this inspire our children?","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Schmidt is absolutely an amazing teacher. People get scared of him, but don't be intimidated. Participate in class CONSISTENTLY, don't be late, do all the work, and listen to him in class (his lectures are exciting). I learned so much in his class and still remember a good deal of what I learned","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take him for APUSH. People are generally intimidated by him and will rush to get Prophet during arena because he's \"easier\" but you can't go wrong with Schmidt. His quirks during lectures help you remember the material long after it's taught. Quizzes and tests can be tough, but your GPA will not be","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher who actually makes US History interesting. An easy A for all of you GPA-whores out there if you do the work but he pushes people to participate in class which is a good thing since it makes the class interesting. All in all, a very very interesting class that is a surefire highlight of a very dull and bland junior year. And even if you aren't a Cal Football fan (which you should be with a fantastic back like Forsett), just remember these two very simple words: GO BEARS!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hes a rly good teacher but quizzes tests r rly hard. learned a lot though,","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Yeah, he's pretty much insane. That said, you'll learn a ton and most likely get a 5 on the AP. Class is never boring but the outlines do pile up sometimes. Take him if you can, he's usually gone by 5-6th pick.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He has issues. And should not take his anger out on students. He is very unusual and sometimes is misinterpreted and tries to be funny too much when he is not.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. lectures are NOT boring and everyone gets involved. he reviews all the answers b4 a quiz n tests require little to no studying. was absent a few times and also sometimes lazy so he just makes you do section reviews. overall easy a. just make sure to be involved, which isnt a hard task for his class","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really fun class discussions, good lectures, but hard grader. he's a great person to talk to though...just get on his good side!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of my favorite teachers! Mr. Schmdit is really funny and has clear interesting lectures. No homework for regular USHistory, just participate and pay attention during lectures to do well on tests, they aren't that hard. Music at the beginning of class is nice except for Colonial Music week.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"take him! i know arena is over haha so i guess this is for next year.. pretty easy A, really big curve for semester grade (not quarter but i guess it doesn't really matter) and you end up learning a lot even when you dont feel like you are. i felt prepared for ap test and and especially sat subject. you will probably get stressed in his class once in a while but its not worth it. you'll probably get an A in the end if you at least try a little bit and participate. 10% of grade","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had him for modern world in freshman year. really cool teacher. extremely enthusiastic, plays loud music before class. it wakes you up and you'll never get bored during his lectures b/c he's so passionate and dramatic. sometimes gives hw from the book, a few quizzes (easy ones!) and tests(moderately easy if you study), and one or two projects. participation is 15% of your grade, so participate 15 times every grading period. mr. schmidt is really awesome. haha.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take him if you want to have a lot of fun. Don't take him if you don't like participation or watching people get picked on. He can get lazy sometimes and just not show up, or be in a \"mood\" and kick desks.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Honestly Mr. Schmidt was the best history teacher I've ever had. He makes learning history actually understandable and funny. I still remember his lectures on World War 1 and 2 to this day when I took his class 3 years ago. He's so nice and enthusiastic. Best history teacher at Lowell and in the city. He's probably one of the only history teachers thats stayed for a long time, and is super hard to get during arena. Overall, highly reccomend Mr. Schmidt.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's the best teacher in Lowell hands down. He knows what he's teaching and is in no way shy. Unlike half the teachers in this god forsaken school, you can't fall asleep in his class due to his great lectures.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher. He is enthusiastic in teaching his kids. Before the day of a test, read the chapter once and the notes you jot down for his class once (you better), and you'll score an A. Overall, great teacher! Learned lots.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best REG teacher ever! :]","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST TEACHER NA","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"do not take him if you have a problem with being late or participation! anyway I've had my ups and downs with mr schmidt... sometimes I really couldn't stand him but I actually love him... does that even make sense ?!?! i love his jokes and he's actually a really caring teacher. we've only written 2 DBQs the whole year and I felt pretty relaxed during the AP test. not that hard for an A, he curves grades. I would recommend him.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Overall a great APUSH teacher. I felt extremely prepared for the AP test. No curves until the end of the semester, but don't count on it. Studying is necessary!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Most history teachers are really boring when lecturing. Mr.Schmist actually goes out his way to make his lectures interesting so you will pay attention. He barely gives hw and goes over the test qustions before the day of the test. If you take notes and study your notes, you will do fine in his tes","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good teacher but his tests are very hard. Must participate for an A. Despite his intimidating demeanor, I truly looked forward to going to his class everyday and never dreaded it except for the tests. Very entertaining but inappropriate at times","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AmerDemo. Be flexible with Mr Schmidt. Stay on good side. Participate and show your good character. You'll have a good relation. Dont be late, run to class. Community service 20 hours. Get A in class","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is really funny, i would take him again BUT his grading system is TOO strict. He makes you talk A LOT in the class, if you don't it's already an automatic B","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a great teacher but he's not an easy A. His outlines are time consuming, but well worth it when you see a 5 on your AP test. He keeps the class entertaining and he's really funny. He wrote my teacher recommendation letter for college and I got in to all every college I applied to. He of course credits his letter. If you want to learn, work hard and love history, you'll enjoy your time with him.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is very knowledgeable and prepares you very well for the APUSH exam. He can be a egotistical at times, but his lectures make up for it. He requires you to participate in class to get an a for grading periods, but as he says, \"He's not in the business of ruining people's GPAs\" and will usually not","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He/his class is a little intimidating. It makes me/a lot of my friends in my class very nervous to say something without fearing being shot down or something. Other than that, he's pretty entertaining and isn't deathly boring like some teachers. His lectures are good also.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"open-not quizzes once a week & 1 test per grading period which are mult. choice & an essay. He's really funny. gives out ex cr. participation is key (he counts)","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"pretty easy and funny","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's the BEST for APUSH. He starts off with a lot of hw, but later on, gives less than other teachers. HOWEVER, he's phenomenal when teaching in class and his quirks really do he you when you're taking the AP test.Most people got 5s on the AP;he's got the highest % of students witlph 5s.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a great lecturer. he's interesting. a lot less boring then michels. i had him for 2 semesters. free semester A, i got a 5 on the exam. he was hardly in class. he sings a lot too. that might get annoying.","rating":4.5,"version":1}],"rating":4.5}},"__N_SSG":true}