{"pageProps":{"teacher":{"name":"Theodore Johnson","departments":["Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019"],"classes":[{"name":"AP Biology","block":"6","semester":"Fall2014"},{"name":"AP Biology","block":"8","semester":"Fall2014"},{"name":"Principles of Biotechnology 1","block":"2","semester":"Fall2014"},{"name":"Principles of Biotechnology 1","block":"5","semester":"Fall2014"},{"name":"AP Biology","block":"6","semester":"Spring2015"},{"name":"AP Biology","block":"8","semester":"Spring2015"},{"name":"Principles of Biotechnology 1","block":"2","semester":"Spring2015"},{"name":"Principles of Biotechnology 1","block":"5","semester":"Spring2015"},{"name":"AP Biology","block":"3","semester":"Fall2015"},{"name":"AP Biology","block":"5","semester":"Fall2015"},{"name":"AP Biology","block":"7","semester":"Fall2015"},{"name":"Principles of Biotechnology 1","block":"8","semester":"Fall2015"},{"name":"AP Biology","block":"3","semester":"Spring2016"},{"name":"AP Biology","block":"5","semester":"Spring2016"},{"name":"AP Biology","block":"7","semester":"Spring2016"},{"name":"Principles of Biotechnology 1","block":"8","semester":"Spring2016"},{"name":"AP Biology","block":"2","semester":"Fall2016"},{"name":"AP Biology","block":"6","semester":"Fall2016"},{"name":"AP Biology","block":"8","semester":"Fall2016"},{"name":"Principles of Biotechnology 1","block":"4","semester":"Fall2016"},{"name":"AP Biology","block":"2","semester":"Spring2017"},{"name":"AP Biology","block":"6","semester":"Spring2017"},{"name":"AP Biology","block":"8","semester":"Spring2017"},{"name":"Principles of Biotechnology 1","block":"4","semester":"Spring2017"},{"name":"AP Biology","block":"2","semester":"Fall2017"},{"name":"AP Biology","block":"4","semester":"Fall2017"},{"name":"AP Biology","block":"5","semester":"Fall2017"},{"name":"AP Biology","block":"8","semester":"Fall2017"},{"name":"AP Biology","block":"2","semester":"Spring2018"},{"name":"AP Biology","block":"4","semester":"Spring2018"},{"name":"AP Biology","block":"5","semester":"Spring2018"},{"name":"AP Biology","block":"8","semester":"Spring2018"},{"name":"AP Biology","block":"2","semester":"Fall2018"},{"name":"AP Biology","block":"4","semester":"Fall2018"},{"name":"AP Biology","block":"5","semester":"Fall2018"},{"name":"Biology","block":"8","semester":"Fall2018"},{"name":"Biology","block":"8","semester":"Spring2019"},{"name":"AP Biology","block":"2","semester":"Spring2019"},{"name":"AP Biology","block":"4","semester":"Spring2019"},{"name":"AP Biology","block":"5","semester":"Spring2019"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"Its about time that Lowel science dept. had new minority science teacher and a good one at that. I thought he was a lot of work but he´s good, approachable, and overall, a nice teacher.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's an alright teacher in my opinion. He's cool, but gets off topic constantly. He jokes around a lot...but never gets more them smiles out of the students. He picks on new students in his class. And he asks for too much(PERFECT participation, hw, and test scores) He also has this thing on his righ","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a super organized teacher. He grades are calculated down to the last decimal. It's pretty hard to get an A overall in his class, because his finals are pretty hard, but if you keep up with the reading you're fine. ALWAYS do the homework, because if you miss one, your grade goes down a lot.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love mr. jonhson! he is my favorite teacher at lowell. He is honestly the reason why I am determined to be a science major. He is one of those few teachers at lowell that loves his students, helps them, wants to be teaching, and knows so much about his subject! you can literally ask him about anything, he is a walking science book. he is that one teacher at lowell you miss when you graduate. i guarantee you: you haven;t learned science until you take his class; he makes you love it!","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Well the thing is I feel like he was easier in past years considering I'm having such a hard time right now. I don't learn anything in his class and is currently failing. I've gotten a tutor and tried studying but I don't seem to be improving. All I know is I feel like both Johnson and Bird are not the right biology teachers for me.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Johnson is actually a very good and nice teacher. He gives a ton of homework but it's very helpful in tests. He has quizzes usually every friday but if you really study for it, it's a breeze. Study hard for the test if you want an A on it. He gives a 'free' week once in a while and he is usually is in a very good mood and is understanding of our stress levels. If you participate a lot, do good on quizzes, study hard on tests, and turn in ALL your hws, labs, and classworks, you'll get an A.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's funny in the dorky, kind of clueless way. His class is really cool because he hardly ever lectures and you can do work wherever you want in his class. Also, you don't have to ask to go to the bathroom, so you can get up and get food or talk to friends if you are bored in class. He's not hard if you study.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His classes are really easy..... everyone says that chem is so difficult but i have learned a lot from his class and i eventually got an A from him. You just gotta try ur best to succeed in his class.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr johson is energetic and explains a lot of things. he gives NO HOMEWORK so all you have to do is pay attention and take good notes. if you have a good notebook/binder, he will drop one bad test grade at end of semester. he can be quite funny but just dont get him mad.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Johnson is a good teacher although I wouldn't take him again, just because his class is sooo much work and sooo much stress. I worked very hard but in the end, I got a B which would've been an A in another bio class.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A pretty understanding teacher, knows his stuff. He explains very well if you ask a question. As long as you participate and do the homework assignments, you can get an A. For the final, he gives a study sheet so that you know pretty much exactly what's on the test. Really fun class, pretty laid back, I suggest you take him unless you do not have internet-ready access.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very knowledgable but grading system is horribleSubmitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Johnson is very kind and lively. His class does get pretty boring, but for the most part, he is very insightful. He's really generous with grades and makes sure every student isn't failing. Gives a lot of chances for extra credit. Very lenient. A really good teacher overall.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Johnson is super organized. This makes it easy for students to keep up with hw and learning. He uses google documents to post all the handouts so if you lost one all you got to do is download and print. He also post homework sheets for each chapter as well as grades every weekend. His tests are o","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"wow ... end of the year. is started out with a very low grade and he required that i meet with him to get additional help. now i just check the thinkwave site and can proudly say i made it through well. he provided lots of help. nice teacher.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I really dislike him. He is hard and mean when it comes to grading i have a c in his class. He wants you to do things fast and his way. Most of his work is self-teaching and I don't understand","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is my favorite Biology teacher ever!!! you will love him becuase he makes jokes and isnt too strct and PLUS WE ACTUALLY LEARN in his class!!:)","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Learn absolutely nothing. he takes for granted that we know the material but we dont.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He tells cool stories.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class is really boring and you can often see people falling asleep. But his tests are ridiculously easy and he doesn't give any homework. He's really nice but you don't learn much.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Love you Mr. J. Best teacher ever. Very organized and his class is actually fun. He actually talks to students and laughs. But don't expect him to smile when you don't do your work. He sticks to his rules about late work like his life depends on it. Big Zero even when you think you're his favorite student...no exceptions...none.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mmmmmmmmmmmmmm glGREAT TEA CHERSubmitted by a Parent","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best chem teacher around. He teaches 4 classes this year so he knows his material! Loves helping his students... participation is voluntary ... easy A if you just pay attention ... Only chem reg teacher better is Fong","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hella chill for an AP Biology teacher! Love the tournament concept! ;)Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not easy and not hard...just right","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I participate very little so he didn't bother to learn my name even though I had him for the whole year. If you don't like participating be ready for a B. If you do and you turn in all your homework/labs and get okay grades on tests/quizzes your in for an easy A. He was actually a lot better during first semester. You can tell he became lazy after spring break but it's understandable. He obviously knows a lot but he doesn't teach it well. Gets sidetracked pretty easily. I found his class a bore.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"do the homework, study for tests, and smile. thats all you need with Mr.Johnson","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Johnson for AP BIO-The first semester consisted of weekly problem sets and assessments, which are challenging, but easy if you dedicate your time usefully. The second semester was review. Since the AP exam changed, we were unsure if Johnson was really following the curriculum. However, it turned out that we were quite prepared for the AP test. All of his lectures, notes, and problem sets were made by himself. His class is a walk-in class and his personality is upbeat (if he had his coffee).","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Okay well first off he assigns homework on schoolloop. Very inconvenient. Second, his homework is confusing. Third, his labs are pointless. You don't learn much from his class at all. Easy A, but it's a headache. Avoid.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He teaches fine, but you have to make sure you study a lot in order to get an A. You can always tell how hard a test/quiz is by how happy he is.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My daughter speaks highly of mr J. I spoke to him a few times and seems quite personable. I especially like the online website that goes along with his course. I can check assignments and grades.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AWESOME AS !!! i dunno what these guys are TALKING ABOUT! he tells you stories :D","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"okay hes a really nice teacher and all that ive had him for 3 semesters now, and he definitely makes a better bio teacher than chem. you kinda have to be into the kind of teaching that he does, otherwise you wont learn, but otherwise his class is pretty chill, not much work, only some labs","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Johnson wasn't easy, but you learn if you pay attention, yes it can get boring sometimes, but not a bad teacher, i heard he's coming back (: i think he's better than other teachers. He can scare you by threatening your grade, but study and you can get an A (:","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. loved the class","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He tests on what he teachers...good teacher...fair grader unlike many other lowell teachers","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool teacher, tough grader, ok amount of hw, funny,","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"GREAT TEACHER. USES A LOT OF STORIES WHEN TEACHING ... THEY ALWAYS RELATE TO THE TOPIC AND MAKE IT EASY FOR STUDENTS TO FOLLOW. EASY TO TALK TO - DOES HAVE A SLIGHT ACCENT BUT THATS OK.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"60% of gets an A. He doesn't use the big, old textbook at all--has his own material. Covers entire curriculum in the first semester--everything is planned out in a schedule. (E.g. deadlines, tests/quizzes, etc.) Gives the questions a couple days before the long & short FRQ tests. Has \"free\" days where you work on class/homework in class and are free to get help. Has all his material either on School Loop or a Google Drive folder. Don't take him in the evening--he often has low energy & focus.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Came early to open house & he sat down personally w/us to go over our kid's grades online. After that, while logging on at home, he doesn't seem to update the grades so the parents can't keep abreast.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Totally enjoyed the class. I'll take this class if I were you.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Nice guy. Lectures aren't as boring as other teachers. Just do all your work.. and you'll be fine.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"horrible teacher. for one assignment you got either 100% or a F -- BASED ON HIS OPINION on a DRAWING. Basically, it was just favoritism. Highly do NOT recommend.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is the type of teacher that expects you to study 3-4 hours on his exam. We have other works too you know. Just impossible.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mmmmmmmmmmmmmm glGREAT TEA CHERSubmitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fairly easy class. Just do good on lab reports and tests and you'll get at least a B. Participation is a grade though (worth one test and is graded against other students in your class).","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"enjoyed the class","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Johnson is difficult, but managable as long as you focus on the right things. Write down the question for the homework and read the material, but don't worry about the answer. However, in the classwork use the book for every question he grades these questions like a test. Finally, STUDY ALOT. He may give only 2 quizzes, but his system would count each one as 7 percent of your grade.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Overall, a nice guy and a pretty good teacher. He does take off points for stupid mistakes (i.e. not stapling a two page assignment). A lot of times, he'd extend the due date of an assignment or lab. He even let us out of class quite often. He's a good teacher even though he's inconsistant in assigning homework. I had a C on the final and still ended up an A for the semester. Also, he pretty koo about tardies.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I hated this class but thats because i don't like science. mr j is a good teacher and i like him and he did give me a B. if i had to take biology again i would sign up for his class.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Horrible teacher. Class average is a 73. DO NOT TAKE HIM unless a) you are an absolute genius or b) you want to fail biology. He is disorganized and condescending and his tests are ridiculously hard. he does some labs but they're so complex he ends up doing the whole thing, leaving us to gawp at the review questions. SUPER SUPER FAVORITISM to the smart people. I hate his class.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher mr. johnson grades on participation and effort but you still learn a ton","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a good teacher, though not what I expected. He hardly teaches, so you're expected to learn on your own. His tests and quizzes are quite easy, but only if you read the textbook. Be sure to expect several questions that are not likely to appear on a test. Regardless, I'd recommend him; though i think all Bio teachers are great.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"CHEM IS HARD , you dont learn anything. he tries his best to teach but he doesnt do it in a manner in which everyone could understand. the only best option is mr. fong, but you cud get a B easy.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's pretty cool, and tells cool stories. Always gets off topic and doesn't explain things clearly. Not organized and forgetful, but easy A. I learned something at least. He always lets us out of class early, like today we were let out early by 25 minutes.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's cool in class and pretty laid back. But when it comes to quizzes and tests you HAVE to study, and I mean serious studying. He grades to the last decimal and even if you have a 89.9% like I do, hes not going to give you that A-. You just get that B+.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have not learned a thing since i been in his class. the only way I have an A Is because i cram for the test and rely on his curves. He's always on his computer instead of teaching. AVOID","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great chemistry teacher! No hwk! and tests are very easy. EASY A!","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a fantastic teacher-- hes great, really great... my favorite PICK HIM","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Can be boring at times but was a major refreshment from Dr. Hill. At least Mr. J actually taught us and allow our participation in the class. hw comes in waves of highs and lows - overall, not so bad. lots of ways to improve your grade...the key is to do well on all the little assignments (there are lots of them) and then the test become somewhat insignificant. i think he planned it this way so that your grade is not all in one basket. Mr. J likes things hs way and its best not to challange","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's........not bad actually. His tests are confusing to me though. He's funny and all that,but you really have to study for his tests to get a good grade. To be honest, I suggest you to get him because he's pretty good compared to other Biology teachers.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's human. If he's giving out too much homework, beg and plead and he'll crack. He smiles and knows how to joke and he can get off-topic in his lectures if you stimulate him, but they're all very interesting and you learn from them, even if they're not about miosis or whatever the heck you're supposed to be learning about. Anyhoo. Nice. Take him.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I heard he got easier now than last semester......so...I guess you should take him. Don't get confuse with the MRS.Johnson instead of Mr.Johnson.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy B. Participate/ace tests for A. Grades for AP Bio is based on distribution of grades of whole class, which is tricky...Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"didnt mind this class. he grades on a point system and most points are from homework and other assignments so if you keep up on these assignments and homeworks test and quizzes become almost irrelevant. i had low grades on tests and quizzes but did well on everything else. final grade was a B. Almost no room to do bad in his class. he's also quite nice","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I thought he was going to be a hard teacher, but he wasnt much of a hard teacher,all you have to do is the homework, readings, and STUDY ALOT! Usually the tests are easy and the quizzes are pulled out from your review sheets so yeah they are easy. He does check if you do homework or not, well depends on whether you get him super mad or not or we do the homework in class which i guess is considered classwork then. The labs are ok, just be sure to write notes down and anything else.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy. funny sometimes. just do your stuff n you`ll be fine","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Johnson is super nice, and friendly, and he tells really funny random stories, but as a Biology teacher, he does not teach what u need to know. Hes confusing and disorganized and forgetful. His tests are all different formats and he does not get through all the material.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very interesting. I did nothing and got a B. I liked him.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I was reluctant to take Johnson for AP Bio bc I was already going to have him for Biotech. The way my schedule turned out, I was stuck with him. Best thing that ever happened to me at Lowell. He's my favorite teacher and I have learned so much . THe class is the perfect balance of lecture, group work as well as difficulty. Don't let the grading system scare you, all you have to do is put in the work during class. He doesn;t assign homework, but you need to study. You will succeed if u work hard.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"First semester he was nice but this semester he has completely changed. He now gives hw regularly. he checks hw now too. He gives tests on subjects he hasnt even taught. oh yeah he lost my project","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took mr. johnson last year for second semester biology: he is my favorite teacher at Lowell. He is so nice and teaches really well. His stories that are told during class RELATE TO THE MATERIAL! if you actually study, you get his stories. you need to participate and study (you cant just sleep and wish for an a). but you actually learn the material! He's a homie. i wish I knew he was going to teach ap bio, I WOULD HAVE DEFINITELY TAKEN HIS CLASS X10000. thanks for being a brilliant teach!!!","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes an amazing guy... i really like his class..... he's really really sweet and helpful","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A new but sturdy teacher. Not exactly \"teacher teacher\" material, and most learning comes from the textbook. Only a few labs done, but the class is an easy B or A if you just study a bit harder. Sometimes there was a sudden load of homework, and the following week, there would be none at all.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best chem teacher. no homework! as long as you take notes and listen when he talks about stuff in class you'll do well.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"its hella funny when he's modit and goes like.. opps >< i dont like his mult. choice quizzes cuz he told us to read it carefully and i read it TOO carefully and FAILED buh yeah he named his website after his daughter O.o","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He was great during the first semester, plenty of labs, good lectures. During the second semester, he was pretty bad. He got lazy and would post the homework online without telling us we had homework. He didn't teach much in the second semester.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ok teacher. hes very impersonal, mostly because of his stare and will get very mad if you do not follow rules. he will not check homework in the classwork notebook, so u dont know if u did it wrong or not. he knows his stuff and will move at his pace. anything that gives pts (everything besides the classwork notebook assignments will give u pts) is very important. it can make or break u.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"easy easy b, slightly harder aparticipate, do your homework, get b's on your tests, you've got an a.his class is interesting and a really fun class to be inif you have the chance, take him!!#bestbioteacherever","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"An amazing teacher. Knows his stuff, so much so that he writes all of the course material - chapter notes, lecture PowerPoint, problem set, labs, etc. but be ware that you will work harder in his class and he will get annoyed when you slack. His ap bio student perform exceptionally well. Oh and he covers the entire curriculum in 1 semester and we spent much of the second semester reviewing and finishing all of the labs.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"WOW...coolest, most understanding, and nice teacher","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He reads these comments. Hi Mr. Johnson. I'm from your block 5 class.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's from Africa! I think he taught there before. seems like a nice guy","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a pretty chill teacher. He doesn't get that much A's in my class. He's okay I guess.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I liked his class although at time he give lots of hw","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very fun classes; on some days, usually at least once a week, he talks about the most random things and yet somehow in the end, he connects it to biology. If there's nothing to do at the end of class, he'll ask \"How was your day?\" to the whole class. His tests are somewhat difficult but if you actually study, you will definitely be able to get an A. It's easy to keep a B. 25% grade for each: homework, labs/quizzes, tests, and finals. Very good teacher that has wonderful analogies and TEACHES!","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"unusually funny/silly teacher. real cool. knows his stuff","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had his Bio class the first semester he taught at Lowell. Needless to say, he was easy at first. Pay attention and you can do well. Labs are pretty pointless, but expect that if you plan to take more science, either at Lowell or in the future elsewhere.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A, chill class. People fall asleep a lot though. He's really nice and tells interesting stories, but you don't learn much.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"extremely boring and HARD","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Got an AAAAAAAAAA. Love him. Much better than Dr. Hill(what a nightmare)","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is NOT a good teacher. He does not explain anything out right and gets sidetracked very easily. He expects you to study 3-4 hours for a test. Come on. We go to lowell. We have other classes. The homework situation isn't that bad. It's hard to catch up if you miss a couple days. We do a lot of labs which is fun. If you want to learn something you should not take his class.","rating":4,"version":1}],"rating":4}},"__N_SSG":true}