{"pageProps":{"teacher":{"name":"Thomas Martin","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"AP Economics","block":"6","semester":"Fall2014"},{"name":"AP Economics","block":"8","semester":"Fall2014"},{"name":"AP Human Geography","block":"2","semester":"Fall2014"},{"name":"AP Human Geography","block":"4","semester":"Fall2014"},{"name":"AP Economics","block":"6","semester":"Spring2015"},{"name":"AP Human Geography","block":"2","semester":"Spring2015"},{"name":"AP Human Geography","block":"4","semester":"Spring2015"},{"name":"AP Human Geography","block":"8","semester":"Spring2015"},{"name":"World History","block":"1","semester":"Fall2015"},{"name":"World History","block":"7","semester":"Fall2015"},{"name":"AP Economics","block":"3","semester":"Fall2015"},{"name":"AP Economics","block":"5","semester":"Fall2015"},{"name":"World History","block":"1","semester":"Spring2016"},{"name":"World History","block":"7","semester":"Spring2016"},{"name":"AP Economics","block":"3","semester":"Spring2016"},{"name":"AP Economics","block":"5","semester":"Spring2016"},{"name":"Economics","block":"3","semester":"Fall2016"},{"name":"Economics","block":"5","semester":"Fall2016"},{"name":"AP Economics","block":"1","semester":"Fall2016"},{"name":"AP Economics","block":"7","semester":"Fall2016"},{"name":"Economics","block":"3","semester":"Spring2017"},{"name":"Economics","block":"5","semester":"Spring2017"},{"name":"AP Economics","block":"1","semester":"Spring2017"},{"name":"AP Economics","block":"7","semester":"Spring2017"},{"name":"Economics","block":"1","semester":"Fall2017"},{"name":"Economics","block":"3","semester":"Fall2017"},{"name":"Economics","block":"7","semester":"Fall2017"},{"name":"AP Economics","block":"5","semester":"Fall2017"},{"name":"Economics","block":"1","semester":"Spring2018"},{"name":"Economics","block":"3","semester":"Spring2018"},{"name":"Economics","block":"7","semester":"Spring2018"},{"name":"AP Economics","block":"5","semester":"Spring2018"},{"name":"Economics","block":"2","semester":"Fall2018"},{"name":"Economics","block":"4","semester":"Fall2018"},{"name":"Economics","block":"8","semester":"Fall2018"},{"name":"AP Economics","block":"6","semester":"Fall2018"},{"name":"Economics","block":"2","semester":"Spring2019"},{"name":"Economics","block":"4","semester":"Spring2019"},{"name":"Economics","block":"8","semester":"Spring2019"},{"name":"AP Economics","block":"6","semester":"Spring2019"},{"name":"American Democracy","block":"2","semester":"Fall2019"},{"name":"American Democracy","block":"5","semester":"Fall2019"},{"name":"Economics","block":"4","semester":"Fall2019"},{"name":"Economics","block":"6","semester":"Fall2019"},{"name":"Economics","block":"8","semester":"Fall2019"},{"name":"American Democracy","block":"2","semester":"Spring2020"},{"name":"Economics","block":"4","semester":"Spring2020"},{"name":"Economics","block":"5","semester":"Spring2020"},{"name":"Economics","block":"6","semester":"Spring2020"},{"name":"Economics","block":"8","semester":"Spring2020"},{"name":"AP Human Geography","block":"2","semester":"Fall2020"},{"name":"AP Human Geography","block":"5","semester":"Fall2020"},{"name":"Economics","block":"4","semester":"Fall2020"},{"name":"Economics","block":"8","semester":"Fall2020"},{"name":"AP Human Geography","block":"2","semester":"Spring2021"},{"name":"AP Human Geography","block":"5","semester":"Spring2021"},{"name":"Economics","block":"4","semester":"Spring2021"},{"name":"Economics","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Martin's not an easy A (all his tests were harder than the AP exam!) but hard work can and will give you one. His teaching method was very effective (daily quiz brief lecture), and the painful FRQs he assigned us to work on over the year paid off mightily. i got a 5 on apwh because of him :D","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Some of his class material can be quite difficult and he assigns lots of projects such as maps, and essays. But he is willing to reach into us and teach us what he knows. i suggest all to take him","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for AP HUG and he was the best teacher I had in 10th grade. Mr. Martin is one the most educated teachers I have ever met, and I felt like he really wanted me to do well and get that 5 on the exam, which I did, thanks to him. Although many say he goes to fast, has high expectations, WAKE UP PEOPLE! IT'S AN AP CLASS! Things are suppose to be challenging, you have to commit to your learning, study hard, and earn that A. Do what Mr. Martin says, and you will get the 5 you deserve!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"(This review is for AP ECON) This class is your textbook definition of a AP class. You reading the textbook, take a quiz, lecture, and test for every unit. Do your hw & self-study. You get a lot of freedom in this class. A bonus is that Mr. Martin is really funny, he jokes about everything. Great teacher, great class!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Martin is hilarious in the way he explains stuff but his tests are hard. studying DEFINITELY helps","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"don't take him if you're looking for an easy A. take him if you're willing to learn and work. daily quizes on sections. multiple choice test are mediocre to hard. lectures during class. good teacher and entertaining but very blunt. take him for AP world and you're guaranteed a 5 on the exam.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A lot of freshman dislike Mr. Martin and his daily quizzes. But, most AP History teachers give daily quizzes, so he is good preparation. If he marks you wrong for something you got right, take the opportunity to get valuable extra credit by finding proof of your answer (he wont tell you to do this,","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's the best teacher in the world. He's not hard. I have him for ap world and he's chill and laid back. it doesnt feel like an AP class but he is a really good teacher. OveralL I recomend him if u want to learn but if u want an a take girling for APWH not him !","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's really hard (Well at least for me). But overall, you never get bore in his classes. If you take notes and do good on his daily quizzes, that easy A is yours. But if you struggle with it, I could say you are in some serious trouble. Just remember to do good in the beginning and through out the semester. The beginning often counts the most, because if you start to lack off in the beginning, and continue to do so, I don't think you are gonna get a pretty decent grade or even pass his classes.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AMAZING teacher, difficult but workable A (apwh) he's hella funny and entertaining, don't be annoying or else he won't like you. No lie, he's a really great teacher and reasonable with grading! take him if you really want to know the material","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Martin is amazing. However, do not take this class if you want an easy A. You have to read a section (3-5 pages) every night for a quiz the next day... they're not brutal, but just take notes. His lectures are never boring, and he knows how to kid around with students to make class fun. Also, keep up with your current events, as they are on the test and you have weekly assignments on them. The tests are hard, but if you study, you'll be okay.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for WHAP. He's hard compared to the other teachers, but he's still nice, and the class is sort of fun. But it was sort of hectic when it was near the AP exam and we had to do all those essays, and packets. At least we had an easy costume party as one of our finals at the end of the year.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hey you guys , the daily quizzes are to test what you have read. i am now a junior and i dont regret the daily quizzes , they keep you up on your studies. this is an ap class. it could get worser , and it will all pay off in the end!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Probably the best history teacher ever. I had him for MoWo and I was super scared at first because I thought he was going to be a really hard teacher. But that was definitely the class I looked forward to the most. He's super funny. As long as you take good notes, study, know your geography, and actually listen to what he says in class, you should be able to get a good grade in his class.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class isn't easy and his lectures aren't too interesting but Mr. Martin's amazing. He's so funny and he really prepares you for the AP test. The man knows his stuff.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Daily quizzes everyday, but they all pay off in the end for his finals. Funny and very knowledgeable. Not an easy A, but if you are consistent with your quizzes, then you'll get an A.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for Honors US History. He taught us like we were AP. For that class alone, I shed blood, sweat, and tears. BUT IT WAS WORTH IT. He's a quality teacher, that Mr. Martin. Very rare.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's really funny, and tells it like it is. He's rather difficult and expects the most from you.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have him for Modern World and he's awesome. His quizzes and tests are on random details and his lectures can become boring but it's making me actually work for my A. I love doing the maps but hate the weekly Current Events. Oh and he waves to me in the hallways (:","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Definitely not easy. But is a cool teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome. Super funny. Not a difficult class. Participation and text book reading is important. Very enjoyable. You get to play kickball. Final is a killer but he curves it and all of his tests. I recommend him.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"as a modern world teacher he's really good. you can get up to 150% on some of the daily quizzes, which are usually really easy and are great grade boosters. his tests are difficult but curved.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"We have a quiz everyday... and finals even after AP testing...","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Martin is strict and expects a lot from his students. He is not for everyone. But if you are willing to to put in effort, you will really grow to love him. His daily quizzes are a bit intimidating at first, but eventually, you fall into routine and they prep you really well for his tests/exams.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hands down THE best teacher ever, you will regret taking anybody else for AP World. he's entertaining, knows his material, he cares about his students, and he teaches reaaaally well. hard A for AP World but if you put your effort into it, he'll notice it and that will definitely help. I think over h","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's generally pretty hard compared to the other APWH teachers. He's okay in my opinion, but if you have a chance to take any teacher you want, don't take him. The extra stress from just this one class is not worth it, when it's such a struggle to get an A in his class.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Martin is awesome... if you try... easy B hard A. Daily quizzes but they help. Every week or so you get a project or a packet to read. He really did help the class prepare for the APUSH test... and even was on the spot on what the DBQ was about. Try and work hard ... you should be fine.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"To be honest, Mr. Martin is one of my favorite teachers. He may have hard tests and exams, but he knows what he is talking about. I had him last year for Modern World, and I learned so much. His lectures are meaty and packed full of useful information. I feel like I know so much more, having been in his class. He is such a funny guy, and I am so glad I was able to take his class last year.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Martin is seriously once of the best teachers you could ever have. He's just bloody amazing. He knows his material, and has had experience teaching in foreign countries, so if you dig someone who knows a lot about the world, then you should take him. He's a pretty easy B, but kind of tough to get an A. However, you learn so much in his class, and he never bores you. TAKE HIM!! HE'S THE BEST!","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I learned a lot this past semester in his class (APWH). Although an A is quite difficult to attain, it is definitely do-able.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Martin is very entertaining and humorous... Easy A if you are willing to work hard and put effort into your work. Daily quizzes given, and current events every week. Tests are moderately hard, know the material besides what is written in the book.Current events incorporated into tests.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Overall, the tests are pretty hard and reading sections every night is annoying, but you'll feel like you're learning. He explains the material well and he's funny. Just study and you should be fine.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had him for ap world F'08 - S'09. projects were ok, usually maps. daily reading quiz. . . online outlines help somewhat. he's a very funny guy, sometimes sarcastic, but he's pretty cool. he also knows what he's doing with the ap testing, so you get pretty useful tips from him. kind of challenging.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a really hard teacher, but he's a really great teacher.. and funny too! I love his sarcasm. But he's worth it if you really want to learn, but you got to work hard.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Martin is a really great teacher! I've had him for two semesters now for Modern World. To do well in his class you need to take good notes and listen up to his class lectures. There are daily quizzes, but they help you in the long run. You'll need to study geography a lot. Groupwork, projects, and tests count for most of your grade. The final was crazzzzy hard, but if you study up, you'll do great in his class. He's really funny and his lectures are alright. Overall, great teacher.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SO HARD. SO MUCH WORK. YOU SERIOUSLY DEVOTE YOUR LIFE TO THIS CLASS... BUT! you learn SO much. SO SO SO much.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love his class and i would def. pick him if he teaches APUSH but he doesnt :(but he's mean tho.............>:O","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not an easy class but he is passionate and interesting","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Thought he was scary at first because there's a quiz everyday. Read the section every night, study for a few minutes and you'll be fine (reading a section would be the daily homework assignment). Hilarious jokes. Simple projects. Easy B, work a bit harder and guaranteed an A.Kickball has to be the most fun.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"please for the good of human kind. don't. take. mr. martin. please.","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took hum for HUG last year, BEST TEACHER I'VE EVER HAD, he made learning incrreadably fun and intresting, in the end I got a 5 and actually retained enoufgh to correct current HUG students.Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"As long as you try, taking Mr. Martin basically guarantees a 5 on the AP test.","rating":4.7,"version":1}],"rating":4.6999999999999975}},"__N_SSG":true}