{"pageProps":{"teacher":{"name":"Timothy Lamarre","departments":["English"],"semesters":["Fall2014","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"English 1","block":"4","semester":"Fall2014"},{"name":"English 1","block":"7","semester":"Fall2014"},{"name":"English 2","block":"1","semester":"Fall2014"},{"name":"English 2","block":"3","semester":"Fall2014"},{"name":"English 2","block":"5","semester":"Fall2014"},{"name":"English 1","block":"2","semester":"Fall2015"},{"name":"English 1","block":"6","semester":"Fall2015"},{"name":"English 1","block":"8","semester":"Fall2015"},{"name":"Comedy and Satire","block":"3","semester":"Fall2015"},{"name":"Comedy and Satire","block":"5","semester":"Fall2015"},{"name":"English 1","block":"2","semester":"Spring2016"},{"name":"English 1","block":"6","semester":"Spring2016"},{"name":"English 1","block":"8","semester":"Spring2016"},{"name":"Science Fiction and Fantasy","block":"3","semester":"Spring2016"},{"name":"Science Fiction and Fantasy","block":"7","semester":"Spring2016"},{"name":"English 1","block":"2","semester":"Fall2016"},{"name":"English 1","block":"6","semester":"Fall2016"},{"name":"English 1","block":"8","semester":"Fall2016"},{"name":"Comedy and Satire","block":"3","semester":"Fall2016"},{"name":"Comedy and Satire","block":"5","semester":"Fall2016"},{"name":"Science Fiction and Fantasy","block":"3","semester":"Spring2017"},{"name":"Science Fiction and Fantasy","block":"5","semester":"Spring2017"},{"name":"English 1","block":"2","semester":"Fall2017"},{"name":"English 1","block":"6","semester":"Fall2017"},{"name":"English 1","block":"8","semester":"Fall2017"},{"name":"Comedy and Satire","block":"3","semester":"Fall2017"},{"name":"Comedy and Satire","block":"5","semester":"Fall2017"},{"name":"English 1","block":"2","semester":"Spring2018"},{"name":"English 1","block":"6","semester":"Spring2018"},{"name":"English 1","block":"8","semester":"Spring2018"},{"name":"Science Fiction and Fantasy","block":"3","semester":"Spring2018"},{"name":"Science Fiction and Fantasy","block":"5","semester":"Spring2018"},{"name":"Comedy and Satire","block":"2","semester":"Fall2018"},{"name":"Comedy and Satire","block":"6","semester":"Fall2018"},{"name":"Comedy and Satire","block":"7","semester":"Fall2018"},{"name":"English 1","block":"3","semester":"Fall2018"},{"name":"English 1","block":"5","semester":"Fall2018"},{"name":"English 1","block":"3","semester":"Spring2019"},{"name":"English 1","block":"5","semester":"Spring2019"},{"name":"English 1","block":"7","semester":"Spring2019"},{"name":"Science Fiction and Fantasy","block":"2","semester":"Spring2019"},{"name":"Science Fiction and Fantasy","block":"8","semester":"Spring2019"},{"name":"Comedy and Satire","block":"3","semester":"Fall2019"},{"name":"Comedy and Satire","block":"5","semester":"Fall2019"},{"name":"English 1","block":"2","semester":"Fall2019"},{"name":"English 1","block":"6","semester":"Fall2019"},{"name":"English 1","block":"8","semester":"Fall2019"},{"name":"English 1","block":"2","semester":"Spring2020"},{"name":"Science Fiction and Fantasy","block":"3","semester":"Spring2020"},{"name":"Science Fiction and Fantasy","block":"5","semester":"Spring2020"},{"name":"English 1","block":"6","semester":"Spring2020"},{"name":"English 1","block":"8","semester":"Spring2020"},{"name":"Science Fiction and Fantasy","block":"2","semester":"Fall2020"},{"name":"Science Fiction and Fantasy","block":"5","semester":"Fall2020"},{"name":"Science Fiction and Fantasy","block":"2","semester":"Spring2021"},{"name":"Science Fiction and Fantasy","block":"5","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-09T20:50:03.365Z","text":"He is a pretty nice guy, and he is pretty funny. But he has writing rules that if you don't follow he will subtract a lot of points. However, his discussions are interesting and it is an easy B, slightly hardish A\n","rating":4,"version":0},{"timestamp":"2020-05-07T00:01:53.466Z","text":"I loved this class and this teacher so much. Super engaging and fun class. The class decisions we had in this class was the highlight of my day. My favorite English teacher by a long shot. He wrote me a letter of rec to a program that really sparked my love for journalism. 100% you should take. So chill you will love it! ","rating":5,"version":0},{"timestamp":"2020-05-07T00:01:01.956Z","text":"The best teacher, period. He’s literally so funny and he grades kinda harsh, but he usually doesn’t even grade lmao","rating":5,"version":0},{"timestamp":"2020-05-06T19:17:18.230Z","text":"I LOVE HIM SO MUCH. If you can, PLEASE take Lamarre!!! He takes some getting used to and you're not guaranteed an A but his class is SO fun and he's rly nice its worth it. His finals/mid-terms are kinda hard but I got solid Bs without doing very much reading. I just love him he's so funny!!!!!!!!!!","rating":5,"version":0},{"timestamp":"2020-05-05T11:26:36.314Z","text":"He was the nicest and most easy going teacher I’ve ever met! He’s literally so kind and the things he teaches is worth learning, especially when he goes easy on students in his class. I highly recommend.","rating":5,"version":0},{"timestamp":"2020-05-02T20:49:17.190Z","text":"Lamarre is the best. His class is super chill and barely any homework. I got A’s on every essay and didn’t even read the books. The midterm is difficult- but not anything crazy. He’s really funny and makes class really enjoyable. Definitely would recommend him as a teacher","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr lamarre is AWESOME. he's very laid back and you can talk about pretty much anything in his class. easy to get off tangent. sometimes he can be scary when he just stares at you with his gray eyes, but he's a very chill teacher. doesn't assign much work and very reasonable. he looks more for ideas than for super specific details. easiest A i got in english. (but that's cuz i had some pretty hard teachers. bookwalter, yuan, moffitt, arber) his essays are pretty fun. you do poetry too.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I loveddd his class. He's really interesting but writing essays are kind of hard. I learned a lot about writing essays though. and although the tests are hard, if u study its pretty easy to get a A.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lamarre for English 1A is a very harsh grader, but does curve his tests. Even still, many people barely or do not get an A in his class with the average essay grade being a C almost every time even after the curve. Very knowledgable but expects nothing less than perfection and there are many times in a year where there is a limbo in which no actual learning is occurring due to his heavy workload of long essays to grade. Never use \"you\" or \"never\" in your themes for this class; pun intended.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is one of the best teachers you can find. He explains his material very well and his test and essays aren't too bad if you listen to discussions. He is an awesome guy.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's really bizarre. we do go off on a lot of tangents, but they're fun not annoying. i don't think my writing improved at all from his class, but going to class isn't essential, so that's good. the readings were informative. i think he should require teacher student conferences about essays, otherwise they'll just end up fudging the first drafts and writing it the day it's due. student editing isn't so great--it's the blind leading the blind.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. a really hard A, but an easy B. class is never boring and he teaches you a lot. he really does care about the students, and wants them to improve on essays, which he is a really hard grader on. i highly recommend him, one of the coolest teachers ever! :]","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lamarre is my favorite English teacher of all time. He really helped me learn how to write a great essay, and i found him very approachable and nice. We read interesting things and the in-class discussions were lively and interesting. Essays occasionally, short answer work more often. Great teac","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"good teacher, but grades really hard, but i learned alot in his class, easy b hard A","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's very intelligent, but he assigns A LOT of work in his sci-fi class, so that was a rude awakening for me since I was expecting very little work. Class is never boring but to get a good grade, you should speak up during the discussions.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really hard/fair grader on essays. however, i got two C on essays but still got an A- in class.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"TOTALLY OVERRATED. He doesn't actually teach, the entire class (9th grade eng 1h) is him making you write thesis statements and reading them outloud to the class. He destroys essays, and only gives like 3 assignments a semester which might sound good, but if you get bad grades on them your screwed.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the thing with this (very cool) teacher is...he doesn't respond when you say something in class! like...he asks for opinions, and you raise your hand and say something, and he stares at you for about 6 or 7 centuries and then says \"yeeah\" or \"wait...what?\". but don't get me wrong. you do learn a lot and the tests make you think. i feel smarter when i leave his class. easy b...an a you are going to have to work very hard for. he started out my class really easy w/ poetry and then got harder.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Even though his grading system is harsh but you learn A LOT from. He is really nice.He answers everyone of your questions no matter how many times you ask him. Take notes and listen and you will get a B.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher. Laid back, but not aloof or removed from classroom discussion. He really tries to give specific feedback for each student, and encourages discussion in class. Awesome teacher!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's one of the best english teachers that i have ever had. he's really helpful and fun in class. I love how when he talks he uses his eyebrows a lot. He's somewhat deficult but i managed to get an A. i wish he taught all english classes. and your vocab skills get crazy better. He's helful and nice","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher! interesting discussions and his stories are very funny. his essays are hard but u learn alot> cool guy","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I was on a very similar wavelength with this guy. Adored his classes — very chill and easygoing, yet engaging. He liked me which made it THAT much easier, so participate and make sure he knows you work hard. English is my second language... I know it decently? as I started to speak/write from first grade onward (I'm Viet), but I still passed with flying colours. If he thinks you earnt the grade and did the proper work, he will do what he can to give you your A. He did for me, anyway. 100% rec.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hilarious. Sarcastic. Chill. You have to work for an A, but getting B's is easy. Essays are an automatic C, minus any other flaws if they are missing a thesis in the intro paragraph.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy B, Hard A. Take notes. Very very good teacher","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a good teacher, and is class is pretty chill, but he expects you to investigate deeply in your writing. Not very many people got A's, so don't take if you are looking for easy A. However, if you are looking to become a better writer and want a fun class, this definitely the one to take.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hard teacher but you learn a lot. Basically guarenteed for english honors if you are in his class.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"probably one of the most intelligent teachers i've ever had. no way is he b-s-ing any part of his class, he's incorporating his own (generally quite insightful) thoughts into what you've just brought up. interestingly enough, he actually cares about what the student has to say about the topic. quite a fun class if you enjoy deep discussions and class participation (really all you need for a b.). make sure to do your homework!! it can be quite a blow to your grade if something is late.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome teacher; you learn so much in his class. though hes a bit hard, you just have to work even harder, and you'll get that A.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his class's funny and sumtymes he gets off topic but u still learn a lot","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MR. LAMARRE IS THE BEST!!! even though he barely ever blinks, he is awesome. he will help you become a GREAT writer with essays and is just GREAT! he's probably one of my favorite classes! he is chill, funny, brilliant, and A LOVER OF HANGMAN!!! its so awesome!!!!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lamarre is a good teacher. My english skills definately improved (still sucks though) but he is good. If you participate a lot, you have a higher chance of getting an A. My grades for him were B, B+ and A- and I got an A in his class. His final counts for 4 test grades so as long as you get an A on it, you should get an A in the class. Remember to participate or else you will get a B in his class even if your essays are good. In order for him to like your essays, start w/ the format he wants","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he likes to tell stories, a lot. when he's analyzing text, pay close attention, answer questions, and take detailed notes.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lamarre is a great teacher. His classes are always fun, never boring. He explains well and gets everyone to participate. Tests are hard but as long as you study, you'll do fine.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is relly cool and nice!!.he is a great teacher and i learned a lot in his class.his class is always interesting.you barely get homework.hard a, easy B","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Whoever said that \"u'll be doing bunch of hw\" is pathetic. In all honesty, ur writing will improve in Lamarre's if u apply yourself. In contrast to what somebody on here said, he is very willing to help outside of class, but it's up to u to initiate it (which is good, b/c it teaches u to be self-reliant). In addition to being a laid-back person, he doesn't waste ur time with irrelevant busy work but instead assigns essays, from which u have ample opportunities to learn learn from. Take him!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"the class is pointless. We get off on useless tangents and about three quarters of the class is doing their own thing or fast asleep. He's a nice guy, but really needs to learn how to teach.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Lamarre is a very good teacher but hards pretty hard. I have only gotten one A on a essay and the rest were B+'s. His tests are pretty straight forward and you should do fine if you listen in class. Take him if you want to learn but not if you want an easy A","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy B, hard A. Be sure to pay attention because the tests and stuff revolve around anything mentioned in class. Format is important. Good teacher.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lamarre will make you cry. He grades HELLA hard on all your writing. Very few A students in the class. Will try to help you improve your essay but vague instructions. Grades comprise mainly of essays. (See sbove) Can be good teacher if he spent more time going over essays. Take him if you believe in miracles. Avoid him if you want an easy ASubmitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MR.LAMARRE!! he's the best. really. he makes you want to become a better writer. before his class, i didn't think i could write well. with a little practice and motivation, i now have the self-esteem of a good writer.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a great teacher ... not an easy one ... but you will have fun in his classes while learning a lot","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a really cool teacher, i'd take him again if i had the chance to but he doesn't teach for tenth grade. He's one of my favorite teachers. He grades hard on essays and his tests are pretty straight forward if you had listen in class. His classes are cool, you don't have that much homework and you get closer to the teacher because he talks to us alot, about the subject and everything. He gets our view on the topic. He's a really cool teacher. I suggest you take him if you could.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr lamarre is the best teacher ever! he's really smart in explaining what to do in our essay. he the best teacher i've ever had sa far. i really recommend him to everyone. i learned a lot in his class like how to improve my essay and all that stuffs, but sometimes his essays are hard but dont worry he helps you like to have ideas what to write. =)","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr lamarre is a very very hard teacher. he hates giving out a's for some reason. he said he used to give them but the department head said he was too easy so he decided to grade harder. i had him twice gave me a B both times. i worked SOO hard. had an 89.6 and wouldnt give me an A!!! gives way too many essays and marks them up with no critique. dont know what he's looking for and wont spend free mods helping. if you take him you will spend hrs. doing hw and end up getting a B or even a c.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's cool and really nice to his students. His class is challenging but fruitful","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had him for world lit and expos writing. way harder for world lit, but once u get him for expos, his class seems easier. u learn a lot in writing and have fun.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is not a easy grader, but you learn so much in his class. If you take in what he teaches and what he says, you'll earn your grade. I can honestly say he is the best english teacher around. TOP-NOTCH.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"lol his class is fun and he's an awesome teacher, but i dont like the way he makes us write our essays...like the style...","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"There's not many choices out there for English 1A teachers, but Lamarre is clearly not a bad choice. Yes, it's hard. Yes, he grades tough, but you get homework like... once a month? Just work really really really hard on that one essay, because it's worth like 45% of your semester grade and can get you an A even if you bomb the in-class essays / midterm. Also, he's a much fairer grader compared to some *other* English 1 teachers. And raise your hand in class!Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ladies and gentlemen! This is a truly good teacher! He teaches extremely well in class and doesn't give much homework (if any at all), but you MUST study HARD for his tests!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"You learn a lot in his class. His 'term tests' and essays aren't that bad, but you should study for an hour and a half plus.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lamarre is a decent teacher, but he's a a tough grader on things he actually grades (but on most assignments, he usually gives 100% if it's done).","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best english teachers. Cool person. He goes off topic alot. Haha. He grades his essays hard, but everything else is okay. And tell me, which english teacher ISN'T a hard A easy B these days.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best damn teacher ever. Take him you'll learn a lot but it is hard to get an A. However, there is very little Homework and do all poems to boost lw test/essay scores","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lamarre is the coolest! I love being in his class and listening to him talk about .. everything. He does his best to help you, and he's very nice. I absolutely loved his class.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I have Mr. Lamarre for English 1H, and his class is so chill. In the class, we've read Shakespeare, analyzed poems and other fiction, and delved into creative writing. There aren't a lot of tests, but the midterm was really really hard. Just study the vocabulary that he gives you, and you'll do okay. Haven't taken the final yet, but I am assuming it's just more of the same. Also, he is merciless while grading essays.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"COolest teacher ever!!! one of most intellengent and insightful guys ever. laid back, very cool. lots of class discussions- listens to everyone's thoughts & adds own insights. extremely well read, smart, worldy person . if you take his class your writing skills will absoutly improve, be involved in class,& ready to work &think. hard grader,almost no homework- but essays. If you get a chance to learn from him, seize it.Best class ever, extremelty smart and analytical teacher, so cool and fun!!!.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His test are ok, but the essay tests are hard.but overall he is a very good teacher.He is very nice to his students; pretty funny; boring sometimes; but he is good.I learned a LOT","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lots of short story analysis. Sometimes randomly checks notes. Also, make sure you have literally everything on the board written down. He grades hard but if you talk to him he has lots of suggestions for how to improve your writing .Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's very good. I've learned tons from Mr. Lamarre. Easy B, Hard A. Usually you get no homework for a few days, but hits you hard with an essay (which you get plenty of time to work on). Summary: Learn a lot, little homework, great teacher, but a bit boring during class.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I looove his class. A lot of it is based off discussions, but there's always a ton of laughing involved. He may seem too laid back, but he really knows his English. His essay topics are always interesting (for Adv Comp anyway). Little homework, but be sure to do them if there are any! He's patient and will explain anything you don't understand. Very helpful, and your writing will definitely improve. The best English teacher!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I managed to pull off an A- in his class! He isn't a really easy teacher but taking sci fi with him was really chill. we watched district 9 in class! I never really got assigned any homework aside from reading books which i would do the day before the \"quiz\" for the book.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is one of the best english teachers i've ever had!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lamarre is an all right English 1A teacher. For second semster, he picks up the pace. He does teach you skills that will improve your writing, & by the end of the semester, I'm sure that your writing will get better. But, he is a harsh grader. He teaches you a skill and expects you to be an expert at it right off the bat; he grades your first in-class essays as if you're an expert at it. In general, he's a harsh grader & his notes are vague. He's an easy B, but a very difficult A. Good luck!Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's kinda out of it sometimes, but just participate a lot in his class. pretty easy B, hard A. make sure he gets to know u b/c once you're on his bad side...it's over.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a hard grader but he is REALLY nice :D He gives no HW for a while and then hit you hard with an essay which he gives u plenty of time to do. Work REALLY hard in his class and you'll get an A. He's REALLY awesome. You learn A LOT. Highly recommended. One of the best english teachers @ Lowell :)","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr lamarre is a very cool and easygoing teacher. He is clear in what he says but he is not easy, however if you get the information and pay attention you will do fine in his class","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Extremely hard, yet helpful teacher. His class is a class I will remember for years to come. Not only do you learn to write strong essays, but he improves your vocaulary, and strengthens your analytical skills.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"theres somethin about him that makes his class cool. not impossibly hard grader but most of the grade is from essays. for sci fi, u'd have to read a book like every 2 weeks, which kinda sucks. but then right after ud take an easy test where u can score 25/20 (tho he only counts it 20/20) recommended","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"so much fun. hes a great teacher and not to much hw. it's partly thanks to him that i got into honors english","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lamarre was very knowledgeable however when we had assignments he was not clear and the average test grade was a C , if not lower. Overall, if you get him, the world is not at its end, but you're going to sufferSubmitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Fun discussions, understanding person, interested in your opinions.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hard hard tests.. hard hard essays, but he is really cool. he is really easy to talk to. you never have homework but essays.. finals isnt as hard as i thought it would be.. you get to eat in his class too","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"your writing skills will improve sharply in his class. classes start with a ten-minute casual talk session about anything. his tests are extremely difficult; more time would help.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had him last sem., pretty cool guy, i B'aced his final (B'aced is not a typo) everything on there was by chance da only things i studied and i didnt study much ^^, hard essays but if ya get below C+/B- u just stink cause i only spent 30 min on each of em and still got B-/c+ and higher, i'd wish he'd teach eng 2 though HE IS DA KEWLEST, I still type like this after his class!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lamarre may be a bit intimidating at first, but he is a really cool person. He grades hard, but you definitely learn a lot from his class, whether it's vocabulary or analysis skills. He has traveled all around the world and is very knowledgeable about cultures, but can sometimes ramble on about irrelevant things.By the end of the second semester, I would say everyone had learned a lot from his class. He is hilarious and definitely a great teacher that you have to work hard to get an A from.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. lamarre's class is so fun! he is really funny and often talks about his life...so you basically dont do anything in class. But, his essays are really hard. If you are really good at essays take him! if ur okay, like me, you might get really stressed while writing it but it's not that bad... easy B. kind of hard A.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes pretty awesome, gives no homework but tests are pretty hard and are worth alot, but its worth it :)","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"9th grade English in F04. It wasn't an easy class, but I learned a lot and actually improved my writing. (Any English teacher I had after him would say that I write well.) Reading Julius Caesar aloud was a lot of fun. I really liked his class -- it was a nice beginning to Lowell as a freshman.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lamarre is the best. He is approachable, friendly, and we get to play sharades in his class! However, he is very specific about grading. In all tests, answers, or essays, be sure to explain and clarify your points.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lamarre's class is NOT easy. He rarely assigns homework and has a pretty laid back personality. At first, I was scared to death of him, but he's actually really nice and approachable. If you have him for Ninth Grade English 1H , you're probably gonna read short stories, write themes and subjects for them, write essays about them, have tests on them, and have tests on vocab. There's also the occasional quiz. If you want an A in his class, pay attention in class and do exactly what he says.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is such a good teacher! he is a hard grader so u have to work to get an A but his class is amazing and interesting. he really cares about his students.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He helps alot on developing a good essay and he makes class fun when he goes off topic talking about other stuff. And he gives out little hw!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"cool man...","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy B. turn in all of your hw and its an automatic b. Kinda boring sometimes, and forgets everyones name, but a good english teacher....never stays on topic for more than 5 minutes","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Only a few students got an A out of the whole class. I only knew of one. He teaches but most of us barely gets it.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for Comedy & Satire. I learned nothing from him because he makes the students run the class. He always either has class discussions or group discussions. One of the books we read wasn't even funny. Sometimes lots of hw, sometimes none. He ruined a class that I thought I was going to be fun","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a great guy","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"as everyone else said, he is the most intelligent teacher I have ever had in my life. he's laid back, cool, and he's helped me a lot on my essay.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he teaches you a lot however he is slighty boring while he does so. you just have to be willing to take notes on EVERYTHING he say and he grade really harsh. you have to work extreamly hard for a A or B. hes good if your up for a challenge to learn a lot.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr lamarre was the coolest english teacher EVER!!! had him for world lit and expo, and he's really easy. world lit was the best i've ever had because we played games and cracked jokes all throughout class...we had poetry days, watched movies, and played different getting-to-know-you games. i OWNED his participation sheet...haha.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a pretty good teacher but his grading system is harsh (one of my fav teachers)","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"laid back","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lamarre is a funny, laid back kind of teacher. He hates grading, so don't expect your test/essays to be returned to you for at least two months. His classes are extremely chill and there is not a lot of homework. He expects the students to work hard and independently, so be prepared to get a C on your essay without much help/explanatation. Tests are easy if you study the vocab and there is no final in the class. Good class if you don't expect an A.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best teachers a student could ask for. Absolutely hilarious, amazing sense of sarcasm, extremely helpful. You'll be a brilliant writer by the end of the semester.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"freaking coolest teacher evvvvvverrrrrrrrr","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Get him if you want to learn. Don't get him if you want an A. Expect B.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"took Lamarre's class for 1st semester 1st year. He helped me a whole bunch with my english and was very helpful when i had questions or needed someone to review my essays. Participation is a big part of the grade, so are the tests, which are not too easy. Worked hard and got an A!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. lamarre is awesome. at first he seems intimidating because of the rumours that his class is impossible, but hes actually really nice and easy going. He is a really harsh grader, but you almost never have homework, and he really teaches you to write. also if you ask the right questions he basically gives you the answer. dont be afraid to take this class.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy B, hard A. More than fair, he WANTS us to do well... generous with due dates, no stress from this class. inspires to think deeper/look beyond context... makes every lesson memorable","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"almost no hw, but his tests are fairly hard. interesting class when it gets off topic.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tests and essays are important but he will teach you how to write them and write them well and that will not only help u in his class but in your other classes as well little homework very fair grader has interesting ideas and thoughts related to the discussion participation will help ur grade and there isnt much homework you will benifit from his class","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"u learn a lot in this class even though the essays r kinda hard","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The best teacher i ever had. hilarious too! with all his stories and also gives interesting dicussions (yet hard but in a good way because u learn alot)","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had him for 9th English 1H in the spring, and to be honest, I was terrified of him. He's a great teacher - one of the few that can teach at Lowell. The class is straightforward - do well on the tests and the essays, do the credit, come to class, and you'll do fine. His class is no cakewalk - he will destroy your essay - but it'll make you a better writer. He also focuses on analysis and discussion. Somewhat easy B, extremely hard A. But take him - even if you get a B, its worth it! Awesome guy","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His essays are killers, but I learned lotsa new vocab, and sharpened my grammar","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. lamarre is the only sane and normal english teacher i've had at lowell. he is so nice, easy to talk to, and best of all: HE MAKES YOU THINK! he's ok with your opinion and you don't have to suck up at all.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He may seem scary at first, but he's really really nice. He's a great teacher and I've learned so much. It's very possible to get an A if you try hard.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Like with most English teachers, he's an easy B, but a work-hard A. Had him for 9th English, as well as reg teacher. Helpful when confronted, but his final was a pain.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Lamarre, if you are reading this, you are one of THE best teachers I've had throughout my Lowell experience. In his class you actually get to know the people around you and have thought-provoking discussions. TAKE THIS MAN'S CLASS! Oh, and a B+ in his class is not bad at all - it means you're around the top of the class. But your true goal is to be called \"dangerous\".","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a coll guy, definetly. Unless your parents are english professors ur not going to get an A (in his 9th grade eng 1h) but for a B you have to do no wrok, literally.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is currently my teacher and he doesn' t give homework hardly ever but when he does he'll give a lot. He plays favorites and grades really harshly. He doesn't give test that often but when he does they are extremely hard. For mid-terms we have to remember about 150 words :( My advice if you get hi","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"At first I did not like Mr. Lamarre and got C's. However, later, I tried hard and asked him questions like everyday after class. And I got better! His tests are pretty easy because he is that kind of teacher that goes over everything that is going to be on it. So if you pay attention in class and listen, you can get an A. I actually aced his final and midterm and my writing got a whole lot better!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a great teacher to have.. grading a bit tough but u learn a lot in his class... if u participate much.. it highers ur grade... work hard... if u improve... it helps ur grade!!","rating":4.4,"version":1}],"rating":4.422608695652165}},"__N_SSG":true}