{"pageProps":{"teacher":{"name":"Tom Chan","departments":["Math"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Algebra 2","block":"1","semester":"Fall2014"},{"name":"Algebra 2","block":"7","semester":"Fall2014"},{"name":"Geometry Honors","block":"2","semester":"Fall2014"},{"name":"Pre-Calculus Honors","block":"4","semester":"Fall2014"},{"name":"Pre-Calculus Honors","block":"6","semester":"Fall2014"},{"name":"Algebra 2","block":"1","semester":"Spring2015"},{"name":"Algebra 2","block":"7","semester":"Spring2015"},{"name":"Geometry","block":"2","semester":"Spring2015"},{"name":"Pre-Calculus Honors","block":"4","semester":"Spring2015"},{"name":"Pre-Calculus Honors","block":"6","semester":"Spring2015"},{"name":"Algebra 2","block":"1","semester":"Fall2015"},{"name":"Algebra 2","block":"5","semester":"Fall2015"},{"name":"Geometry","block":"2","semester":"Fall2015"},{"name":"Geometry","block":"4","semester":"Fall2015"},{"name":"Pre-Calculus Honors","block":"7","semester":"Fall2015"},{"name":"Algebra 2","block":"1","semester":"Spring2016"},{"name":"Algebra 2","block":"5","semester":"Spring2016"},{"name":"Algebra 2","block":"7","semester":"Spring2016"},{"name":"Geometry","block":"2","semester":"Spring2016"},{"name":"Geometry","block":"4","semester":"Spring2016"},{"name":"Algebra 2","block":"1","semester":"Fall2016"},{"name":"Algebra 2","block":"3","semester":"Fall2016"},{"name":"Algebra 1","block":"2","semester":"Fall2016"},{"name":"Algebra 1","block":"4","semester":"Fall2016"},{"name":"Pre-Calculus Honors","block":"7","semester":"Fall2016"},{"name":"Algebra 2","block":"1","semester":"Spring2017"},{"name":"Algebra 2","block":"3","semester":"Spring2017"},{"name":"Pre-Calculus Honors","block":"7","semester":"Spring2017"},{"name":"Algebra 1","block":"2","semester":"Fall2017"},{"name":"Algebra 1","block":"4","semester":"Fall2017"},{"name":"Algebra 2","block":"1","semester":"Fall2017"},{"name":"Algebra 2","block":"3","semester":"Fall2017"},{"name":"Pre-Calculus Honors","block":"6","semester":"Fall2017"},{"name":"AP Calculus AB","block":"4","semester":"Spring2018"},{"name":"AP Calculus AB","block":"6","semester":"Spring2018"},{"name":"AP Calculus AB","block":"8","semester":"Spring2018"},{"name":"Pre-Calculus Honors","block":"3","semester":"Spring2018"},{"name":"Algebra 2","block":"6","semester":"Fall2019"},{"name":"Algebra 2","block":"8","semester":"Fall2019"},{"name":"Pre-Calculus Honors","block":"3","semester":"Fall2019"},{"name":"Pre-Calculus Honors","block":"5","semester":"Fall2019"},{"name":"Pre-Calculus Honors","block":"7","semester":"Fall2019"},{"name":"Pre-Calculus Honors","block":"3","semester":"Spring2020"},{"name":"Pre-Calculus","block":"5","semester":"Spring2020"},{"name":"Algebra 2","block":"6","semester":"Spring2020"},{"name":"Pre-Calculus Honors","block":"7","semester":"Spring2020"},{"name":"Algebra 2","block":"8","semester":"Spring2020"},{"name":"AP Calculus AB","block":"2","semester":"Fall2020"},{"name":"AP Calculus BC","block":"8","semester":"Fall2020"},{"name":"Geometry","block":"7","semester":"Spring2021"},{"name":"AP Calculus AB","block":"2","semester":"Spring2021"},{"name":"AP Calculus BC","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"2019-12-01T04:53:11.602Z","text":"Hardest teacher you will have for precalc-h. Test is absolutely not related to what he teaches. Loves to eat. Good teacher that teaches though just super hard!","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Advanced algebra...He's not very clear and his grades are based mostly on tests. Doesn't explain material that well. Homework almost everyday. He's not that boring. Looks like a high-schooler.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HAHA! AMAZING! He tests HELLA hard but if u know ur material ull be fine! Just study as he lectures and you'll do fine. Also, do not blatantly avoid ur hmwk if you understand the material and are bored out of your mind....it wont help T-T He is DEFINATELY a must-take!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's the type you'd consider a friend, definitely not a teacher.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I wonder how he got past security, because this guy is the bomb.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He can easily pass off as one of the students he actually teaches but has years of knowledge over them. I can't say the same for maturity though. As a PC-H teacher, Mr. Chan knows his stuff. He deals with a rowdy class on a daily basis, and still manages to get through his lesson plan. He explains extremely well and makes sure everyone understands. He is a bit of a harda** on tests and finals but, you've gotta respect him on that. Just do you hwk, it really helps, even if he doesn't check it.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"SUPER COOL TEACHER. had ap calc AB. helps if you ask for it. tests are hard but manageable if you study/pay attention in class. breezes by the topic but will go back to review it if needed/asked","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's cool teacher but not exactly great","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The math subject itself may be hard, but Mr. Chan's class is really EASY if that makes sense. He is SUPER chill and laid back. If you choose to pay attention (he won't force you to if you're not), you will do well in his class. If you choose to not pay attention, then that's your fault for that D on your report card. His exams aren't that hard if you paid attention. Doesn't check homework regularly, but is always willing to go over a problem. Overall, an easygoing teacher. I'm taking him again.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Took calculus 7 years ago and is taking it again to \"raise his salary\" He played \"Yugioh\" all throughout mod 18 and five minutes into class one time. Hard tests that take a long time to complete.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had chan last year for pre calc. he was super easy, and very nice. i had him all three years (9th, 10th, and 11th), and he was definetely the best for pre calc. knows the subject way better than accel or geo h. take take take!!!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Maybe not the easiest if you procrastinate, however, if you actually pay attention in class, you're good to go! Mr. Chan is a really fun person if you get to know him, loves his students, and really helpful if you actually listen to him. Also has the most adorable son in the world!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i like him. he's a really good teacher but his tests are on the hard side. However, he curves the test grades pretty often and lets you do some extra credit on the tests so A's are possible. Take him. You'll learn.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"coolest teacher alive!!! he knows his stuff. best math teacher not impossible to get an A. chan is a must have","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ahh, Chancake. His class is always fun/lenient, but there were some days where I really regretted choosing him for Accel., because for a while I was azn-failing. xO However, in the end I got an A on the final and for the semester, so it's all good. =D All those little tricks he had on his tests, I thought they were just his way of messing with us, but they actually helped on the final. He makes you think, which was something I never had to do for my old (bad) math teachers. x3","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Was in Alg 2 class. Super easy. Teaches well. Gets straight to the point. Maybe math is just my thing but I feel like the class wasn't a challenge at all. Accel/Geo H/PreCalcH is probably more difficult. But I think he would probably teach everything. Take good notes and pay attention. The tests come from hw or more challenging. They make you think, which is a good thing. :)Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he makes hard tests, but he explains everything extremely well and clearly. if you need help, he can talk to you on off mods, and he can really help you understand in a short amount of time. he's also really fun. class is like a big party sometimes.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best math teacher i've had in a really long time. he explains things very quickly and very clearly. laid back class, but a bit hard. requires higher level critical thinking to get an A","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He curves his tests! It's easy to get an A.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"chan is very nice, but he's young - still learning how to teach right. he wants to help people, so if his lectures don't help, come to him on his off mods.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr.chan is the best. although everyone else in the class might have hated our corner, i know i had a damn good time in his class. he was the best math teacher ive had at lowell so far.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hmm...well...to put it nicely, Mr. Chan is a bad teacher for accelerated math aka adv. algebra, but he's a cool guy. If you want to learn something, take Delfino or Pinnoci because Chan cannot teach adv. algebra at all. If you get him for freshman year accelerated math...GOOD LUCK!!!...or you'll drop down to algebra 2 like me even though my overall average was a C and I got a C on my final.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Accel math is a breeze if you get what he's teaching, because he teaches very fast. Him in Milkshake video was the bomb. He's a cool teacher. I eat and talk all the im in his class, but he doesn't care.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"his tests are hard, but it's possible to get A's on them (even before test corrections). he's really cool and lets you turn in your hw late (or even copy it from a friend right in front of him), and he's really willing to help his students","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"well, accel isn't easy no matter which teacher you have, but he's nice, cool, and is very willing to help you whenever you need it","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for Accel. Explains things really great and in depth. Used to give near-impossible tests but now got easier by changing them to multiple choice. Overall great teacher. Take him, he really prepares you if you take AP Calc in the future.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's an awesome teacher for Accel. Extremely hard though. The homework - he usually doesnt check, if at all, and he explains everything clearly. The tests he gives are so hard, though, especially with the time given and the complexity of each problem. Somewhat hard B, extremely hard A. But he's funny and nice and willing to help. And he's very crafty and very understandable about his students.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you want someone who explains concepts very very well and who will help you with anything, then take Mr. Chan. But be warned: his tests are extremely challenging. Adds 5% for \"test corrections\" though, and 89.5% overall is an A, 79.5% a B, etc. He's just like a high school kid and is pretty funny","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Chan is hecka cool. He's actually like your peer, a really smart, married peer...I once mistakened him for a student! He's so laid back too. My class got to go to Great America cause he didnt wanna teach, we also had a bbq. =D His tests are kinda hard tho, I always run outta time. But he's a wonderful teacher that explains things really well and will help you if you ask. If you're debating whether to take him or Sullivan, take him! I took Sullivan and his class was horrible.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Although I never had him for a class, I needed some help with my PreCalc homework, so I went to him for help, since my teacher wasn't in the department. He showed me exactly what to do and is SO incredibly helpful. Amazing teacher!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very good option for matematics courses","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for Accel. His tests are a poison to your grade. Take him if you want to LEARN something, but not if you want an easy A. He DOES give tutoring when you need it. He's cool, but a tough teacher.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"We shall have another year together!! All thanks to the difficult final! :)","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Haha, he's really chill, but his tests are really something else...","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best teacher ever Teaches and explains very well A deffinite take for PC H","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really cool teacher. he helps you A LOT and helped me stay in the passing region for accel","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"well, I could honestly say the PC course i took over the summer was NOT HARD ENOUGH. its like the non honors one, so i ended up getting B+/A- in his class. his tests may SEEM easy after you take it, but really, theyre hard. he's a good teacher, but goes super fast, hard to absorb everything. since im a freshman, it might be better to get advice from someone who has a bigger brain capacity than me...but i got As and Bs on like on the tests, not that hard, but you cant be careless.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's definitely improving in terms of challenging work and really teaching us stuff. Actually does teach you but goes really fast so you might need to ask for more help. Not too hard a grader but doesn't give much time for tests. He isn't perfect but he's really cool and I always look forward to his class.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Chan is a really nice teacher with a good sense of humor . Doesn't check homework often, but will go over a problem if you ask. His tests are a bit hard, and there is one every week, but he drops the lowest score every trimester. If you pay attention while he teaches, take notes , and study before the tests, you should be fine.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"AWESOME","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had chan for precalc h, really good at explaining the concepts. the tests are ok, and theres usually a joke in the somewhere. really cool teacher and i learned a lot from him","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"not too good at explaining to class but is good when you ask for private help. tests kinda tricky, but hes pretty cool.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"omg...hes the best!! he was so easy for pre calc last year, but the things i learned really helped me the following year in ap calc. hes very young and goofy, and relates to his students","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's on the students' side... not an evil teacher who doesn't like giving out A's... fair grading... goes too fast sometimes though...","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"better chan or hoffman for calculus?","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very good. He's always very willing to help you if you don't get it. You should ask a teacher if you don't get something anyway. He explains things very well and is there if you still don't get it. He has killer tests sometimes though, especially if you can't do word problems very quickly. He teaches accel very well. He's even ahead of some other classes (and he even went over material that wasn't required) Very good choice. Pick HIM!!!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Grades are based almost entirely on tests, and his tests are really hard, especially in the time given. You will learn a lot in his class and he teaches well. Knows his subject very well. Doesn't check HW, but doing the HW will help you on the tests. He's a pretty cool teacher. Hard class, but you learn a lot.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Chill teacher. Accel Honors tests are crazy hard. But he's really easy to talk to.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take him if you can! He's very chill, funny, and extremely helpful. He explains the material clearly and offers help when needed. His tests are pretty straightfoward, as long as you listen in class and take notes. He's given a lot of extra credit this semester.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Chan is such a nice teacher! if you ask him for help he'll stay after school with you to explain the material!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. chan is an okay teacher. he tries his best to explain things and helps if you still need help. he's not too tough, getting an A is definitely possible.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Super good; super hard.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Chan is an awesome math teacher. He really knows his stuff teaches the lesson really well (but you have to pay attention). While we do group work, he'll come around the tables and help students who need it. He's extremely funny and charismatic, which helps if you hate math. Math is very difficult for me and I did really bad initially (wer'e talking F's and D's). He uses material from past tests for the new tests, so if you progress, he'll grade you accumulatively. I went from a 61% to a 89%.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Chan is really CooL. He brought us milk and cookies tWiCE...but he's not very clear on his \"lectures\". If you ask him for private help, it's better.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great math teacher. The only problem are his tests, which are hard. He's a super good teacher though. He comes around to the tables and check if you have any problems. If you do, he'll do them on the board and explain it to the class as well.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He makes his tests tricky..-__-","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Go to his class everyday and pay attention. As long as you pay attention and you do the homework you'll be fine. He's a really cool teacher and if you need help he'll help you. You'll need to put work into his class but if you need any extra help he's there. Awesome class and awesome teacher. I had him for geo.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"in a group setting, the students can sometimes dominate and over-arouse him. individually, he is SOOO helpful. VERY VERY VERY VERY VERY smart (so don't try to act smart around him; it'll just prove ur own insecurity)","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Awesome, though I wish he could make his tests just a little bit less...\"out there\". They're not math tests -- they're Chan tests. He needs to hurry up and teach Calculus BC already! D= I want *** calculus time!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Chan really helped me understand the content but I get why some people don't. I had him for my first two years at Lowell and I only didn't take him again cause he didn't teach my classes. Definitely a good teacher to connect with and he's always willing to work with students one-on-oneSubmitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Overall, Mr. Chan is an extremely funny guy with a good sense of humor. I had him for senior year, Advanced Algebra, and I was failing his class because although he can teach, he was a fast teacher so I needed extra help but my schedule and his weren't compatible. I asked him about my final since I was the only senior to actually attend his class and never skip, he gave me a passing grade and told me not to take the final which was ANXIETY RELEASING!Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really good teacher. Hard tests, but he teaches well to make up for that. Actually, at the beginning of the year, his tests were rather easy (easy B hard A), but this this semester (S'06), his new test style makes it harder.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Impossible tests, but they really prepare you for the final. It may seem that he's not teaching you very well sometimes, but at the end of the year, when you take the final (if you get an A or high B) you will thank him.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"fun, hard, helpful if you ask him about it","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"What was he thinking when he made the final!? It was NOTHING like the minifinal..I only finished 10-15 problems in an hour! My math grade is ruined.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A for Advanced Algebra, fun class, and you will learn","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not sure how easy the rest of the accel teachers are, but my overall was a very high C, and he still made me drop to algebra2. Good luck, study HARD.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he explains in simple terms, and its all clear. he's always willing to help you if u don't get it. tests are hard. lots of trick questions, and long questions that are hard to do in the limited time he gives you.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's nice, but is NOT a teacher-type of person. cant really explain well either.u gotta go during your free mods 2 ask 4help if u need it. otherwise his lectures dont help at all","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very good teacher. Knowledgeable. Funny. Knows what he's doing.Can definitely respect him.Plus, sees him in weight room, and I think he does martial arts. He's willing to go through the pain to get a sharp mind.But if you don't understand math, if you don't learn to read math by tracing the proofs and train deliberately, he's not going to dig you out of the gutter previous math classes put you in. Bit hard, in that case.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Chan is nice and won't lose his temper even though the whole class has gone wiiillldd!!(i've been there, trust me).. but he gives a lot of difficult tests after like, 3 days of learning whats on there. otherwise, he's pretty cool.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MR CHAN !!!! Honestly one of the best teachers I've had. Very kind, understanding, and wants the best for you. His class moves quickly and the weekly quizzes are hard, but he really makes sure you know what you're doing. Drops lowest test scores and curves your grade. Also hilarious.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ive had him freshman year and all junior year. he used to be horrible...but now hes a great teacher. he explains a lot better. i guess it comes with experience. his tests are really hard...no wonder he teaches only honors. hes always there to help. a B is very possible. not sure about that A though...","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Chan is pretty easy if you are good at math. But as a person who isn't very good, all you have to do is pay attention and do all the homework questions to make sure you understand the concepts. The tests are pretty difficult and sometimes he throws in questions that can be tricky. You should be able to get a B or higher if you try. He also helps you one-on-one, which is really helpful because he makes it easy to understand.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I shall miss thee, Chanman!! :( It feels weird not having you for math. I'll still bother you, though! ^^","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for advanced algebra. Super helpful, explains lessons very clearly, and funny. His tests are manageable (for the most part) too. There's test corrections offered that'll add a little more points to your test. I'd take him again.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"doesn't know how to teach well, he doesn't really explain","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easiest teacher of my life constantly on my Phone in class, but maybe that's because I have one of the highest grades in his PreClac honors class, don't know why people get C's and D's.Submitted by a student","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Chan is a great teacher. He's a nice guy and is always willing to help you after class/school. The class is fairly easy and if he sees that you are trying hard and puting in effort, he may boost your grade. Recommended.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lol. He acts like a teenager sometimes. He's cool and fun, but his test might be challenging for some of you. It's possible to get C on his test and get a B on the class. With some luck, you can actually get an A because he does the improving grading system where if you improve each quarter by a who","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Just pay attention and ask for help if you need it. Good overall teacher.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Chan is the best math teacher I have had so far in Lowell. He teaches really good, he explains everything clearly and he doesn't mind to help you after school. His tests are really hard ,as in Accel H, and worth a lot. His quizzes are pretty easy not as hard as his tests. Homework everyday,but he doesn't really check it and he will go over the next day. Overall, he is hard, but you learn things!!!!!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"awesome teacher. it's hard, but just study, manage, and it's possible to do well","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy B, hard A. Nice but tests are tricky. \"my milkshake brings all the boys to the yard!\"","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had him when i was a freshman for accel math and thought he deserved a good review. definitely one of the best teachers of all time. Hard class, but explains everything extremely well and is always trying to help you learn. and he's a homie","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's hilarious and his class is very enjoyable. sometimes so silly, he reminds me of me!","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He comes up with quiz questions on the spot and is very unprepared.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's not the best at explaining things, but i feel like we know some things better than the other classes. his tests are very challenging and contain things that youve never learned in class. thats his way to \"challenge\" us- and that it does.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Grades are mostly based on tests, which aren't that easy and we have one every week.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Chan is one of the best math teachers ever! He explains the material well and is willing to help if you ask for it. As long as you study the material that he goes over in class, then you can get a decent grade. But his tests are like hell. Make sure to pay attention.","rating":4.4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is such an amazing precalc h teacher. people think he's hard, but really if you listen to him in class, take notes, and do your homework, the tests are really easy. I came from the regular track (geo, adv. algebra) and I'm doing well. I study 30-60 mins for his tests so its not an easy A if you don't study. But hes an amazing teacher and he ACTUALLY TEACHES!!! he makes you understand pre calc! I would definitely take him again b/c he is a wonderful teacher that will prepare me for the finals","rating":4.4,"version":1}],"rating":4.39560439560439}},"__N_SSG":true}