{"pageProps":{"teacher":{"name":"Tyler Centers","departments":["Math"],"semesters":["Spring2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Algebra 1","block":"1","semester":"Spring2019"},{"name":"Algebra 1","block":"3","semester":"Spring2019"},{"name":"Algebra 2","block":"2","semester":"Spring2019"},{"name":"Algebra 2","block":"4","semester":"Spring2019"},{"name":"Algebra 2","block":"6","semester":"Spring2019"},{"name":"Algebra 1","block":"1","semester":"Spring2020"},{"name":"Pre-Calculus","block":"2","semester":"Spring2020"},{"name":"Algebra 1","block":"3","semester":"Spring2020"},{"name":"Algebra 2","block":"4","semester":"Spring2020"},{"name":"Algebra 2","block":"6","semester":"Spring2020"},{"name":"Algebra 1","block":"7","semester":"Fall2020"},{"name":"Pre-Calculus","block":"1","semester":"Fall2020"},{"name":"Algebra 1","block":"7","semester":"Spring2021"},{"name":"Pre-Calculus","block":"1","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-20T23:10:14.067Z","text":"Mr. Centers is super nice and if you get math and are able to self study and participate a bit I would definitely recommend taking him. Tests are quite a bit harder than homework though.","rating":4,"version":0},{"timestamp":"2020-05-09T20:59:32.962Z","text":"He is a very nice teacher and teaches very precisely. He reiterates concepts over and over again which is nice for you to get it in ur mind. His tests are kind of hard however. They are usually 3-6 pages long. He does curve, but if you don't have any alg 1 knowledge, this class might be a bit of a struggle. ","rating":4,"version":0},{"timestamp":"2020-05-07T06:49:57.851Z","text":"Algebra 1: I had a strong understanding of algebra but I still struggled on his tests. They are very long and contains some stuff that requires extra thinking outside of what he taught us. Participation was straight forward and easy to get points for. Homework was also based on completion. I had him fall 2018-2019 for reference","rating":5,"version":0},{"timestamp":"2020-05-07T00:26:49.995Z","text":"Mr. Centers is a really nice guy with a pet cactus named Filbert. He’s pretty good at teaching and everything we go over in class makes sense. However, his tests are super long and hard, almost always on things we didn’t go over. Only on two occasions have I had time to finish a test let alone done well on it. He has the idea that since we learned how to do a type of problem that we we will be able to figure out how to do way harder version of that on a test. Mr. Centers is a nice guy though and if your really good at math you’ll probably be fine. ","rating":3,"version":0},{"timestamp":"2020-05-06T22:20:10.573Z","text":"Had him for Algebra 1\nPros: Nice, pretty chill and funny\nCons:  Tests are tough, participation is a big part of your grade\nOverall, if you put some effort in, an A is manageable","rating":4,"version":0},{"timestamp":"2020-05-06T17:27:35.398Z","text":"I took his Alg 2 class and I have to say that you probably shouldn't take him unless you are very confident in math or are already reasonably familiar with the material. My overall experience (that I have heard echoed by others who took his class) is that everything we discuss in class is incredibly easy to follow. However, every one of his tests are almost entirely problems that we didn't directly go over and are instead things he believes you 'should' be able to figure out based on what we learned. Generally, this wouldn't be a problem for most people except for the fact that all of these tests are probably twice as long as they should be considering the time we are given to take them. If you are simply engaged in class you are looking at a low B or a high C. Unless you spend an extensive amount of time using outside resources (tutor, khan academy, reading the textbook, outside/prior alg 2 knowledge) you will not get an A in his class.","rating":3,"version":0},{"timestamp":"2020-05-06T17:24:43.432Z","text":"Centers is, in general, a very nice dude he just isn't the best at communicating with students outside of his lecture script. He also doesn't accommodate students very well. He uses a point participation system that I found challenging since there are certain parts of the room he doesn't pay as much attention to. That hindered my grade in a way that I found very frustrating. He will, without fail, spend the first 15-20 min of your test time giving the same speech (word for word) about test procedure. The class isn't engaging in any way but it isn't overly difficult. I felt aggravated at times because the format caters to the students who already have a relatively good grasp on the concepts of the class (which admittedly a lot of Lowell students have).","rating":3,"version":0},{"timestamp":"2020-03-27T05:04:36.697Z","text":"Overall Mr. Centers is an understanding, cool (sometimes), and nice teacher! I am a student who is HORRIBLE at math, but I find his class not that hard. Classwork and Homework is pretty easy, he mostly grades the, from completion and I love it. Though, his tests are very challenging for me. Participation is also a big factor in your grade! I find it a little bit challenging to get an a in his class ( I always get B’s ) but I wouldnt take any other teacher just cause I heard worse about other math teachers. ","rating":4,"version":0},{"timestamp":"2019-05-28T05:34:23.737Z","text":"I really like Mr Centers! He's very funny and kind and is good at explaining things. However, his class is definitely not an easy a as his tests are often very difficult and he has some very strict grading policies (no rounding whatsoever :/) so sometimes it feels a little tiring when you study a lot but still don't do well on the tests. However you do learn a lot in an engaging way.","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Centers is a really cool teacher. I currently have him for Algebra 2 and I believe this is his first year teaching!Submitted by a student","rating":4.7,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Our lord and savior.Submitted by a student","rating":4.7,"version":1}],"rating":3.9454545454545458}},"__N_SSG":true}