{"pageProps":{"teacher":{"name":"Wendy Jones","departments":["Visual Performing Arts"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Dance 1","block":"3","semester":"Fall2014"},{"name":"Dance 1","block":"4","semester":"Fall2014"},{"name":"Dance 2","block":"5","semester":"Fall2014"},{"name":"Dance 3","block":"7","semester":"Fall2014"},{"name":"Dance Production","block":"8","semester":"Fall2014"},{"name":"Dance 1","block":"3","semester":"Spring2015"},{"name":"Dance 1","block":"4","semester":"Spring2015"},{"name":"Dance 1","block":"3","semester":"Spring2015"},{"name":"Dance 1","block":"4","semester":"Spring2015"},{"name":"Dance 2","block":"5","semester":"Spring2015"},{"name":"Dance 3","block":"7","semester":"Spring2015"},{"name":"Dance Production","block":"8","semester":"Spring2015"},{"name":"Dance 1","block":"3","semester":"Fall2015"},{"name":"Dance 1","block":"4","semester":"Fall2015"},{"name":"Dance 2","block":"5","semester":"Fall2015"},{"name":"Dance 3","block":"7","semester":"Fall2015"},{"name":"Dance Production","block":"8","semester":"Fall2015"},{"name":"Dance 1","block":"3","semester":"Spring2016"},{"name":"Dance 2","block":"4","semester":"Spring2016"},{"name":"Dance 2","block":"5","semester":"Spring2016"},{"name":"Dance 3","block":"7","semester":"Spring2016"},{"name":"Dance Production","block":"8","semester":"Spring2016"},{"name":"Dance 1","block":"3","semester":"Fall2016"},{"name":"Dance 1","block":"4","semester":"Fall2016"},{"name":"Dance 2","block":"5","semester":"Fall2016"},{"name":"Dance 3","block":"7","semester":"Fall2016"},{"name":"Dance Production","block":"8","semester":"Fall2016"},{"name":"Dance 1","block":"3","semester":"Spring2017"},{"name":"Dance 1","block":"4","semester":"Spring2017"},{"name":"Dance 2","block":"5","semester":"Spring2017"},{"name":"Dance 3","block":"7","semester":"Spring2017"},{"name":"Dance Production","block":"8","semester":"Spring2017"},{"name":"Dance 1","block":"3","semester":"Fall2017"},{"name":"Dance 1","block":"4","semester":"Fall2017"},{"name":"Dance 2","block":"5","semester":"Fall2017"},{"name":"Dance 3","block":"7","semester":"Fall2017"},{"name":"Dance Production","block":"8","semester":"Fall2017"},{"name":"Dance 1","block":"3","semester":"Spring2018"},{"name":"Dance 2","block":"4","semester":"Spring2018"},{"name":"Dance 2","block":"5","semester":"Spring2018"},{"name":"Dance 3","block":"7","semester":"Spring2018"},{"name":"Dance Production","block":"8","semester":"Spring2018"},{"name":"Dance Production","block":"8","semester":"Fall2019"},{"name":"Dance 1","block":"3","semester":"Fall2019"},{"name":"Dance 1","block":"5","semester":"Fall2019"},{"name":"Dance 2","block":"4","semester":"Fall2019"},{"name":"Dance 3","block":"7","semester":"Fall2019"},{"name":"Dance 1","block":"3","semester":"Spring2020"},{"name":"Dance 2","block":"4","semester":"Spring2020"},{"name":"Dance 1","block":"5","semester":"Spring2020"},{"name":"Dance 3","block":"7","semester":"Spring2020"},{"name":"Dance Production","block":"8","semester":"Spring2020"},{"name":"Library Training 1","block":"1","semester":"Fall2020"},{"name":"Library Training 1","block":"2","semester":"Fall2020"},{"name":"Library Training 1","block":"3","semester":"Fall2020"},{"name":"Library Training 1","block":"4","semester":"Fall2020"},{"name":"Library Training 1","block":"1","semester":"Fall2020"},{"name":"Library Training 1","block":"2","semester":"Fall2020"},{"name":"Library Training 1","block":"3","semester":"Fall2020"},{"name":"Library Training 1","block":"4","semester":"Fall2020"},{"name":"Library Training 2","block":"1","semester":"Fall2020"},{"name":"Library Training 2","block":"2","semester":"Fall2020"},{"name":"Library Training 2","block":"3","semester":"Fall2020"},{"name":"Library Training 2","block":"4","semester":"Fall2020"},{"name":"Library Training 2","block":"1","semester":"Fall2020"},{"name":"Library Training 2","block":"2","semester":"Fall2020"},{"name":"Library Training 2","block":"3","semester":"Fall2020"},{"name":"Library Training 2","block":"4","semester":"Fall2020"},{"name":"Dance 1","block":"3","semester":"Fall2020"},{"name":"Dance 1","block":"4","semester":"Fall2020"},{"name":"Dance 1","block":"3","semester":"Fall2020"},{"name":"Dance 1","block":"4","semester":"Fall2020"},{"name":"Dance 2","block":"5","semester":"Fall2020"},{"name":"Dance 2","block":"5","semester":"Fall2020"},{"name":"Dance 3","block":"7","semester":"Fall2020"},{"name":"Dance 3","block":"7","semester":"Fall2020"},{"name":"Dance Production","block":"8","semester":"Fall2020"},{"name":"Library Training 1","block":"1","semester":"Spring2021"},{"name":"Library Training 1","block":"2","semester":"Spring2021"},{"name":"Library Training 1","block":"3","semester":"Spring2021"},{"name":"Library Training 1","block":"4","semester":"Spring2021"},{"name":"Library Training 1","block":"1","semester":"Spring2021"},{"name":"Library Training 1","block":"2","semester":"Spring2021"},{"name":"Library Training 1","block":"3","semester":"Spring2021"},{"name":"Library Training 1","block":"4","semester":"Spring2021"},{"name":"Library Training 2","block":"1","semester":"Spring2021"},{"name":"Library Training 2","block":"2","semester":"Spring2021"},{"name":"Library Training 2","block":"3","semester":"Spring2021"},{"name":"Library Training 2","block":"4","semester":"Spring2021"},{"name":"Library Training 2","block":"1","semester":"Spring2021"},{"name":"Library Training 2","block":"2","semester":"Spring2021"},{"name":"Library Training 2","block":"3","semester":"Spring2021"},{"name":"Library Training 2","block":"4","semester":"Spring2021"},{"name":"Dance 1","block":"3","semester":"Spring2021"},{"name":"Dance 1","block":"4","semester":"Spring2021"},{"name":"Dance 1","block":"3","semester":"Spring2021"},{"name":"Dance 1","block":"4","semester":"Spring2021"},{"name":"Dance 2","block":"5","semester":"Spring2021"},{"name":"Dance 2","block":"5","semester":"Spring2021"},{"name":"Dance 3","block":"7","semester":"Spring2021"},{"name":"Dance 3","block":"7","semester":"Spring2021"},{"name":"Dance Production","block":"8","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-08T23:28:05.484Z","text":"Boring and repetitive at times. Easy A but you have to put in a lot of effort. ","rating":3,"version":0},{"timestamp":"2020-05-05T01:57:36.700Z","text":"She's a nice teacher, and the class is an easy A, but it is also incredibly boring.","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"this class is plainnn FUN .. at first i was like >__< I DON'T WANNNNNNA GO TO DANCE! but nowww i look forward to it everyday! takes some time getting used to .. but it's my favorite class now. she's a real sweetheart & she really teaches you how to dance & makes you look GREAT. =] I LOVE YA MS JONES :D","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"LOVE MISS JONES!!! she does play favorites but she is still super nice to everyone. and i like that she doesnt just take dancers who have a whole bunch of training in dance into dance co and adv dance. if you show her you really love it then you def have a really good shot.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She does plays favorites but if you deffinitely work hard and seriously, then she will like you. These comments make her sound really mean but its not true. She does have mood swings but if you try your best, she'll cheer up a lot. If you TRULY like dance, the teacher's attitude doesnt matter","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love ms jones. I've had her for three years now and i look forward to her class every day. she does play favorites, but as long as you show up and make an effort, she will like you. TAKE DANCE!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she plays favorites. but it's a pretty easy class. all you have to do is pretend to try and you get an A- she only knows names of her favorites students though. although i have to say she treats and talks to us as if we are elementary students. take dance if you want an A to boost up your gpa","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Plays favorites. She'll like you if you're in company or has a chance of being in company. Acts nice, but is extremely unfair. Take the class anyway, cus she can be fun sometimes.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's really nice, but she plays favorites and she's bias. If you can't do ballet, jazz, tap, or modern, you need to try really hard to get on her good side.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MS. JONES. All the people who say she plays favorites and is not helpful are WRONG. Ask her a question. ANY question. She will answer, and be happy to. She loves people who try in dance. DUH, SHE'S A DANCE TEACHER. And no, you don't have to be perfect at ballet for her to like you, or for you","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes alright. as they said already plays favorites. just dress and try. easy A-. if you get an A you know your a favorite. careful when she gets mad. she blows up","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.jones is a very good teacher and you can tell she loves what she does. But I am bothered that she won't let good, dedicated dancers into her company if she believes they'd stand out.Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she DOES play favorites. incredibly so. i choreographed for the dance concert, but i had another performance during one of them. i was getting an a, but because i missed a high school concert for a real one, she gave me a c. i would think a dancer would understand. also her music choices are played out, and her modern/\"jazz\" choreo is uninteresting. her warm up is boring and never changes. the bad grade isn't coloring my thinking, it's all true. take the class anyways cuz dancing at all is good.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE YOU MS. JONES!!!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she certainly does not make an effort to get to know the students, but makes an effort to entertain us. is generally nice and easy going. supportive, but should give constructive criticism sometimes. dance is fun and relaxing. easy A.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her dance class is fun and I look forward to it everyday. I don't know if she plays favorites. I'm only in her beginning dance class. But she doesn't know people's names and I wish she would try harder to remember everyone. I understand that there are a lot of students in her classes, but other teachers with as much students manage to know everyone's name. Since she doesn't know ppl in class and we don't have any homeowrk assignments, I'm not sure how she grades but she gave everyone an A-","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took one semester of beginners dance. It's not easy for Ms. Jones to teach and choreograph for so many classes and organize a concert by herself. In class, She would show us the movements/stretches/dances and we would just imitate her. Easy A, VERY easy A, as long as you participate.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms.Jones! She has a slight temper, but that's b/c she takes dance VERY seriously. B/c so, she'll only take you seriously if YOU'RE serious and hard working about dance. Doesn't choose favorites, she just likes seeing hard work, dedication, and improvement. Respect the class and the art, she'll respect you. Her mom, who sadly passed away, taught her dance, so imagine her passion. Believe it or not, she actually knows all students' names. Advanced and Company are only for ppl who are ready!Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE Ms. Jones!! She is so nice and fun and I look forward to dance more than any other class in the day. If she tells you that you're not ready for advanced, its not because she doesn't like you, its because she's a professional dance teacher and she knows from watching you every day whether you're ready or not. Just try hard and have enthusiasm and fun!Submitted by a student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A. Beg. Dance, just follow what she does and she won't correct you or give you a bad grade. I've been late to class so many times, and she didn't mark me absent. Towards the middle to the end of the semester, the class gets boring and you start to lose motivation to go.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love mrs.jones! she's really funny and she's always making jokes to our class (usually dance related of course). just show up dressed and with a positive attitude to work hard and dance! if she doesn't know your name, don't worry, it's not like she hates you or anything.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Class is fun and easy. Teaches dance steps well. But does not get to know the students personally. She's mostly very fun but she can get mad.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Jones is one of the greatest teachers I've ever had. She doesn't play favorites at all! As long as you try and you work hard she will like you. She's a dance teacher but also a very caring a genuine person who cares about every single one of us in her dance class. Dance is not easy, but she makes it very fun.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes the BEST DANCE TEACHER!all bcuz of her i joined dance.she taught the dance company- &theyre amazing. join dance it'll be fun! get a chance 2 join dance co.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's like the only dance teacher, so there's not much of a choice. Her class is pretty easy and chill and its true she doesn't get to know any of the kids, probably only if you're good. Has a temper. In beg. dance, she didn't even try to correct you if you do something wrong. She just lets u do w.e","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I look forward to having dance ever day. It's the best class ever. In adv. dance, we actually have some book work. Mostly taking notes and writing about some dances. It's to benefit us in the future so we never forget what we learned. Yeah, she can be hard but it's for a purpose. She wants us to be disciplined in order for us to learn more. She's very knowledgeable. BTW, she's a licensed pilates instructor and her mother was a director of a dance studio. SHE KNOWS WHAT SHE'S DOING!!!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i learned alot. i build more balances and muscles. she goes a bit fast. you learn one step one day, and another the next. just practice for those who have trouble","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she plays favorites. and if she knows your name, you're probaly a favorite. she only gives A's or A+'s to her favorite students. for beg dance, she doens't teach much. gives us very kiddy and basic stuf, probaly cuz she know half of us is here it for credit. she talks to us like kids, 8 yr olds;nice","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Jones!!! And all of you who says she plays favoritism, it's just because you thought that you can take dance and not try hard and still get an A to add to your perfect GPA. If you take dance you have to be open to it and try as hard as you would in any other class.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Jones is the best. She plays favorites though :[ Her dance class is awesome. You learn and perfect your turns and etc, and you have fun. She goes fast on dance routines, but you practice them everyday, so you'll know them in time. Make sure you go to every dance concert, or school thing, or its a grade lower for you. xD I love Ms. Jones","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Jones is really REALLY nice, but she goes a little fast. If you don't understand then you should get help at free mods or something. They say she loses her temper easily, but I haven't seen it yet. Hopefully I pass the class. x_x -student","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She gives you an A- and doesn't attempt to get to know you. Easy, laid back class. Just don't chew gum and she won't hate you.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Jones is fine. Dance is fun. However, in the beginning of the year at back to school night for the parents, one parent asked what was required for advanced dance and she said she would make it clear and teach us what we needed to know. I WAS THERE. Guess what? She didn't. overall, ok. dance :)","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"gave me a B for no reason at all, when the whole class got an A. loses her temper very easily.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Jones is very helpful & nice. She'sfun and funny and has a ton of energy. If you have a question or a problem, she takes time to help you. I look forward to dance every day and my flexibility improved. It's my favorite class! You just have to put effort in.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i don't understand the ppl who say she is mean. She's nice and really is helpful. Yes, you should put effort in; she will reward those who show they truly love dancing. choreography=slightly limited. overall, cool teacher. note: if you can dance well, try to go to advanced. other levels=very boring.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. jones is the BEST! shes such a sweetheart and a great dance teacher. she doesnt lose her temper easily (unless youre obnoxious but who wouldnt lose it then?)","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love ms.jones!!! shes the best!!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"wait, this is the first time I have decided to add something onto this which is saying something. I love Ms. Jones, sure she may play favorites, but you don't have to be on company for her to like you. Just be nice and respectful, and really don't be a slacker unless she loves you, because she won't take any of that. but TAKE MS. JONES, she's the best and soo much fun! espeacially in aerobics.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"my reg teacher, SUP MS. JONES","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Jones is super cool and a really good dancer/teacher, but she's starting to buckle down a bit on grading, so don't slack off!","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a really good techaer and no matter what people say, she does not play favorites. She tries to help everyone improve, but its hard when there are 40 kids in her class. her choreography is really amazing and she doesn't just choreograph for one specific dance style; she varies from modern, jazz, ballet, and contemporary. If you hadn't taken dance before like me, she'll totally help you improve, and she cares a lot about studenta in all of her classes.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a really good dance teacher and teaches a lot of styles. However, she does play favorites.","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's awesome I love ms. jones","rating":4.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"people don't tell you this truth in hopes of not hurting your feelings. Ms. Jones usually only accepts people who has had previous dance experience in her dance company. You should only consider auditioning if you are currently taking dance. If you don't she will cut you out for the second part of dance company tryouts. do a whole year of dance. However some people DO make company without taking dance/previous experience but this won't happen that often. Sorry to say of the sad truth.","rating":4.3,"version":1}],"rating":4.264444444444447}},"__N_SSG":true}