{"pageProps":{"teacher":{"name":"William Steele","departments":["Social Science"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018"],"classes":[{"name":"American Democracy","block":"1","semester":"Fall2014"},{"name":"American Democracy","block":"3","semester":"Fall2014"},{"name":"United States History","block":"4","semester":"Fall2014"},{"name":"United States History","block":"6","semester":"Fall2014"},{"name":"United States History","block":"7","semester":"Fall2014"},{"name":"American Democracy","block":"1","semester":"Spring2015"},{"name":"American Democracy","block":"3","semester":"Spring2015"},{"name":"United States History","block":"4","semester":"Spring2015"},{"name":"United States History","block":"6","semester":"Spring2015"},{"name":"United States History","block":"7","semester":"Spring2015"},{"name":"United States History","block":"1","semester":"Fall2015"},{"name":"United States History","block":"3","semester":"Fall2015"},{"name":"United States History","block":"7","semester":"Fall2015"},{"name":"American Democracy","block":"4","semester":"Fall2015"},{"name":"American Democracy","block":"6","semester":"Fall2015"},{"name":"American Democracy","block":"4","semester":"Spring2016"},{"name":"American Democracy","block":"5","semester":"Spring2016"},{"name":"United States History","block":"1","semester":"Spring2016"},{"name":"United States History","block":"3","semester":"Spring2016"},{"name":"United States History","block":"7","semester":"Spring2016"},{"name":"United States History","block":"4","semester":"Fall2016"},{"name":"United States History","block":"6","semester":"Fall2016"},{"name":"American Democracy","block":"1","semester":"Fall2016"},{"name":"American Democracy","block":"3","semester":"Fall2016"},{"name":"American Democracy","block":"7","semester":"Fall2016"},{"name":"United States History","block":"2","semester":"Spring2017"},{"name":"United States History","block":"4","semester":"Spring2017"},{"name":"United States History","block":"6","semester":"Spring2017"},{"name":"American Democracy","block":"1","semester":"Spring2017"},{"name":"American Democracy","block":"7","semester":"Spring2017"},{"name":"United States History","block":"1","semester":"Fall2017"},{"name":"United States History","block":"3","semester":"Fall2017"},{"name":"United States History","block":"7","semester":"Fall2017"},{"name":"American Democracy","block":"4","semester":"Fall2017"},{"name":"American Democracy","block":"6","semester":"Fall2017"},{"name":"United States History","block":"1","semester":"Spring2018"},{"name":"United States History","block":"3","semester":"Spring2018"},{"name":"United States History","block":"7","semester":"Spring2018"},{"name":"American Democracy","block":"4","semester":"Spring2018"},{"name":"American Democracy","block":"6","semester":"Spring2018"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"Horrible, he is everything you are not looking for in a teacher: Boring, does not teach, condescending, goes on tangents, assigns worthless assignments, and is unhelpful. He yells at students, gets mad when students yell out answers, doesn't answer students when they raise their hands, just sits at his desk and writes assignments on the board. All we've done so far in the first 3 weeks is four chapter assesments, 7 maps of the world, and more dumb work. One of the worst teachers I've ever had.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a lot of outlines!! tests aren't really that bad. gets off topic a lot! a lot of movies (they're pretty interesting). he can be pretty boring though. you don't really learn that much in class. basically you teach yourself. i think he's ok","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i don't get why everyone says he's bad. i actually like his class. Even if he gets off topic, the other topic is usually pretty interesting. and i LOVE his inpersonations. Its soooo funny!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Steele actually knows whats he is teaching. you have outlines and other hw. But he tends to collect them a few days later. The tests are ok if you study. Getting a bad grade? he gives out extra credit. I mean i raised my D from test scores to an A with the Hw, EC, and project in a quarter. he grades based on participation and homework.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a very nice person with a soft heart, but a bad teacher. He's rea","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Okay nice guy, super liberal and funny in an ironic way, but he has his moody moments. He teaches lecture style and it's impossible to stay awake, esp having him first. Also shows a ton of videos, sometimes on the quizzes. The tests itself are usually okay but you need to study the textbook to pass. Not hard to get an A and the final is on the last two ch we learned.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not the best, do not recommend. He is quite hard and VERY boring.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"boring teacher but such an easy A...he gives extra credit sometimes if u do wkbk pages but his lectures r the boringest thing on the planet >.< i cannot tell u how many times i fell asleep in class yet i still get an A in class","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really easy. Voice is really boring but he is very funny (sarcasm). Little to no homeworkSubmitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he blames george bush for all the world's problems.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"USH - If you're looking for more visual than actual lecture/interactiveness, then Mr.Steele is the guy for you. He likes showing movies. Take notes, and you'll succeed. Mood swings often occur also.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I like Mr. Steele's class. He shows us intertesting movies a lot that aren't just boring history movies. Sure, his lectures are long but they are informational. You will learn a lot in his class if you actually pay attention. He is definetely not as bad as most people say he is.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Steele is not that horrible. I had him for a whole year my freshman year and he was alright. I loved how he was so sarcastic. He might have gotten stricter by the end of the year, but he actually made me learn.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Not a good teacher . i had him for modern world and i didnt learn anything he didnt teach anything and he gave too many test considering that he didnt teach anything. i would not recomend him and he's too focused on geography altho he doesnt really teach it","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's so boring. he has boring lectures about almost everyday and I cannot learn from him. I just do the homework and study myself. I don't even listen to him and I get an A.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Super easy A, just do your homework. If enough people do badly on the tests, he literally gives everyone like a 10% boost. He's really nice but sometimes has mood swings.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I don't know why everyone doesn't like him. He's actually pretty cool. Sometimes there is a big workload when trying to catch up. He's pretty funny though and plenty of extra credit.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Likes cats, tell funny stories, when I had him the tangent went off to organic farming for 2 days in a roll. Tests aren't that hard. Truly a Lowell gemSubmitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he only cares about participation, and he's pretty easy. he only remebers your name if you are a troublemaker, or if you annoy him alot. he doesn't know your name outside of class though...but he's cool","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A really sweet guy, though he can be really confusing and digresses almost all the time. I would not take him for an ap class again, but definitely a cool guy who really cares about history, perfect for someone wanting a nice laid back class that can be really interesting :)","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's a boring teacher, and has mood swings now and then. he gives A LOT of extra credit. do ANY homework you are assigned because it will help you in the end. overall easy A","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Steele may not be the best teacher for a student who is going to expect intereactive learning experiences.But he is a teacher who is willing to go out of his way to help you if you are willing to ask for it. Though his class is very laid back.He has a soft heart and really nice person.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I actually enjoy being in Mr. Steele's classes. Although it is extremely boring, you can lay back on homework as he doesn't collect until the end of the grading period. Sure, he's moody, but just do well with his tests and you'll be okay. Easy teacher, just boring class.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"As one of my friends described him, he is a cranky Santa Claus. His lectures are rants made of run-on sentences, disorganized ideas, and biased views. Take him, and you will learn from movies, online articles, and maybe, his horrible lectures. Although it's possible to pass the class doing something more productive during his class (i.e. sleeping or doing other hw), coming to class on time and participating is recommended. Also, keep an eye out for his rare homework assignments.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Don't take him. Boring lectures and he hates children (why did he become a teacher?).If u had to pick from him and Fisher(also a boring teacher) pick Fisher, atleast he's likeable.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"eaaaassy....he gave a 50 question test...you had to get 35 right for an A + and the rest are extra credit...i got a 49 and got an A+ in the grade reports...just read the book and the chapters for tests...dont study your notes and stufff like that....they dont help at all...but act like you do take notes in his class...i sleep in his class","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Worst teacher ever. He does not teach, goes off topic, thinks of himself as a perfectionist, and gives out up to 3 tests per week (nope, not kidding, and very hard ones too, since he does not teach, just make us read from the book). Try to avoid him if you can.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Lectures are boring and he digresses way too much. Do not have a single idea on time management -- my class spent too much time on movies and we have to cram 6 chapters in 2 weeks. However, he can be funny and I don't think he realizes it when you do homework during his class. If you actually read t","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"(This pertains to Econ, I can't speak for AmDem): It's mostly common sense. Skim the last few pages of the chapters you have tests on — we had three in a semester — and you'll be good. His lectures are pretty much unnecessary but make sure to turn in work, even if it's BSed.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Steele is an absolutely horrible teacher. most boring class i have ever taken. Not only is he mindnumbingly dull and boring, he also is constantly is a terrible mood and acts as if he hates children and hates teaching and everything is a complete drag to do. One of the worst teacher at my time at lowell . DO NOt Take ItSubmitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love mr steele. he can be an easy A, but lots of people get low grades because he is very unclear about his tests and hw","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had mr. steele last year for APUSH and this year for american democracy. As i grew closer with him, i really started to like him more as a teacher. If you actually listen to his lectures/what he says in class, they actually have substance. He really cares about current events. very sweethearted","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"extremely boring classes, the only thing he does is lecture and half the time it's not even about U.S history. You can get away with sleeping in his class, but he does ask you to take notes that he collects maybe 2 to 3 times a semester. pretty easy tests and easy enough class overall, he usually likes to cram in a lot in the last grading period because our class went so slowly which is kind of annoying.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a cool guy, he's boring but easy A. Best teacher for Modern World!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Funny, easy A","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He seems like a very \"confused\" teacher, he goes off topic a lot. Sure the things he talks about are interesting most of the time, but in the end when he gives you a test, its on stuff he didn't cover in class and you had to teach yourself through one of his many outline assignments. we watch a lot of movies in his class, but he never finish them and they seem to have little relevence to the material we are learning. He is not very clear eaither to what he wants you to do.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST TEACHER EVA!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Gives really long boring lectures. I don't think he notices if you sleep in his class. really inconsistent and often doesn't finish projects. Do all your homework-he'll collect it at random times. Gets random mood swings where he becomes unnaturally happy. If you actually listen, you learn a lot.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Steele is definitely in my top 5 teachers at Lowell. Very funny (sarcastic,dry), very knowledgeable, and teaches you important current events that no one else is talking about. Tests are easy if you just pay attention in class and read the book. There's pretty much no hw, just read the book.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I've had Mr. Steele for many semesters. He truly just wants to teach what he knows to students who are eager to learn, and he isn't afraid to admit he doesn't know something. If you ask him about something he's not sure about, you can research it and get extra credit. He's super liberal and his sense of humor is gr8!!Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"As long as you're not playing jokes against him he'll help you alot, it wasn't boring lol look back to your flash back memories, his boring stuff were all his test questions and answers. he show you tons of movies and no stupid idiotity projects","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Steele is the easiest teacher I've ever taken. He gets off topic a lot, and he's not very nice. You don't learn anything at all.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Steele can be insensitive when talking about historical events like the holocaust. He says horrible things that may be true but are upsetting, and unnecessary for learning. It's ok to sleep in class, or look at your phone(I wasted a lot of cellular data), just read the chapter the night before the test. The test questions are sometimes super random or confusing. He also takes like 100000 years to pass out tests, but I dig his style- that carhart jacket-beanie combo is cool.Submitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Steele has a great sense of humor. His voice is kinda boring but he mimics a lot of people so it's all good. He knows a lot about current events and are my favorite part of the class. He syncs with the books so you can follow along. Exams aren't too bad if you don't overthink it. There's no homework. He's one of those cynical teachers that go off on entertaining tangents about how messed up our politics are. Great teacherSubmitted by a student","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you actually pay attention, he's a good teacher.","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ha yeah when he's in a bad mood he gives lots of hw/tests, but when hes in a good mood hes a g ...pretty funny sometimes....other times hes kinda boring...we watch movies frequently... but yeah im takin him next semester","rating":3.3,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He makes current events relevant to your life.","rating":3.3,"version":1}],"rating":3.3000000000000003}},"__N_SSG":true}