{"pageProps":{"teacher":{"name":"Wilson Sinn","departments":["Math"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Accelerated Math Honors","block":"2","semester":"Fall2014"},{"name":"Accelerated Math Honors","block":"6","semester":"Fall2014"},{"name":"Geometry Honors","block":"3","semester":"Fall2014"},{"name":"Geometry Honors","block":"5","semester":"Fall2014"},{"name":"Computer Programming","block":"8","semester":"Fall2014"},{"name":"Algebra 1","block":"4","semester":"Spring2015"},{"name":"Algebra 2","block":"2","semester":"Spring2015"},{"name":"Algebra 2","block":"6","semester":"Spring2015"},{"name":"Algebra 2","block":"8","semester":"Spring2015"},{"name":"Accelerated Math","block":"2","semester":"Spring2015"},{"name":"Accelerated Math","block":"6","semester":"Spring2015"},{"name":"Geometry","block":"1","semester":"Spring2015"},{"name":"Geometry","block":"7","semester":"Spring2015"},{"name":"Geometry","block":"3","semester":"Spring2015"},{"name":"Geometry","block":"5","semester":"Spring2015"},{"name":"Algebra 1","block":"2","semester":"Fall2015"},{"name":"Algebra 1","block":"4","semester":"Fall2015"},{"name":"Algebra 2","block":"6","semester":"Fall2015"},{"name":"Algebra 2","block":"8","semester":"Fall2015"},{"name":"Geometry","block":"3","semester":"Fall2015"},{"name":"Algebra 1","block":"5","semester":"Spring2016"},{"name":"Algebra 1","block":"7","semester":"Spring2016"},{"name":"Algebra 2","block":"4","semester":"Spring2016"},{"name":"Algebra 2","block":"8","semester":"Spring2016"},{"name":"Geometry","block":"3","semester":"Spring2016"},{"name":"Algebra 1","block":"4","semester":"Fall2016"},{"name":"Algebra 1","block":"8","semester":"Fall2016"},{"name":"Algebra 2","block":"5","semester":"Fall2016"},{"name":"Algebra 2","block":"7","semester":"Fall2016"},{"name":"Algebra 1","block":"2","semester":"Fall2016"},{"name":"Algebra 2","block":"5","semester":"Spring2017"},{"name":"Algebra 2","block":"7","semester":"Spring2017"},{"name":"Algebra 2","block":"4","semester":"Fall2017"},{"name":"Algebra 2","block":"8","semester":"Fall2017"},{"name":"Geometry","block":"3","semester":"Fall2017"},{"name":"Geometry","block":"5","semester":"Fall2017"},{"name":"Pre-Calculus","block":"7","semester":"Fall2017"},{"name":"Algebra 2","block":"4","semester":"Spring2018"},{"name":"Algebra 2","block":"8","semester":"Spring2018"},{"name":"Geometry","block":"3","semester":"Spring2018"},{"name":"Geometry","block":"5","semester":"Spring2018"},{"name":"Pre-Calculus","block":"7","semester":"Spring2018"},{"name":"Algebra 2","block":"3","semester":"Fall2018"},{"name":"Algebra 2","block":"5","semester":"Fall2018"},{"name":"Geometry","block":"4","semester":"Fall2018"},{"name":"Geometry","block":"8","semester":"Fall2018"},{"name":"Pre-Calculus","block":"7","semester":"Fall2018"},{"name":"Algebra 2","block":"3","semester":"Spring2019"},{"name":"Algebra 2","block":"5","semester":"Spring2019"},{"name":"Geometry","block":"4","semester":"Spring2019"},{"name":"Geometry","block":"8","semester":"Spring2019"},{"name":"Pre-Calculus","block":"7","semester":"Spring2019"},{"name":"Algebra 2","block":"2","semester":"Fall2019"},{"name":"Algebra 2","block":"4","semester":"Fall2019"},{"name":"Pre-Calculus Honors","block":"8","semester":"Fall2019"},{"name":"Algebra 2","block":"2","semester":"Spring2020"},{"name":"Algebra 2","block":"4","semester":"Spring2020"},{"name":"Geometry","block":"5","semester":"Spring2020"},{"name":"Geometry","block":"7","semester":"Spring2020"},{"name":"Pre-Calculus Honors","block":"8","semester":"Spring2020"},{"name":"Algebra 2","block":"8","semester":"Fall2020"},{"name":"Pre-Calculus Honors","block":"4","semester":"Fall2020"},{"name":"Pre-Calculus Honors","block":"6","semester":"Fall2020"},{"name":"Algebra 2","block":"8","semester":"Spring2021"},{"name":"Pre-Calculus Honors","block":"4","semester":"Spring2021"},{"name":"Pre-Calculus Honors","block":"6","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-07T18:45:42.071Z","text":"He's great because he teaches the material really well. He moves pretty fast and tests make up most of your grade (about 1 every 2 weeks). The tests are reasonably hard. It's an achievable A since he curves tests, drops your lowest score at the end of the semester, and rounds up if you're at 89%. He's also a great lecturer who can explain new concepts in digestible ways. If you pay attention in class, do the homework, and study some you can learn a lot.","rating":5,"version":0},{"timestamp":"2020-05-05T02:43:18.644Z","text":"He is very cool and teaches well, tests are kind of hard and they are 75% of the grade at least for geometry but he's a cool guy I recommend ","rating":5,"version":0},{"timestamp":"2020-05-04T19:23:17.705Z","text":"Loved his class! It is a hard A but pretty achievable B since he drops you’re lowest test/quiz grade. He teaches really well and makes the class fun. After his lesson you can do whatever you want and Mr.Sinn is super chill.","rating":5,"version":0},{"timestamp":"2020-05-04T05:31:15.289Z","text":"A very good teacher, but also very hard teacher. Don’t underestimate the difficulty, you will definitely learn a lot. He moves quite fast, and gives homework on a daily basis. I wish you best of luck if you’re in his class.","rating":4,"version":0},{"timestamp":"2020-05-04T05:07:47.550Z","text":"Incredible amounts of tears. I did not know how much liquid could come out of my orifices. God, it hurts so much. \n\n\n\n\nBut it feels good too.","rating":5,"version":0},{"timestamp":"2020-05-04T05:06:24.343Z","text":"Yahhh that’s hot. Ahhh that’s hot. He’s a very old and very handsome guy. Rawr XD","rating":5,"version":0},{"timestamp":"2020-05-04T05:03:51.557Z","text":"I’m gonna be perfectly honest with you. He’s hard as hell. But if you take your time to learn, you will succeed. He’s funny, chill and overall a good teacher. His explanations will make sense once you listen. \n\nRemember though, just calm down :)","rating":5,"version":0},{"timestamp":"2020-05-04T05:00:28.758Z","text":"great teacher, i cried a lot though but thats because im bad at math! dw though we had a lot of fun <3\n","rating":5,"version":0},{"timestamp":"2020-05-04T05:00:18.857Z","text":"best math teacher he explains every concept well. you can even get help from him after school. ","rating":5,"version":0},{"timestamp":"2020-05-03T01:56:55.993Z","text":"hes really nice so if you dont understand something he'll help (or you can just mess around in class), but just make sure you prep for the test. The afterschool, pre-test meetings help","rating":5,"version":0},{"timestamp":"2020-05-02T04:43:50.803Z","text":"Very good and chill teacher, gives quick informative lectures at the beginning of class and lets you do the homework (or mess around) afterwards for the rest of the class. Gives challenging tests, but never tests you on any concept that he hasn't already taught well. Achievable A as long as you pay attention and do the work. ","rating":5,"version":0},{"timestamp":"2020-01-30T03:53:59.624Z","text":"His lectures are short but do a good job of teaching the concept. Do the homework so you can practice the concepts and talk to him in the half of class where you just do homework or mess around if you're struggling and he'll help you out.","rating":5,"version":0},{"timestamp":"2019-12-14T05:18:10.803Z","text":"Although I do not pay much attention, I pay enough attention to know that he actually teaches a lot of material, while being decently difficult.","rating":5,"version":0},{"timestamp":"2019-12-10T20:04:20.444Z","text":"I love Mr. Sinn\nHe’s a really hard teacher but very smart and an amazing person. ","rating":5,"version":0},{"timestamp":"2019-10-25T06:32:37.651Z","text":"Only take his class if you're good at math and want a challenge.","rating":4,"version":0},{"timestamp":"2019-05-27T22:16:03.760Z","text":"Easy class based on the fact that he curves tests + quizzes, drops your lowest test + quiz, and rounds your grade up by 1% if u do all homework assignments","rating":5,"version":0},{"timestamp":"2019-05-27T21:47:28.576Z","text":"Very handsome teacher, he is smart and cute, and drinks a regular coke daily, as all real intellectuals do.\n","rating":5,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":":D One of the best math teachers ever! He's really nice and helps you if you need it.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had him for geo. a really good teacher. but definitely not easy. you have to work for your grade. a fun class in general. and you get to learn a lot.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Tests are really hard Quizzes are easier He jokes around in classSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is an amazing teacher! Although the curriculum moves insanely fast, he tries to make sure everyone understands the material as quickly as possibleSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He the be easy good teacher. I are have learned lot math, like the addition of many numbers. He good for get A, I not go class and still he give to me A. So I think all should have good time with him. He even take own time for to help you out of the class, he can teaching you many new thing in the life.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Hard on tests. Easy quizzes. The comment below has to be a genius because the class averages are B's and C's. Very few A's.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a good teacher, nice guy. But his sometimes have stuff you haven't reviewed in class. Aoverall I recommend him.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hard tests, sometimes class gets boring","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is one of my favorite teachers at Lowell. I took him for freshman geometry and no other teacher really compares. His tests are by no means easy, but as long as you pay attention in class, take good notes, and do the homework you should do well in the class. People might say he's a tough teacher, but he is really helpful and will help you understand any topic you're struggling with if you ask. Come to class everyday ready to learn and you can get that A!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr Sinn is a great teacher. He gladly gives help if you don't get it. His tests can be tricky, but do all your homework and you'll pass","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He talks and discusses about one direction with the class. It's gr8. He gives us generous curves and stress. He's very fun to joke around with and easy to get along with. But very hard tests !!Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"An outstanding educator. My daughter had him twice and both times he was excellent. Reasonable homework assignments, good test prep and review. Tough standards, but he provides such comprehensive support that it's achievable. Sets a standard that provides Lowell students with a reastic challenge!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn knows the material very well and is willing to help every student. Just do your work and pay attention during class, you'll love it!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is extremely hard, plus you get homework everyday! I recommend you pick Rosales ; ;","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's an extremely difficult grader and I was struggling for an A (arena is very soon) . I would not ever take him again (I wish I had first pick). As a new teacher, he is obviously very strict and exorbitantly unfair (please don't take him if you have first pick), which is magnified by his inexperience, disorganization and inability to explain basic material (don't sign up for McClish either). In fact, he once announced a chapter test, THE DAY BEFORE WE TOOK IT. I recommend taking Hunt or Costa.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is an amazing, thoughtful, and a really really funny teacher. I've had him for Accel and Geo H. Now, his class is very hard though. Some problems on his tests just kill everyone. However, our class averages usually stay in that 70-85% range, so the tests are doable. He teaches with the white board and asks students to solve the problem along with him. I personally feel that he teaches Geometry better than Adv Algebra, but he teaches both very well. I love Sinn.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Although his tests are hell, they're curveable. He teaches really clearly and well, so if you have a question, don't be afraid to ask him because he's really nice and helpful. Plus, he's really funny and generally a good guy, so don't be afraid of him just because of the SINN TESTS.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"By far my favorite teacher at Lowell! I doubled up this year and was struggling through the curriculum, and after his lesson, he saw me working on Geometry homework, came up to me and asked if I wanted any help with it. Those extra periods he gives for homework time, really can do a lot, if you focus. Although many people say his class is hard, I just don't see how. So long as you pay attention during his lectures, it is quite easy to get an A.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Sinn was the one of the best math teachers i ever had!! i had him my whole freshmen year and even went to him for help when i wasn't even in his class sophmore year. take him because he does want you to understand the subject. easy B hard-ish A just work for it!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Helped me whenever I had trouble.I learned alot from his class!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I learned a lot from his class. I was challenged by the difficulty, but it's fun. Study hard and have a keen eye and you'll get an A on his tests! Don't get too frustrated, and ask him for help if you don't understand something. Funny and sarcastic too. Loves all his students. Assigns hw every night except the night before a test. Homework helps a lot. Explains material very thoroughly. He goes over homework the day after. Ask for clarification if you don't understand something. Take him!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think he teaches very well, and he is also patient. A few times I would go up to him and he would ACTUALLY HELP. Call me crazy, but there are very few teachers at Lowell who would do that. recommend","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He gives tis to his students on how to injure each other in the best way possible, and recommends clawing at othersSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Godly!!!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took him for algerbra 1. He knows what he's talking about, and teaches very well! He's pretty funny too, and will really try to help you understand the material. He uses the red textbook, so if you need additional help, just look to the textbook! If you have a good understanding for math already, you'll prob get As, but if you don't you might not want him. He sometimes curves the tests but doesn't round your grade up. I'm usually in the high 80s so... and the tests are mainly your grade :)Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MY FAVORITE MATH TEACHER!!! he was absolutely awesome!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"such a cool person to talk to. best reg teacher! can ask for help in math","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I loved having Mr. Sinn! I had him for Algebra 1, second block. I thought having second block math would be a terrible way to start the day, but it was great! You're seated in tables to bounce ideas off each other, so I had a lot of fun getting to know my group. If you need an explanation, he's quick to give it to you. He'll keep explaining until you understand. Some teachers shut you up if you're confused, but not Mr. Sinn. He's funny and grades on a curve although his exams are challenging.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is not only humorous but he is also helpful and a great teacher!! His test are however difficult but if you study you should do fine. Remember the other students are taking an equally difficult test so all you have to do is be better than","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"It was also my plan to post that Sinn was bad. But I didn't have the heart to do it. Everyone wanted him because he's fantastic. The fact is, Mr.Sinn isn't a blown-out 50-something who just reads aloud from a math book like its story time, owns a couple cats, and doesn't care about the students. For those reasons, Mr.Sinn isn't your typical Lowell math teacher. As jealous as I am of the magic 30 or so who got him, I know would've made the same decision.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very good teacher, but very hard. Take him if you want to learn. Dont take him if you want an A.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good for geo, but not great for Accel.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's a very nice teacher and kind of outgoing and sometimes jokes around in class. He's patient with his students and his test aren't too hard. Do your homework cause it's a big part of your grade. If you don't know the answer to a problem, he wouldn't embarassed you. And he doesn't pick on students. I think he's a great teacher and I would take him again.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he rocks my socks.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn's class is something special. You need to be either a genius or a dedicated student to succeed in his class. His tests are very difficult and it is critical that you understand EVERY problem in the chapter you're being tested on. His quizzes are very easy, however, and are just the homework and rarely harder. He is very clear when he teaches, and if you pay attention, you will understand the material. If you want a guaranteed A, look up college or math olympiad problems to help study.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Dear Lowhell students, his name is sinn for a reason. Like he said, if you do your homework and understand the material than you will do fine. His tests are \"hard\" in the way that it is more thought provoking. It is not impossible to get an A on his exams, but just remember they are not your typical plug and chug questions, you need to truly understand how to do the questions backwards and sideways (basically understanding what da hell your doing). dw u can ask him for help!Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best math teacher I've ever had. I had Fahey last semester and my life was hell. Mr. Sinn explains everything really well. You can tell that he's extremely passionate about math by the way he teaches. Class is never boring! You're going to laugh everyday, I promise. I have a B right now, which might ruin my record of having straight A's for 7 years, but it's worth it. You WILL learn. Now if only he could be my math teacher EVERY year... lol","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is my favorite math teacher. Funny guy with a good sense of humor.I had Mr. Sinn for accel 1H and 2H. He is willing to help us and clear stuff up when we need it. His quizzes are kinda easy, but his tests are hard. The good thing about his tests is that he curves them when we don't do so well. Reasonable amount of homework everyday. Easy B, somewhat hard A.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hes a cool teacher... pretty hard but he'll explain things to you if you dont get it. DO YOUR HOMEWORK and if you dont know how to do a problem you have to try in order to get a stamp","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice class but his tests are killer! remember to study a lot","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My favorite class ever. He's clear at explaining things and he's really funny. If you listen and understand the stuff, you'll get a good grade. Ask him anything and he'll help you. I love his class a lot. Best Geo teacher ever.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"go mr. sinn!!!!! it would be so cool if he taught accel next semestre, if he is, i'll definitely pick him","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is by far, one of the most difficult math teachers I have ever had, although you do learn a whole lot in his class. The homework is fairly easy, but the tests and quizzes are pretty difficult, so you should study a little more if you want an A. Overall, Mr. Sinn definitely prepares you well for your future math classes.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you like puzzles - his tests are kinda like puzzles. Hard for most people, but I got 101.5% by Aprilish so I just decided to slack after that for an easy A :PDoes curve and drop lowest test score","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is very knowledgeable and not just in math. He is wise and can give you great life advice. I really like his teaching style. It is easy to get an A in Algebra 1 and first semester of algebra 2 but second semester is when it gets hard! So it is really recommended to talk to him and ask him questions if you don’t understand something.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Geometry. Really good teacher. Explains really well. Not too much hw (about 10-20 problems a day). Tests are kinda hard, but study and you'll be fine. Best math teacher I've had so far.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's really cool. very good teacher and he's always willing to help. his tests are hard though. LOL! it's funny how he's a christian but his last name is Sinn.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Good teacher but only take him if you are a math godSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"With Sinn you definitely have to work for your grade. I had Mr. Fahey the semester previous and it was a breeze, but with Sinn...let's just say I failed my first test because I didn't realize how hard you actually had to study. I spent the whole semester with a B because recovering from an F is tough, but with getting an A on the final I can proudly say I got an A- in the class. Overall, take him if you're up for the challenge. And if you're not the best in math, it's not impossible to get an A!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"(Precalc) One of the best and hardest teachers I've ever had. Your overall grade is basically your test grades, so don't take him unless you are confident in math.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is a great teacher. He's really funny and we often laugh a lot in our class. He is a pretty hard math teacher because it's VERY HARD to get As in his class. But he pushes you and make you study for your tests. His explanations are crystal clear and you really learn a lot from him. HE DOES NOT ROUND UP GRADES. I got 89% for two of my grading periods which sucks. But he does drop your lowest test/quiz grade and also make curves. I would recommend those who don't want easy As to take him.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"GREAT TEACHER!! His lectures are very clear, hw every night helps a lot with really learning the material. The only downside is he puts questions on the test that you've never seen before, but you should be able to figure it out with the material he's taught. I suggest don't take if you aren't too confident in math but overall good teacher.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"tests arnt that hard..but people seem to always miss details (me) great","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is really good, you do get homework everyday, but he is nice and helpful if you ask","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Sinn is awesome. His last name makes sound scary. Lol. But he's not. Really good teacher and a very fair grader. In the beginning, I was like \"OH NO! I'M GOING TO FAIL!\" In the end I got a B+ in his class.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"do your homework because he checks nearly everyday and it will count for alot of your grade. in class you either go over homework, do homework, or take a test/quiz. laid back class","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Excellent teacher! Best Geo teacher especially if you struggle in math. He's very helpful and easily approachable. Btw. our class scored the highest on the Geometry Department Final last year","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great Awesome Helpfull teacher!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He gives pretty difficult tests, but he will curve based on a class average. He is very engaging and knows what he is talking about. Your worst test and quiz, at least for his Accel class are dropped. Good luck though","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is a really cool teacher. I took him for Accel 2, and didn't do so well. However, this isn't because of a fault in his teaching but my lacking mathematical skills. very nice and fun to talk to about anything and everything. pokes fun at students but very funny. likes chicago sports teams. highly recommend!!!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Study/ask questions, and you will be fine. Seems a little odd/intimidating at first, but the class is really pretty fun. take him if you are good at math. had him for accel. and did well. warning: your intelligence may be insulted.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Sinn is the best math teacher Lowell will ever know!! He's always there for tutoring, he wants all of his students to understand the material, and he's a nice guy. With the math department easily being Lowell's worst department, Mr.Sinn changed things by being a math teacher you can actually understand and learn from. It was so depressing in Mr.Hunt's class this semester (Sinn's was full!), so make sure to take this amazing teacher while your pick is still good!! I wish mine was.. :(","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is a great teacher!!! He has a great personality and actually teaches. Homework was 25%, so that really helped the grades. There should be more teachers like him.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"psh idk what everyone is complaining about the hard quizzes/tests...they're hella easy. have him for accel and i have been getting over 100% all semester =] srsly, he's a good teacher :D","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"well he used to teach better, but i guess everybody gets tired . this semester he explains some lessons too much and rushes on others, and makes really hard unexpected tests. class is getting very confusing...","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Although he is funny, when you ask him to explain material, he just makes it all the more confusing. In addition, he will make you feel bad if you got a low test score or incorrect answer. He also makes fun of students in his class, but in an unfriendly manner.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"had him for accel math 1H. he's super nice","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His class is really hard and I wouldn't suggest taking him unless you're a math god or don't care about your grades. You'll learn a lot, but if you miss one day you'll usually miss an entire lesson and fall behind. He will also put questions on the tests that you have never seen before and have no idea how to do. He is a good teacher, but I had a pretty hard time in his class and I wouldn't suggest him to anybody I know.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ditto, dude..finding his class hard","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Sinn for algebra 1 and he was so difficult. I used to be quite good at math until sinn and got a B!! :-( He is a great teacher, funny and easy to understand. I understood everything, the homework and study guides in textbooks and FAILED my tests. Quizzes are timed, not too hard. Test are so hard, you will see something you've never seen thats 10x harder and confusing! He adds things he's never taught us before and expects us to know the \"concepts\". DO NOT TAKE IF U WANT AN A!!!! RUINS 4.00Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is a great teacher! I like his teaching style and he is helpful if you need explaining. He lectures and assigns homework daily, but the workload is manageable. It can be stressful though, his tests are HARD. Sure he curves, but I wouldn't depend on that. He isn't the easiest teacher to have, if you like to challenge yourself and can accept that you might not get a high grade, take him. But I wouldn't recommend taking him if you don't like math or you just want an easy A.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Everyone said that Mr.Sinn is the hardest possible teacher in any math subject, I disagree. I really like his teaching style and he's really funny as well. I'm not going to lie, his tests are fairly hard if you don't get the material but luckily he is there after school to help you understand it. Definitely better then Mr.Hoffman. I recommend you take him if you want to be academically challenged but not so much that you stress a lot. I hope to have him again next year!Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Sinn is awesome, but his tests are killer and can be confusing...","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"The hardest teacher I have ever had in my entire life. Take him if you don't care about your grades or your future.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"His tests are hard.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very knowledgeable, but has a horrible attitude. If he doesn't like you, he'll make it so apparent to the entire class. A good teacher is not only someone who is knowledgeable and hardworking, but who is also respectful and considerate.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is the smartest, most wise teacher I have ever met. If you are stupid and don't really pay attention, you won't get an A. He really cares about his students and will help you if you need it. He also reads every single student, so don't think he doesn't pay attention. If he hates you, his comments can be pretty hurtful, but they are so funny. Even though I am somewhat failing his class, it is my favorite class because he is so funny and cares about his students.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is definitely not an easy teacher, but if you want to learn, take his class. I've had him for two semesters. He teaches the lessons in good detail and he is very humorous. His quizzes are much easier than his test. I would say that his class is an easy C/B, but if you thoroughly study for his tests and quizzes, it's not impossible to get an A.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he makes me question why I bothered to apply to lowell. gl if you take/ have himSubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the best math teachers at Lowell. His class is very fun and he tries to know each and every student. If you have him for honors, good luck.. You will learn lots and his tests are difficult but feel free to ask for extra help!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher!! Mr.Sinn, u rock.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Had him for Geo 1 and is probably one of the BEST math teachers at Lowell. Listen in class","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Great teacher, always there to help anyone who needs it. Tests can be a bit tricky like other people have said. But he is very nice and extremely good at teaching the material. If you have a question, he will answer it. Take him if you get the chance!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Demanding & creative. Expected students to work to a high standard, but gave a great deal of support and was very thoughtful and reasonable when life got in the way & catch up needed to be done.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is a fun teacher who you can joke around with and laugh. I don't find him strict at all and I finish his homework really easy. I also like his group activities. He may be a little strict but it's normal for that. You can't always expect teachers to be easy and ot make you do anything or what is the point of school? I love Mr. Sinn's class.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's my favorite math teacher. Very clear and very helpful. You can go to him with ANY questions whether about math or not. His tests can be a bit tricky, but if you do the work, and get help from him when you need it, you can get a B.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is AWESOME!! He's soooooo nice!! But be prepared to have a quiz or a test every week. Quizzes are straight forward by his tests are usually hard. He's also there to help u out when ur having trouble with the material.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST MATH TEACHER I'VE EVER HAD!i learned geometry in a way that actually made sense.pretty hard class so study study studyif you dont understand ask him! and if you are embarassed, ask after class!he is so cool and can talk to you for hours about monty python!!!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is nice, but he is hard. Get ready to take a quiz/test every week. Lots of work, but you'll understand the topics. Somewhat okay B, hard A.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's an awesome teacher. He's extremely smart and is really helpful at teaching. His tests are hard but he helps you really learn and understand the material so you can handle it. Also his classes are always funny and his sarcastic jokes brighten my day.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"All of you people who say that mr. sinn is bad, please take back your words. he really is a good teacher that is really hard to find at lowell. he actually cares about his students and helps them out. . he is extremely clear when he explains problems and he never picks on people. some teachers pick on students but he doesn't do that. so pick him it was a great experience have him as a teacher. i'll definately miss having him as my teacher. =)","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Drop out immediatelySubmitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took him for Algebra 1 freshman year and his class was extremeeeeeelyyyyyyyyyyyyy difficult.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"somehow i found his tests hard. he's really nice and is a good teacher. take him if you can.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Take Mr. Sinn if you want to worry about your grade constantly or if you are a math genius. Otherwise, if you are not a math genius and still take him, you are most likely going to fail the second semester if not the first. He makes the easy materials seem extremely difficult as well.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he is the greatest teacher ever, but his tests are soooo hard! but his class is so fun. he always keeps his class fun and we always laugh and joke around. however, be ready for his tests. his tests are the hardest ever!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"HE'S THE BEST TEACHER ON EARTH.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher, homework is manageable, quizzes are okay, but test are very hard for most people. he really isn't as hard as people say he is. just be prepared to work hard, pay attention in class and you will do well on his quizzes and test. the department final is nothing, after he prepares you :)","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i have him in the morning, and he's really enthusiastic. you have homework everyday, but if you don't understand something he won't pick on you. he'll explain it and be happy to re-explain it if you still don't understand. i think he's very cool. plus, the day before the test is a review day and he will even tell you what you need to know on the test. if you don't slack off and do your work, you'll do fine on the tests. go mr. sinn!!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had Mr. Sinn for Algebra 1. It was my most difficult class of the year, but I learned more math in a single semester than in all my other years of school combined. He is extremely knowledgeable in the subject. Some people feel that he moves too fast but his pace worked well for me. If you are interested in math and good at it I would highly recommend him; he'll challenge you and give you the skills you need to be successful and beyond. Otherwise, you may want to look for someone else.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr.Sinn is a great math teacher! He knows how to explain everything very clearly and can answer all of your questions when you need help. His tests are pretty hard, and he is a harsh grader, but if you know your stuff then you will do fine. If you're absolutely stuck on a problem on a test or quiz, definitely try and show any work you know because he'll give you some mercy points. He makes funny jokes a lot too, which makes his class enjoyable.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher! if you're not naturally good at math, don't take him though. his quizzes are very difficult with the time crunch, but tests are reasonable if you know the material. very funny and reasonable guy","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mister Sinn is a very good teacher that likes to challenge his students. If you aren't intrested in learning while failing, take someone like Miss Statmore or Mister Ambrose. Basically anyone But Mister SINN!! Things you need for the class includes, just paper, or a notebook for notes and homework. He is a knowledgable teacher but a dream crusher for all you kiddos that dream of UC BERK or for that matter any UC. Unless you are a genius or something, then you'll be fine.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"he's kinda hard now, i wonder why","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you have Mr. Sinn as your math teacher, you're in a safe zone IF YOU STUDY, even just a quick review before tests and quizzes. He is very humorous, people often laugh in his class. Although his homework only worth 10% of your grade, do it everyday. It will be your aid for tests and quizzes, especially for his tests, which is hard and worth 60% of your grade.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is definitely one of the best math teacher at Lowell.He can explain materials really well.He's tests are ok, but you gotta becareful with little details.Overall he is just an amazing teacher!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Mr. Sinn. Even though his class is the hardest class I have grade-wise, I still find enjoyment in it, compared to other classes. Lessons are super fun. He assigns and goes over homework daily, and has tests that require an understanding one level than that of the homework. But he curves test scores based on the class average(s). I found that to maintain a decent grade (solid B) in his class, I have to stay diligent at all times. It's not to be taken lightly unless you're some math whiz.Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is one of the more unique teachers you will find at Lowell. He engages his students with his humor with also provoking them to think, study, and absorb the information in preparation for tests. Study hard, ask questions, and you will do fine","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He's one of my favorite teachers, though lots of people are afraid of taking him because of the hard tests.And it's true--the tests are pretty challenging, but he curves based on the class average and you can get an A if you study.He's a great teacher and his teaching methods are clear and engaging for everyone. He's really funny too :) Basically, pay attention in class, study for the tests and you're all set!Submitted by a student","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ONE OF THE BEST MATH TEACHERS!! but you have to study for tests, and do all your homework to do well in class, he's not that hard, but definitely not easy.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"mr. sinn is a great geometry teacher. he is always willing to go over problems and is ready to answer any question. his quizzes and tests are okay (he does curve some tests) highly recommend him!","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"He is a great teacher, his lessons may seem confusing but he does take the time to answer your questions. If you pay attention and not be afraid to ask for help, you will do fine :) He's pretty cool and outgoing, and is a great geometry teacher.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn really knows how to teach. He is really friendly and always ready to help you. :)","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is a very good teacher. He teaches really well and adds a little bit of humor to his lessons. He can really connect with his students. His tests are extremely difficult, but he curves the test up based on class average.","rating":4.5,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mr. Sinn is easily the best math teacher I've had at Lowell so far. It's very clear that he knows what he's talking about and he makes sure to go over the material thoroughly. His tests can be a little challenging, but if you pay close attention in class during his lessons and do the homework, you're completely capable of doing well on his tests. Plus, he's funny if you get to know him a little better, so by all means, take Mr. Sinn if you really want to learn! :)Submitted by a student","rating":4.5,"version":1}],"rating":4.549242424242424}},"__N_SSG":true}