{"pageProps":{"teacher":{"name":"Xiaolin Chang","departments":["Foreign Language"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017"],"classes":[{"name":"AP Chinese Language and Culture","block":"1","semester":"Fall2014"},{"name":"AP Chinese Language and Culture","block":"3","semester":"Fall2014"},{"name":"AP Chinese Language and Culture","block":"5","semester":"Fall2014"},{"name":"Hebrew 1","block":"4","semester":"Fall2014"},{"name":"Hebrew 2","block":"4","semester":"Fall2014"},{"name":"Hebrew 3","block":"5","semester":"Fall2014"},{"name":"Hebrew 4","block":"5","semester":"Fall2014"},{"name":"AP Chinese Language and Culture","block":"1","semester":"Spring2015"},{"name":"AP Chinese Language and Culture","block":"3","semester":"Spring2015"},{"name":"AP Chinese Language and Culture","block":"5","semester":"Spring2015"},{"name":"AP Chinese Language and Culture","block":"1","semester":"Fall2015"},{"name":"AP Chinese Language and Culture","block":"3","semester":"Fall2015"},{"name":"AP Chinese Language and Culture","block":"5","semester":"Fall2015"},{"name":"AP Chinese Language and Culture","block":"1","semester":"Spring2016"},{"name":"AP Chinese Language and Culture","block":"3","semester":"Spring2016"},{"name":"AP Chinese Language and Culture","block":"5","semester":"Spring2016"},{"name":"AP Chinese Language and Culture","block":"1","semester":"Fall2016"},{"name":"AP Chinese Language and Culture","block":"3","semester":"Fall2016"},{"name":"AP Chinese Language and Culture","block":"5","semester":"Fall2016"},{"name":"AP Chinese Language and Culture","block":"1","semester":"Spring2017"},{"name":"AP Chinese Language and Culture","block":"3","semester":"Spring2017"},{"name":"AP Chinese Language and Culture","block":"5","semester":"Spring2017"}],"reviews":[{"timestamp":"0001-01-01T00:00:00.000Z","text":"","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she really cares about her students... on the day of the storm, everyone was soaking wet and she offered her jacket to keep us warm. she has good+funny stories about her life. she makes sure u understand the material and volunteers her personal time to help students falling behind. she doesn't wait for you to ask her for help, she just helps!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Chang is very sincere. Yes, she actually does care about her students. I can actually talk to her like a real human being. She teaches her student everything.. not only things that have to do with AP Chinese, but tries to inspire you to become a better person by introducing you to certain things she came across \"over the weekend.\" I absolutely LOVE her!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's such a great teacher! She's extremely helpful and patient. Her tests are not too hard and you are given multiple opportunities for extra credit! Definitely take her! :)","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"OMG!!! Awesomest chinese teacher ever... u actually learn and have fun at the same time!!!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Chang's so motherly, haha! Grades are mostly based off test. Barely any homework but homework don't count unless they're project. She's a really good lecturer. It's hard to not pay attention. :)","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is the best chinese teacher at lowell, shes funny and she makes the class fun. shes one of those teachers that can actually be a friend.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Like everyone else, i think she is very nice, and teaches you a lot. even when we had a student teacher, she was pretty patient. would definitely take her again. she's like a good teacher+mother combined.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST REG TEACHER EVER! I LOVE HER TO DEATH. She cares about everyone, even the ones that annoy her at times. What other reg teacher gives snacks out?weekly? :)","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's great!! very effective","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My best teacher in Lowell. I have her for Chinese 7/8. She's funny and teaches lots of stuff. A very friendly teacher, even with students who have problems.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"an amazing teacher, probably the best for chinese. Easy to understand, funny, not too much hw (atleast for us). I'm taking her right now (for ap chinese) and she's really great. She cares about her students, and gives us a lot of different oppurtunities to get involved with chinese writing contests and etc. Good pronounciation in chinese (of course, but i'm a native speaker who lived in taiwan 15yrs, and she doesn't have those accents from china that are sometimes funny...) and good english too!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"OH MAH GAWD. I freaking love Chang. XD She is the BEST Chinese teacher ever. She made me love Chinese, the language that is. Very funny stories and very nice. She doesn't go around calling people dumb if you do bad in her class. She helps you. :] Really good teaacher and fair grader.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is an excellent teacher...except for the part where she uses flashcards to call on people for project presentations and practice in class. But DO take her.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"GREAT TEACHER! She's fun, she goes over things, she has music CD's!!! she also has a good friend that sometimes subs...you can count on her for help...","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Chang is the best Chinese teacher!!!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i learn SO much from her. she drills it into you in a way that you dont even know that youre even learning the stuff.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MS. CHANG IS THE SWEETEST TEACHER I'VE EVER HAD. SHE CARES ABOUT HER STUDENTS SO MUCH. HER CLASSES ARE NEVER BORING AND YOU RARELY GET HOMEWORK AND IF THERE IS HOMEWORK IT'S BASICALLY VOCAB. TAKE MS. CHANG FOR AP CHINESE. SHE REALLY PREPARES YOU WELL. YOU GO TO THE COMPUTER LAB EVERY FRIDAY.Submitted by a student","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i LOVE ms chang! she is so nice, understangind, yet she still manages to get everything into your brain! she helps anyone who needs it. if she calls on you in class, but you dont know how to respond, she doesn't get mad, she is very nice! I lovee ms chang. I'll take her again and again in the years to come!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's amazing. She teaches well and she's incredibly nice. Also very willing to put in extra time to help her students.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"GOOD TEACHER TAKE HER!!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"BEST CHINESE TEACHER AT LOWELL!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Absolutely amazing teacher and person. Very understanding. She knows how to teach. She's so sweet and kind!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Laoshi chang is NICE! She's so clear and helpful. like just last week from now i totally failed a test, so she asked me to come to her office mod 8, and she was all wo bu xiao kan, and helped me study! Laoshi chang is NICE! RATE HER NICE!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is a really great teacher. i goofed off a lot in her class and everytime she will calmly tell you to stop. she is also super funny. really helpful.. you should all take her.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"this teacher is so kool. she good at teaching and she is kind. although i didnt get a good grade it was partly my fault. she assigns homework daily but its easy. she kool. limited spaces though.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MS. CHANG. SHE'S SO COOL AND BAKES US BROWNIES ;D","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"GREAT teacher. love her stories, love her way of teaching, love her enthusiasm. great person. she is YOUR friend","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Chang is the best Chinese teacher ever. She acts like your friend instead of your teacher. Her class is not hard, but fun.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Chang is awesome, and nice. She always brings us snacks during Reg, like how many other 2010 Reg teachers do that regularly? And she's sooo understanding on everything. She's so awesome.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. quizzes come quickly so be prepared. nice personality and occasionally pokes fun at her own english. a must have for freshmen taking chinese.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very good teacher. I had her for Chinese 1, she introduced me to Chinese and its basics. Her method of teacher was very helpful, allows the learner to memorize the Chinese characters and pinyin.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is very nice and very good, i strong suggest you take her class.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MS CHANG SOOOOOOOOOOOOO much. the end. THE BEST ever.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Chang is one of the nicest teachers I've encountered at Lowell. She takes the time to ensure that students understand the material in the course and does it with a smile everyday!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is really cool, funny, strict, teaches well, so definitely take her. You will have fun being in her class!!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"sooo chill cooool! i gotta admit tho, you gotta do really well on her tests or you're screwed. take her (: easier than danforth and clearer than li! haha","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MIIISSSSSSSSSSSSSSSSSSSSSSSS CHAAAAAAAAAAAAANNNNNNNNNNNNNGGGGGGGGGG I LOVE YOUSubmitted by a student","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"chang is the coolest chinese teacher. she's really funny and she makes it fun to learn chinese, so definately take her. she's a great teacher!!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She Owns.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes a good teacher and not that hard","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best language teacher you will ever encounter in you life. Her tests are easy if you do study and pay attention during class. If you have any question, she would always gladly explain stuff to you. And unlike most teachers, her jokes are actually funny","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best chinese teacher ever. Had her for AP Chinese, and it was an easy class. There's barely any hw, barely any tests, and it's an enjoyable class. Vocab quizzes are just a bunch of memorization and the lesson tests are only a bit harder. Ms. Chang's really nice, and she's cool. You don't really do much in class and it's pretty chill. Easy A if you truly try.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"can be hard if your like me and dont study and slack off. but really really really really good teacher esp. for chinese.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she gave me a ride to school! Thanks ms. chang! :D!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MS. CHANG IS AWESOME. (:","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i loved her. you learn a lot, but her vocab lists are like a tenth of the length of ms. ong's. she is adorable, and so fun to be in class with. it seems like she really wants everyone to just succed.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"oh my goodness, I LOVE MS. CHANG. she actually cares about her students, not like most of the teachers at lowell. i had a problem with my schedule, and she gave me advice for it though it didnt work =(. really great chinese teacher too.. i admire her kindness and mother-like personality:)!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"definitely one of the better chinese teachers. she doesnt have a heavy accent so she's easy to understand. she also cares about all her students as if they were her own children. very nice and grades fairly. she's also very helpful. to sum it up, she's awesome.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I LOVE MS CHANG! She's straightforward and very very VERY VERY VERY NICE! She explains things CLEARLY AND THROUGHLY! Had her for AP Chinese. She's awesome!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a great teacher, and has an earnest interest in her student's success. Take her or Mrs.Ong for Chinese, they are both the best in Lowell.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms.Chang! She's so nice, funny, and caring! She truly wants everyone to be prepared and do well for the AP Chinese exam. She usually tells you exactly what she expects on the tests (with a little bonus stuff that you should be prepared for) and isn't too harsh of a grader.Submitted by a student","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"\"The Best\"","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A decent amount of work for preparing for the AP exams, but prepares you well! Has various weekly class/homework assignments in preparation for the AP exams. 100% passing rate in the past! She is very nice and helpful to all her students~ Offers extra credit. Pretty humorous in class, sometimes brings food in. Doesn't give much homework, always tells you how to prepare for tests. I love Ms. Chang!Submitted by a student","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"don't get this twisted guys, she's great! really cool. just be prepare to learn.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Funny teacher. Very strict. Biased.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love ms. chang. she's like my second mother. she cares about all of her students like they were her own children. she is fair and clear at teaching. NEVER gets mad. introducing new hanzi on the board = a little messy. she's chill though! best chinese 1 or 2 teacher.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"A great Chinese teacher indeed! She speaks English very well and her grading system is the fairest of them all at Lowell. Gotta study those words and use your brain a little, even for chinese 1, but you learn so much in just one years time. Take her! xD can't wait till im a senior so i can take AP chinese with her!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"One of the better Chinese teachers, probably the best. You learn a lot, easy B, hard A type of teacher.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's hard and definitely pushes you, but you'll learn a lot. Very nice, helpful, and fair. Take her class if you can get in.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is such a good teacher. I don't know any Chinese at all, so I was discouraged when I realized that many of my classmates already knew the language (cheaters! D: ). However, with Ms. Chang's classes and a lot of studying/effort I still managed to get an A for the semester, because she just teaches that well. ^___^ I'm so grateful for being under her guidance. <3 Too bad she doesn't teach all the Chinese levels; without a doubt I'd take her class every time. =)","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"very nice and teaches the best!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"grades really hard, but makes a lot of curves in the quizzes n tests","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Chang is a great teacher! She really prepares you for the AP Exam and goes over all the material necessary for a 5. But she speaks a little fast sometimes so its hard to follow. Your grade is 100% tests. You only get deducted for not doing homework, so make sure you do! Nicest teacher ever!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's like the coolest chinese teacher and her teaching makes u a lot more comfortable with the language","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Chang can be described in one word. AMAZING! Grades are based mostly on test scores. If you need help, ASK FOR IT. She is committed to her students 100%. Super helpful, nice, and patient! :)","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes like the best. so AWESOME","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher. it's kinda hard to get an A unless you know chinese already...but take her anyways!!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I loved her. She's great. Really puts an effort in trying to teach her students. A little hard. Gotta study. But I like her lessons","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Everything about Ms. Chang is great. She teaches very well and she really does care about her students.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i miss ms.chang so much!!! i didnt get her this semester ); she REALLY knows how to teach unlike many other teachers. shes so understanding and loveable! her life stories are most entertaining.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Cool reg teach!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Chang is awesome! She doesn't give that much homework a night but you learn a lot in her class. Her class almost never gets boring either :) TAKE HER!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes the best teach you could ever have!!! theres hw but its not hard and its manageable.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Chang. She definitely knows her material. She gives a lot of helpful feedback. She prepared us well for the AP and only got mad at us once in the entire school year, and that time it was our fault. She never yells at you for talking or eating and usually doesn't care about tardiness.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best teacher to help you prepare for the AP Exam. Not only is she nice, helpful and caring, but she also was there when the AP Chinese exam was in the making, so she knows quite a lot about the exam material. Her tests are rather easy as long as you spend a little time studying. There is little to no homework (usually assignments on Fridays) and you still are able to learn a lot for the AP Chinese Exam.Submitted by a student","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy as hell. No need to study. I got F F A for the first three trimesters and ended up with an A because if u score highest in the end you get that grade =D. So feel free to cut for two trimesters then go third and study hard =D!","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"quite possibly the best chinese teacher in lowell. she's very nice and although hw is assigned regularly, it's on a CR/NC basis. had her for ap chinese and there was a small vocab quiz then a test per lesson. grading is very fair and she genuinely cares about her students and will put in the extra time to help you oustide of class if needed. she frequently calls on people in class and put you on the spot, but it's okay if you don't know it. she's very nice.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Chang is such a great teacher. She honestly cares for her students and is a a good teacher at the same time. She's very patient and pretty clear when it comes to teaching :D","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a must-take teacher. you learn the language in her class. she's hard but once you go to Chinese 3+, you would know chinese pretty well. difficult to get an A","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's the best teacher ever, loves ALL her students, doesn't play favorites, and actually cares for her students.","rating":4.9,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I love Ms. Chang <33 She's super nice, concerned, and caring. Best reg teacher ever (:","rating":4.9,"version":1}],"rating":4.899999999999995}},"__N_SSG":true}