{"pageProps":{"teacher":{"name":"Yu Li","departments":["Foreign Language"],"semesters":["Fall2014","Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Chinese 2","block":"3","semester":"Fall2014"},{"name":"Chinese 2","block":"8","semester":"Fall2014"},{"name":"Chinese Native 2","block":"8","semester":"Fall2014"},{"name":"Chinese 3 Honors","block":"2","semester":"Fall2014"},{"name":"Chinese 3 Honors","block":"4","semester":"Fall2014"},{"name":"Chinese 3 Honors","block":"7","semester":"Fall2014"},{"name":"Chinese 2","block":"3","semester":"Spring2015"},{"name":"Chinese 2","block":"8","semester":"Spring2015"},{"name":"Chinese 3 Honors","block":"2","semester":"Spring2015"},{"name":"Chinese 3 Honors","block":"4","semester":"Spring2015"},{"name":"Chinese 3 Honors","block":"7","semester":"Spring2015"},{"name":"Chinese 2","block":"2","semester":"Fall2015"},{"name":"Chinese 2","block":"8","semester":"Fall2015"},{"name":"Chinese 3 Honors","block":"3","semester":"Fall2015"},{"name":"Chinese 3 Honors","block":"4","semester":"Fall2015"},{"name":"Chinese 3 Honors","block":"7","semester":"Fall2015"},{"name":"Chinese 2","block":"2","semester":"Spring2016"},{"name":"Chinese 2","block":"8","semester":"Spring2016"},{"name":"Chinese 3 Honors","block":"3","semester":"Spring2016"},{"name":"Chinese 3 Honors","block":"4","semester":"Spring2016"},{"name":"Chinese 3 Honors","block":"7","semester":"Spring2016"},{"name":"Chinese 2","block":"2","semester":"Fall2016"},{"name":"Chinese 2","block":"8","semester":"Fall2016"},{"name":"Chinese 3 Honors","block":"3","semester":"Fall2016"},{"name":"Chinese 3 Honors","block":"4","semester":"Fall2016"},{"name":"Chinese 3 Honors","block":"7","semester":"Fall2016"},{"name":"Chinese 2","block":"2","semester":"Spring2017"},{"name":"Chinese 2","block":"8","semester":"Spring2017"},{"name":"Chinese 3 Honors","block":"3","semester":"Spring2017"},{"name":"Chinese 3 Honors","block":"4","semester":"Spring2017"},{"name":"Chinese 3 Honors","block":"7","semester":"Spring2017"},{"name":"Chinese 2","block":"2","semester":"Fall2017"},{"name":"Chinese 2","block":"4","semester":"Fall2017"},{"name":"Chinese 2","block":"8","semester":"Fall2017"},{"name":"Chinese 3 Honors","block":"1","semester":"Fall2017"},{"name":"Chinese 3 Honors","block":"7","semester":"Fall2017"},{"name":"Chinese 2","block":"2","semester":"Spring2018"},{"name":"Chinese 2","block":"4","semester":"Spring2018"},{"name":"Chinese 2","block":"6","semester":"Spring2018"},{"name":"Chinese 3 Honors","block":"1","semester":"Spring2018"},{"name":"Chinese 3 Honors","block":"7","semester":"Spring2018"},{"name":"Chinese 2","block":"2","semester":"Fall2018"},{"name":"Chinese 2","block":"6","semester":"Fall2018"},{"name":"Chinese 3 Honors","block":"1","semester":"Fall2018"},{"name":"Chinese 3 Honors","block":"3","semester":"Fall2018"},{"name":"Chinese 3 Honors","block":"7","semester":"Fall2018"},{"name":"Chinese 2","block":"2","semester":"Spring2019"},{"name":"Chinese 2","block":"6","semester":"Spring2019"},{"name":"Chinese 3 Honors","block":"1","semester":"Spring2019"},{"name":"Chinese 3 Honors","block":"3","semester":"Spring2019"},{"name":"Chinese 3 Honors","block":"7","semester":"Spring2019"},{"name":"Chinese 2","block":"1","semester":"Fall2019"},{"name":"Chinese 2","block":"2","semester":"Fall2019"},{"name":"Chinese 2","block":"6","semester":"Fall2019"},{"name":"Chinese 3 Honors","block":"4","semester":"Fall2019"},{"name":"Chinese 3 Honors","block":"7","semester":"Fall2019"},{"name":"Chinese 2","block":"1","semester":"Spring2020"},{"name":"Chinese 2","block":"2","semester":"Spring2020"},{"name":"Chinese 3 Honors","block":"3","semester":"Spring2020"},{"name":"Chinese 2","block":"5","semester":"Spring2020"},{"name":"Chinese 3 Honors","block":"7","semester":"Spring2020"},{"name":"Chinese 2","block":"1","semester":"Fall2020"},{"name":"Chinese 2","block":"4","semester":"Fall2020"},{"name":"Chinese 2","block":"7","semester":"Fall2020"},{"name":"Chinese 3 Honors","block":"3","semester":"Fall2020"},{"name":"Chinese 3 Honors","block":"5","semester":"Fall2020"},{"name":"Chinese 2","block":"1","semester":"Spring2021"},{"name":"Chinese 2","block":"4","semester":"Spring2021"},{"name":"Chinese 2","block":"7","semester":"Spring2021"},{"name":"Chinese 3 Honors","block":"3","semester":"Spring2021"},{"name":"Chinese 3 Honors","block":"5","semester":"Spring2021"}],"reviews":[{"timestamp":"2020-05-06T06:14:49.850Z","text":"Super nice. Hard to learn if you don't know Chinese already, but she is genuine and is very kind to her students. Pretty easy A just ask her to round up if you're borderline. Pick her over pang for Chinese 2. \n","rating":4,"version":0},{"timestamp":"2020-05-05T23:50:45.560Z","text":"Not bad, but be ready to hear lots of Chinglish. Doesn't know how to use technology at all (had to help her pause a video), but otherwise, very caring, doesn't have favorites, and is very lenient in terms of turning in work.","rating":4,"version":0},{"timestamp":"2020-05-03T00:19:38.747Z","text":"I took her for Chinese 2. She's a nice person and very approachable. Her class is not too fast paced. She is a good teacher for Chinese, and she cares about the opinions of students. There is not a lot of workload.","rating":4,"version":0},{"timestamp":"2019-11-14T02:55:53.567Z","text":"Have her for Chinese 2. She's really nice, and offers help if you need it. She mostly speaks in Chinese but sometimes in accented English. For me and other people, sometimes the instruction for assignments weren't the clearest. She did something called a culture activity once this semester, where everyone brings food; we all got extra credit for it later. She occasionally lets us out a few minutes early, maybe at least once a week? Her tests are not that hard to me but you still need to study of course.\nOverall I recommend taking her for Chinese 2 !","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"well i had her for a few weeks for chinese and then transfered to a higher lever, but in those few weeks, i just learned a few things. her english isnt that good, but her chinese is easier to understand and she is very nice. u dont learn much though, but if u want the easy A, take her.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"boring but easy","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I like Ms. Li, she's really sweet and people DO really have to stop taking advantage. I like her but at the same time I don't. She really DOES try to be a good teacher BUT she's not very good -__________-. I didn't learn anything =\\.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is such a nice and awesome teacher...her tests aren't too hard as long as you review, and if you actually pay attention in class, you might even do well on the grammar. yes, it does help if you already understand chinese, since she speaks a lot of it, but people really ought to appreciate her more.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Really nice teacher. She wants everyone to do well. Her tests are straight-forward, easy A if you study.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a bit hard to understand her sometimes due to her accent but her explanations are really good. all her tests are translations and she has easy homework. pretty easy A.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Personally i like her, she's not hard she's very lenient. If try and make the effort she will see and cut you a lot of slack.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i took her for chinese 1 & 2. so what if she has an accent? you actually LEARN the language, even if she makes it easy to slack off. shes super sweet and actually CARES about her students. i didnt know ANY chinese, but after a year with her, i knew about as much as those who took other teachers","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is not realli hired yet. basically being a sub. for chin. ez A onli if u noe chinese well.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her English isn't the best, and it might be hard to understand and learn from her if you don't already speak Chinese lol... I always doze off in her class cause everyone is so tired, she rarely turns on the lights, and the atmosphere, in general, is sleepy. She lets people go on their phones and nap in her class... She's a sweet lady but quite oblivious :/Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is one of the best Chinese teachers in Lowell since having taken Liang. I wish she'd teach AP Chinese too. Chinese 2nd Year: Tests are 99% from the translation sheets she give every lesson. Grading on projects are pretty nice and homework is sometimes checked but not graded. 3rd Year Honors: Same.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is a great Chinese 3 teacher! She not only offers help when needed, but also teaches you a lot about Chinese culture which is not included in textbooks. Ms. Li's tests are fairly easy as long as you pay attention in class, and her homework is fairly easy as well. She actually genuinely cares about each and every one of her students, and wants to make sure they are actually learning something in her class. Ms. Li is an awesome teacher, and I highly recommend her.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best teacher to get if you already know a bit of Chinese because if you don't then it is kind of hard to understand her accent. But, overall, easy tests, easy homework, easy A basically.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is a great Chinese teacher! She makes sure everyone in her class is learning the material and not falling behind. She is the nicest Chinese teacher I have ever had!Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is a pretty chill teacher, and she allows you to take short breaks during class. She also explains every topic in detail, and makes sure that you are learning from her class. She is a great Chinese teacher.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She may not be fluent in english, but her explanations do make sense, don't go \"but the book says this\", she KNOWS chinese. She's the teacher, she has experience, not the book.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She genuinely cares for each and everyone of her students. Make sure to participate in her class and she will instantly love you! Don't chat in her class too much or else she gives you the stare. Her tests are simple if you study the translations and chapter dialogue. Although she has an accent, she will explain grammar structures, etc. again if you are confused and need to hear it again.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is actually an ok teacher. She goes slower than the other chinese 1/2 classes, but that's what makes her class so easy. You can just write down all the chracters on the sheet beforehand, and then you can sit there and relax. If you are somewhat good at chinese at leasy, you'll get an easy A.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's nice and all, teaches you how to write some chinese, but never really discusses how to use the prescribed word. if you know some chinese and have a vague grasp of it, you'll survive fairly well.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is a really great teacher, if your not good at chinese you won't have to worry because she gives as much help as you need, the only homework there is, is writing characters and the tests are translations which she goes over a lot. I'd take her every semester","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms Li is not a very good teacher but shes super nice. dont take her for chinese 1 or 2 cuz then ull b screwed in 3. her test are doable but shes sooo boring... sleep like every other day.....","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. li is a nice teacher but isnt very clear when she speaks. her tests are easy as long as you study from the book. i would take her again but i hate the skits and oral presentations.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"li is one of the easier chinese teachers at lowell, but you will definately not learn as much. she is a lot better than pang though. i personally learned a lot from li and would have taken her for another year if i coul, but i had to take pang","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"OMG I LOVE MS. LI. SHE'S SO NICE AND HER CLASS IS SUPER EASY. ALL THE TESTS IN HER CLASS ARE BASED OFF THE DIALOGUE IN THE BOOK SO THEY'RE SUPER EASY.Oh yeah, find a good group or sit with your friends, otherwise you're probably stuck where you're sitting for the rest of the semester. You also do group projects with them so choose wisely.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"MS LI IS AWESOME. i came in to class not knowing ANY chinese, but she gives you second-chances to raise your grade. and shes REALLY nice, and from beijing, so her mandarin is soo good. shes kind of a pushover, but those who take advantage are just plain RUDE.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is a decent teacher, her class is what you make of it. You can predict her tests will always be on the translation sheet and \"Find the Chinese\" in the textbook. She's not that hard, and if you show her you really care, she'll give you the benefit of the doubt. Really nice lady, too.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She can't speak english, and when you're trying to talk to her, she doesn't understand what you're saying.everything out of the books.Doesn't know her own characters.no know pinyin","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li never gave up on me even though I was pretty bad at Chinese. She would always help me no matter what and even cut me breaks when she knew I was struggling. It can be hard to understand her at times, but she tries her best. She'll bring in little treats once in a while for holidays, etc.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is a good teacher if you have some knowledge of mandarin already. If you show a lot of effort and you aren't doing good in her class, she will push your grade up a little.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"VERY NICE CRAPY TEACHER NO OFFENSE SHE NEEDS TO BE MORE PRODUCTIVE N MOREINTERESTIN MAKES DA CLASS NEROVUS SAYS THE OPOSTITE OF WHUS SHE GOIN TO DO DOESNT TEACH WELL NEEDS TO IMPRO","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she talks mandarin a lot!!!! EVEN TO HER BEGINNING CLASS! we DONT understand her but she is nice and explains what she says and she is pretty nice about that","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Very kind and willing to help. Had her for 2 years; regular and honors. Her tests are based off of the translation worksheets and vocabulary. So, study those well and it'll be a pretty easy A.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I had her for two semesters and I was supposed to get a C, but she curved it for me because she knew I tried really hard, she's so nice!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is a very kind teacher. She will take the time to help you and explains everything if you ask. Her English may be awful but she is an easy teacher as well. Very reasonable teacher.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"NOT as easy as everyone says. You can't understand what she is saying in class (heavy accent)and tests are hard. You don't really learn much in her class and her grading system is flawed. Hard to get a good grade. Not recommended.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a pretty good teacher and you learn a lot. Tests are mostly translations, multiple choice, and dictation. Very easy as long as you do the translation packet she gives you before the test, and study the vocab words for each lesson.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"For Chinese 5 and 6, treat the vocab packet she gives you as your Bible for the class. If you know how to write each character for the section and the definitions, you should be in good shape for the test, as they are mainly dictation, English-to-chinese, and translations. The translations are usually lifted from the section's translations. Don't forget about deadlines for projects! Nice lady, although class can be dull.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Her english is not very good, but she is learning. (I heard her reciting some english words at her desk) Compared to Chang, Li is easier but you do not learn as much. She is very caring of her students. Here's a tip: for skits or speeches, try topics that would appeal to her for a better grade. (i.e. don't use too much bokgwai influence in your work)","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she doesnt speak english too well","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I respect that she really does try to improve on her english. So what if she has an accent? She's really nice, she offers to help you, her tests & homework is not bad at all.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes a very good teacher. you learn but still the class is a pretty easy A. her tests are just a dictation and translation. she only has tests: the infrequent homework does not really seem to factor into your grade. shes really lenient, only one problem: she mumbles and slurrs long strings of chinese and completely gramatically flawed english so you cant tell what shes saying ever. theres an art to learning how to filter and decipher her sentences. it took me many weeks...","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i honestly dont like her. she contradicts herself. class is soooooooo boring! she teaches incredibly slow. go learn some english","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I am not learning much because she speaks 90% of the time in Chinese. If you do not know Mandarin, it is really hard for you. Her class tends to be stressful, now, since she started added more projects and what not. It is mostly memorization, not learning. If I were to take a Chinese teacher though, I would recommend her.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a really great Chinese teacher, however, her tests are not too easy. Study the packets she gives you and the vocab in the book. Other than that, there is hardly any homework other than the packets that she gives every chapter.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ehh shes alrite u dont really learn a lot of things","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best Chinese teacher!Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a really nice and fair teacher, she does her best to teach all the aspects of Chinese. Sometimes she is too nice, people should appreciate her more.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is very sweet. She's a great person, but not a great teacher. Take her if you want the easy A. Stop taking advantage of her, I feel really bad for her.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Chinese Pros: Pretty nice and teaches, doesn't waste class time, her tests aren't too hard, as long as you study and pay attention in class, allows you to eat in class, overall a recommendable teacher Con:Sometimes her English is hard to understand, she sort of mixes Mandarin and English, but it helps to have a Chinese teacher that grew up in China","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"best chinese teacher ever!!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Super nice and caring :) She rounded my grade because she wanted me to have a good start. I don't know why people don't want to take her because of her accent, at least she tries to learn more English for her students. She teaches so I don't get why people say they don't learn anything.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"really hard for students who don't know chinese","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms.Li really cares about how the student feels. You might be bored in her class, but if you pay attention and ASK QUESTIONS, you learn and she becomes very helpful. She allows you to eat in class and you just need to study for test. Easy A","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's nice, but maybe too nice. she can't seem to be able to control the class very well, but overall it's an EZ A. don't take advantage of her!!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is so chill. Pretty easy class if you know Chinese already","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i dont understand her english or her mandarin and i didn't learn anything","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I think I'm only saying this because this is the first time I've learned Chinese, but her class is hard, at least compared to Danforth's class. She is kind though, and I think tries to be fair in grading.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If you're not already familiar with some mandarin, it may be hard to understand her, and she doesn't always explain things very well, but she goes at a slow pace and her tests are okay, as long as you study the material. She'll help anyone who needs.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she's really nice, but its kinda hard to learn from her. her class is really hard if you just begin mandarin....she uses some english in class and teaches a lot of characters","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"ms. li is nice but she's hard to understand, b/c of that accent. she teaches the vocab but the problem is she doesn't teach much about grammar structure and she doesn't really tell u the names of the strokes but keeps saying \"then u write the blah stroke\" when teaching u the vocab she gets much harder after 1st semester (chinese 1) b/c she says u need to prepare for AP chinese. also, b/c she doesnt really teach grammar, the translations on the tests can be hard if u dont already speak chinese","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"for chinese 1 she wuz good..buh fer chinese 2..she kinda got harder...she stil kan't really speak english tho...","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes an OK teacher. shes nice but u gotta know chinese before taking her cuz otherwise, u better study A LOT! she curves your grades if she sees you make an effort.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is a teacher who genuinely wants you to learn. If you study the dialogues for her test, you will do great.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i can't understand her. it's kinda funny sometimes. know some chinese before taking her","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"great teacher for chinese 2 and 3 honors. pretty easy A if you study. She was a little harder for 2nd semester of chinese 3H though.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's gotten pretty hard lately, especially in Chinese 6H. Tries to explain the difficulty by telling us about \"standards\" expected apparently by the administration, but it seems like she went overboard. Several times during the semester, I feel like Pang was better than Li, and that's telling something. However, pretty nice person though and tries to help you in succeeding in the class.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"hella easy...too easy...if she knows you know mandarin youll get an A","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"super nice. just pay attention to translations and learn your vocab and it's an easy A.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's a nice teacher. Her teaching is a little slow, which is easy if you hadn't learned Chinese yet. Her tests are easy.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Li is one of my FAVORITE teachers. She actually spends a lot of time trying to get kids to understand the material. If you're struggling with chinese, she'll offer to help you after class. You can even drop in for an extra class during your lunch or something. REALLY nice. I would definitely rec","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nice teacher, take her for AP, not Chinese 1","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i love ms li. she cant speak english that well and cant teach that well but if you listen in her clas syou can learn. she is super nice. tests can be hard sometimes but just study the characters and its easy","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes pretty cool but god .. she can get so boring when introducing new sheng zi","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"yeah, she did get harder this semester!!!!!! she used to curve grades if she sees you trying, but she Doesn't anymore. i think shes the easiest chinese teacher though...","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"super caring, offers help alot, tries hard to educate students..but her class is boring sometimes. shes kind of a pushover, but shes so nice that you wont WANT to take advantage of her. dont choose her for chinese 1 if you have no trace of a chinese background, because you'll just be confused. after youve learned the basics though, shes a pretty good teacher.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Nice person and a decent teacher, she really values translation.Submitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"borin borin borin but incredibly nice.hard tests doe.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"her class is boring, you probably wont learn anything","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Overall a pretty good teacher.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is hard to understand b/c she has a heavy accent frm Beijing. She doesn't speak Eng well. Her Mandarin is unclear compared to the other Chinese teachers. She's nice , but slow. If u understand that what she really wants is to have students learn, u will like her(supposedly out of pity). She is easier than the other Chin. teachers but not as clear/strict. She doesn't tell u to turn in hw, so do it urself or remind her or else it will be late. but hw doesn't matter THAT much.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"LI is a nice teacher, she doesn't give too much hw, but it is sometimes unclear when there is hw, maybe b/c i didn't pay attention to much, test are not too hard, hard if you don't study, you can learn if you try, easy for those who (by the way, ruin it for everyone else) b/c they already know the language. easy B","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"it is sometimes hard to understand her because of her accent. i think she goes too fast in teaching the characters. her tests are ok if you study the characters and translations, or if you already know how to write and speak chinese","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes a really nice teacher but at first its hard to understand her because she has a strong chinese accent. she grades really easy though!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"shes getting way too hard lately","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"nope nOPE its not actually that easy to get an A as they say. She's so confused and clueless that she asked fOr my name three times and was corrected three times.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"a really nice person, you definitly learn somethingSubmitted by a student","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Verrry easy if you know chinese already. Hard if you don't. Late for class sometimes. English definitely a problem. Kind though, offers help.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she got harder this semesteR!!!!!!","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Best Chinese teacher! Had her for freshman year. Her accent is a little hard to understand but you will eventually get accustomed to it. Let's us watch movies and have parties on Chinese holidays. Choose her if you are new to the Chinese language, she takes it slow for you.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"If she spoke good english, it would be a lot easier to learn but in any case, she always wants you to try your best. I think her test is fair because it is vocab and translations. :D She also lets you out early sometimes.","rating":3.8,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"she is actually pretty observant during tests dont even think about cheating, her tests are pretty hard but i failed a few and still got a b. my real grade was 75% and she bumped it to a b! super nice and helpful. her accent not that bad, just that she speaks chinese sometimes. take her !","rating":3.8,"version":1}],"rating":3.808421052631586}},"__N_SSG":true}