{"pageProps":{"teacher":{"name":"Zeljka Sutilovic","departments":["Social Science"],"semesters":["Spring2015","Fall2015","Spring2016","Fall2016","Spring2017","Fall2017","Spring2018","Fall2018","Spring2019","Fall2019","Spring2020","Fall2020","Spring2021"],"classes":[{"name":"Latin 1","block":"1","semester":"Spring2015"},{"name":"Latin 2","block":"2","semester":"Spring2015"},{"name":"Latin 3","block":"6","semester":"Spring2015"},{"name":"AP Latin","block":"5","semester":"Spring2015"},{"name":"World History","block":"2","semester":"Fall2015"},{"name":"World History","block":"4","semester":"Fall2015"},{"name":"World History","block":"6","semester":"Fall2015"},{"name":"Latin 1","block":"1","semester":"Fall2015"},{"name":"Latin 2","block":"2","semester":"Fall2015"},{"name":"World History","block":"2","semester":"Spring2016"},{"name":"World History","block":"4","semester":"Spring2016"},{"name":"World History","block":"6","semester":"Spring2016"},{"name":"Latin 1","block":"1","semester":"Spring2016"},{"name":"Latin 1","block":"7","semester":"Spring2016"},{"name":"World History","block":"3","semester":"Fall2016"},{"name":"World History","block":"7","semester":"Fall2016"},{"name":"World History","block":"8","semester":"Fall2016"},{"name":"Latin 1","block":"2","semester":"Fall2016"},{"name":"Latin 2","block":"5","semester":"Fall2016"},{"name":"World History","block":"3","semester":"Spring2017"},{"name":"World History","block":"7","semester":"Spring2017"},{"name":"World History","block":"8","semester":"Spring2017"},{"name":"Latin 1","block":"2","semester":"Spring2017"},{"name":"Latin 2","block":"5","semester":"Spring2017"},{"name":"World History","block":"2","semester":"Fall2017"},{"name":"World History","block":"3","semester":"Fall2017"},{"name":"World History","block":"5","semester":"Fall2017"},{"name":"World History","block":"6","semester":"Fall2017"},{"name":"World History","block":"8","semester":"Fall2017"},{"name":"World History","block":"2","semester":"Spring2018"},{"name":"World History","block":"3","semester":"Spring2018"},{"name":"World History","block":"5","semester":"Spring2018"},{"name":"World History","block":"6","semester":"Spring2018"},{"name":"World History","block":"8","semester":"Spring2018"},{"name":"AP European History","block":"5","semester":"Fall2018"},{"name":"AP European History","block":"7","semester":"Fall2018"},{"name":"World History","block":"1","semester":"Fall2018"},{"name":"World History","block":"3","semester":"Fall2018"},{"name":"World History","block":"1","semester":"Spring2019"},{"name":"World History","block":"3","semester":"Spring2019"},{"name":"AP European History","block":"5","semester":"Spring2019"},{"name":"AP European History","block":"7","semester":"Spring2019"},{"name":"AP European History","block":"1","semester":"Fall2019"},{"name":"AP European History","block":"7","semester":"Fall2019"},{"name":"United States History","block":"2","semester":"Fall2019"},{"name":"United States History","block":"4","semester":"Fall2019"},{"name":"AP European History","block":"1","semester":"Spring2020"},{"name":"United States History","block":"2","semester":"Spring2020"},{"name":"United States History","block":"4","semester":"Spring2020"},{"name":"AP European History","block":"7","semester":"Spring2020"},{"name":"AP European History","block":"3","semester":"Fall2020"},{"name":"AP European History","block":"6","semester":"Fall2020"},{"name":"United States History","block":"1","semester":"Fall2020"},{"name":"United States History","block":"7","semester":"Fall2020"},{"name":"AP European History","block":"3","semester":"Spring2021"},{"name":"AP European History","block":"6","semester":"Spring2021"},{"name":"United States History","block":"1","semester":"Spring2021"},{"name":"United States History","block":"7","semester":"Spring2021"}],"reviews":[{"timestamp":"2019-05-28T06:26:06.305Z","text":"Nice teacher but her lectures are mostly out of the textbook and go on tangents. She doesn't have a great grasp of grading and weights, but an A is definitely within reach.","rating":4,"version":0},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had her for modern world history. she teaches out of the book but also has her own slides. you can tell she’s passionate about what she’s teaching and knows the stuff. tests are hard if you don’t study, but just read the chapters and you’ll get an easy B, maybe even an A. makes you do lots of group work and presentations. lectures are sometimes boring and notes are tedious but would recommend.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Obviously knows the subject (MWH) very well. Although she definitely picks favorites, basically don't use your phone, don't talk too much with your friends (even during projects), and do ok on the first quizzes and tests and she'll like you enough. The tests are very inconsistent however, sometimes they are laughably easy and sometimes they are quite difficult. Basically everything is from the textbook, so read the textbook to study.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Mrs. Sutilovic is one of the greatest teachers out there. She is so sweet and funny and her accent is really pretty. Her class is extremely fun and she makes Latin super easy to learn. I was glad to have her for three semester but sadly only teaches Latin 1. Hopefully she'll be back for Latin 3 or AP Latin or I might not retake the class.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She's really passionate about teaching Latin and loves the language and culture. She has favorites but doesn't let that get in the way of fair grading for the most part. Latin is generally a super simple language and her tests are easy. Latin is just a repetition of memorizing the concepts of conjugating. It gets boring. To me, the Roman culture didn't fascinate me so it was a boring class overall. A few roots are taught. 2014 was her first year at Lowell, so she's experimenting with us.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I took Ms. Zeljka for Latin and she is a really nice teacher. She is a very easy A if you don't slack off, and she is very understanding. However, I would not recommend being late or being disrespectful because she will take it out on your grade. Homework is easy (you can ask her for help if you didn't understand something) and her tests are pretty easy too.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"An amazing teacher!! So lucky to have her this year! Very knowledgeable on history and she shows her passion for teaching as well. She will definitely prepare me for an AP exam in future years. Includes projects, participation and discussions, so you can work on your grade. Very welcoming, kind, smart teacher and one of my favorite teachers ever!!Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"i had for for latin I. really knowledgeable and passionate about the subject. she occasionally gets frustrated if someone doesn't know the answer and she is a bit on the severeside and isn't what i would call \"chill\" but i would defiantly would recommend her.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Loved her class. Put in your best effort and you'll do great in Latin. Definitely the best foreign language at Lowell.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"My son has her as a History teacher, and absolutely loves her class. She is apparently very knowledgable, with wide perspective on global issues. Teaches critical thinking, not just memorization. Gives students ample opportunity to earn a good grade. Very sensitive to rude, disrespectful behavior, and slack student work. Gives a lot, and expects a lot. An excellent preparation for an AP class. Get ready to learn and grow.Submitted by a Parent","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Ms. Sutilovic is the best! In her Latin you will learn about the good slaves! Get on her good side by having friendly conversations with her. If you are pronouncing things in her latin class, make sure to say it in a slight accent and she will think it is better. She is really nice and has a lot of fun projects. While Latin isn't the clearest language you can go to her for help. Also make jokes about the Latin textbook since it is really old and funny. Servi boni viam latam aedificābānt.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Teaches you how to think across centuries. Very strong in history. Dont use phone in her class. Projects are fun.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is super kind, helpful, always prepared,knows her stuff, wants you to talk in class, show some reaction, so students who are kinda passive get a bad grade in discussion which is all right. She gives other options to work on the grade, like a lot of options. Never surprises you with tests or projects. So, this is to the comment down bellow.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I absolutely love attending her classes. She makes class interesting and she is very knowledgeable as that she teaches us more than what is in the textbook. She is always prepared everyday with a new presentation on the chapter that we're on. She also really connects with students and loves for us to be prepared in class so she can learn something new from us. Totally would recommend taking her class if you want to learn :)Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Overall pretty good teacher. Definitely has favorites, but it's not too bad. Can get kind of frustrating because she sometimes is unclear on what's on her tests and then gives you questions on things she didn't teach. A little Eurocentric but she REALLY knows her subject so you will learn a lot. Pretty easy A and will generally give you a good education.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"I'm reviewing for Latin, not MWH. She will literally roast you if you ask a stupid question. Try to remember what she says, especially small exceptions to the rule. She is very caring towards her students and often tells endearing anecdotes about her life or her kids. Once you understand that you'll have to study and learn the declensions and definitions by heart, it's a lot easier to learn Latin. She does have favorites, but her opinion of a certain student is fluid and can change with her moodSubmitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy Latin class (it's REALLY hard not to get an A)--grades are based on tests, hw, and some projects. Some funky stuff going on with the grading though, with one hw assignment worth the same as a test--I don't think she understands categorical grading. Knows some of the material, but when she doesn't, bses for 5+ minutes & turns everything into a mess that no one can understand. Sometimes talks about how she's teaching the class so well, but she's really not. Latin is my most hated class now.","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She is so nice and helpful for history! Super kind and helpful as long as you do your work!! Love her so much!Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Amazing teacher! She's super nice and funny, extremely friendly with her students. She knows her stuff! Only warning is make sure not to have your phone out in class unless she specifically asks you to have it out.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"She doesn't understand grading at all. Several people in my class just had their grade go down by a 10-20% because she suddenly decided to make participation almost 25% of our grade. Also, she often doesn't know what she's talking about and says things that are factually incorrect, sometimes even the opposite of what is true, but no one usually picks up on it because she explains things in such a confusing way.Submitted by a student","rating":4,"version":1},{"timestamp":"0001-01-01T00:00:00.000Z","text":"Easy A. Really nice. Tries to help as much as possible. Fun projects. Not too much work.","rating":4,"version":1}],"rating":4}},"__N_SSG":true}